TMS320C2000 Assembler PC v15.12.1 Sun Feb 26 22:57:19 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
DLOG_4CH_F.asm                                                       PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                   PC v15.12.1.LTS *
       3              ;* Date/Time created: Sun Feb 26 22:57:19 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --cla_support=cla0 --float_support=fpu32 --hll_source=on --mem_model:cod
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../utility Src Files/DLOG_4CH_F.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v15.12.1.LTS Copyright (c) 1996-201
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Keith\workspace_v6_1_3\IDDK_PM_Servo_F2837x-v2\F2837x_FLAS
      13              ;       C:\ti\ccsv6\tools\compiler\ti-cgt-c2000_15.12.1.LTS\bin\opt2000.exe C:\\Users\\Keith\\AppData\\Local\

     263                      .dwpsn  file "../utility Src Files/DLOG_4CH_F.c",line 46,column 4,is_stmt,isa 0
     264 00000061 C3C5          MOVL      *+XAR5[0],XAR7        ; [CPU_] |46| 
     265                      .dwpsn  file "../utility Src Files/DLOG_4CH_F.c",line 47,column 4,is_stmt,isa 0
     266 00000062 0AC6          INC       *+XAR6[0]             ; [CPU_] |47| 
     267                      .dwpsn  file "../utility Src Files/DLOG_4CH_F.c",line 48,column 4,is_stmt,isa 0
     268 00000063 9294          MOV       AL,*+XAR4[AR0]        ; [CPU_] |48| 
     269 00000064 549C          CMP       AL,*+XAR4[AR1]        ; [CPU_] |48| 
TMS320C2000 Assembler PC v15.12.1 Sun Feb 26 22:57:19 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
DLOG_4CH_F.asm                                                       PAGE    6

     270 00000065 601B          B         $C$L2,NEQ             ; [CPU_] |48| 
     271                      ; branchcc occurs ; [] |48| 
     272                      .dwpsn  file "../utility Src Files/DLOG_4CH_F.c",line 50,column 5,is_stmt,isa 0
     273 00000066 D118          MOVB      XAR1,#24              ; [CPU_] |50| 
     274                      .dwpsn  file "../utility Src Files/DLOG_4CH_F.c",line 51,column 5,is_stmt,isa 0
     275 00000067 D014          MOVB      XAR0,#20              ; [CPU_] |51| 
     276                      .dwpsn  file "../utility Src Files/DLOG_4CH_F.c",line 50,column 5,is_stmt,isa 0
     277 00000068 2B9C          MOV       *+XAR4[AR1],#0        ; [CPU_] |50| 
     278                      .dwpsn  file "../utility Src Files/DLOG_4CH_F.c",line 51,column 5,is_stmt,isa 0
     279 00000069 56BF          MOVB      *+XAR4[AR0],#1,UNC    ; [CPU_] |51| 
         0000006a 0194 
     280 0000006b 6F15          B         $C$L2,UNC             ; [CPU_] |51| 
     281                      ; branch occurs ; [] |51| 
     282 0000006c       $C$L1:    
     283                      .dwpsn  file "../utility Src Files/DLOG_4CH_F.c",line 32,column 3,is_stmt,isa 0
     284 0000006c 83C4          MOVL      XAR5,*+XAR4[0]        ; [CPU_] |32| 
     285 0000006d D012          MOVB      XAR0,#18              ; [CPU_] |32| 
     286 0000006e E2AF          MOV32     R0H,*+XAR4[AR0]       ; [CPU_] |32| 
         0000006f 0094 
     287 00000070 E2AF          MOV32     R1H,*+XAR5[0]         ; [CPU_] |32| 
         00000071 01C5 
     288 00000072 E694          CMPF32    R1H,R0H               ; [CPU_] |32| 
         00000073 0001 
     289 00000074 AD14          MOVST0    ZF, NF                ; [CPU_] |32| 
     290 00000075 650B          B         $C$L2,LEQ             ; [CPU_] |32| 
     291                      ; branchcc occurs ; [] |32| 
     292 00000076 D010          MOVB      XAR0,#16              ; [CPU_] |32| 
     293 00000077 E2AF          MOV32     R1H,*+XAR4[AR0]       ; [CPU_] |32| 
         00000078 0194 
     294 00000079 E694          CMPF32    R1H,R0H               ; [CPU_] |32| 
         0000007a 0001 
     295 0000007b AD14          MOVST0    ZF, NF                ; [CPU_] |32| 
     296 0000007c 6304          B         $C$L2,GEQ             ; [CPU_] |32| 
     297                      ; branchcc occurs ; [] |32| 
     298                      .dwpsn  file "../utility Src Files/DLOG_4CH_F.c",line 35,column 4,is_stmt,isa 0
     299 0000007d D014          MOVB      XAR0,#20              ; [CPU_] |35| 
     300 0000007e 56BF          MOVB      *+XAR4[AR0],#2,UNC    ; [CPU_] |35| 
         0000007f 0294 
     301 00000080       $C$L2:    
     302                      .dwpsn  file "../utility Src Files/DLOG_4CH_F.c",line 56,column 2,is_stmt,isa 0
     303 00000080 83C4          MOVL      XAR5,*+XAR4[0]        ; [CPU_] |56| 
     304 00000081 D010          MOVB      XAR0,#16              ; [CPU_] |56| 
     305 00000082 06C5          MOVL      ACC,*+XAR5[0]         ; [CPU_] |56| 
     306 00000083 FE82          SUBB      SP,#2                 ; [CPU_U] 
     307                      .dwcfi  cfa_offset, -4
     308 00000084 1E94          MOVL      *+XAR4[AR0],ACC       ; [CPU_] |56| 
     309 00000085 8BBE          MOVL      XAR1,*--SP            ; [CPU_] 
     310                      .dwcfi  cfa_offset, -2
     311                      .dwcfi  restore_reg, 7
     312              $C$DW$8 .dwtag  DW_TAG_TI_branch
     313                      .dwattr $C$DW$8, DW_AT_low_pc(0x00)
     314                      .dwattr $C$DW$8, DW_AT_TI_return
     315              
     316 00000086 0006          LRETR     ; [CPU_] 
     317                      ; return occurs ; [] 
TMS320C2000 Assembler PC v15.12.1 Sun Feb 26 22:57:19 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
DLOG_4CH_F.asm                                                       PAGE    7

     318                      .dwattr $C$DW$5, DW_AT_TI_end_file("../utility Src Files/DLOG_4CH_F.c")
     319                      .dwattr $C$DW$5, DW_AT_TI_end_line(0x39)
     320                      .dwattr $C$DW$5, DW_AT_TI_end_column(0x01)
     321                      .dwendentry
     322                      .dwendtag $C$DW$5
     323              
     324              
     325              ;***************************************************************
     326              ;* TYPE INFORMATION                                            *
     327              ;***************************************************************
     328              
     329              $C$DW$T$22      .dwtag  DW_TAG_structure_type
     330                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x1a)
     331              $C$DW$9 .dwtag  DW_TAG_member
     332                      .dwattr $C$DW$9, DW_AT_type(*$C$DW$T$20)
     333                      .dwattr $C$DW$9, DW_AT_name("input_ptr1")
     334                      .dwattr $C$DW$9, DW_AT_TI_symbol_name("_input_ptr1")
     335                      .dwattr $C$DW$9, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     336                      .dwattr $C$DW$9, DW_AT_accessibility(DW_ACCESS_public)
     337              
     338              $C$DW$10        .dwtag  DW_TAG_member
     339                      .dwattr $C$DW$10, DW_AT_type(*$C$DW$T$20)
     340                      .dwattr $C$DW$10, DW_AT_name("input_ptr2")
     341                      .dwattr $C$DW$10, DW_AT_TI_symbol_name("_input_ptr2")
     342                      .dwattr $C$DW$10, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     343                      .dwattr $C$DW$10, DW_AT_accessibility(DW_ACCESS_public)
     344              
     345              $C$DW$11        .dwtag  DW_TAG_member
     346                      .dwattr $C$DW$11, DW_AT_type(*$C$DW$T$20)
     347                      .dwattr $C$DW$11, DW_AT_name("input_ptr3")
     348                      .dwattr $C$DW$11, DW_AT_TI_symbol_name("_input_ptr3")
     349                      .dwattr $C$DW$11, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     350                      .dwattr $C$DW$11, DW_AT_accessibility(DW_ACCESS_public)
     351              
     352              $C$DW$12        .dwtag  DW_TAG_member
     353                      .dwattr $C$DW$12, DW_AT_type(*$C$DW$T$20)
     354                      .dwattr $C$DW$12, DW_AT_name("input_ptr4")
     355                      .dwattr $C$DW$12, DW_AT_TI_symbol_name("_input_ptr4")
     356                      .dwattr $C$DW$12, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     357                      .dwattr $C$DW$12, DW_AT_accessibility(DW_ACCESS_public)
     358              
     359              $C$DW$13        .dwtag  DW_TAG_member
     360                      .dwattr $C$DW$13, DW_AT_type(*$C$DW$T$20)
     361                      .dwattr $C$DW$13, DW_AT_name("output_ptr1")
     362                      .dwattr $C$DW$13, DW_AT_TI_symbol_name("_output_ptr1")
     363                      .dwattr $C$DW$13, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     364                      .dwattr $C$DW$13, DW_AT_accessibility(DW_ACCESS_public)
     365              
     366              $C$DW$14        .dwtag  DW_TAG_member
     367                      .dwattr $C$DW$14, DW_AT_type(*$C$DW$T$20)
     368                      .dwattr $C$DW$14, DW_AT_name("output_ptr2")
     369                      .dwattr $C$DW$14, DW_AT_TI_symbol_name("_output_ptr2")
     370                      .dwattr $C$DW$14, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     371                      .dwattr $C$DW$14, DW_AT_accessibility(DW_ACCESS_public)
     372              
TMS320C2000 Assembler PC v15.12.1 Sun Feb 26 22:57:19 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
DLOG_4CH_F.asm                                                       PAGE    8

     373              $C$DW$15        .dwtag  DW_TAG_member
     374                      .dwattr $C$DW$15, DW_AT_type(*$C$DW$T$20)
     375                      .dwattr $C$DW$15, DW_AT_name("output_ptr3")
     376                      .dwattr $C$DW$15, DW_AT_TI_symbol_name("_output_ptr3")
     377                      .dwattr $C$DW$15, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     378                      .dwattr $C$DW$15, DW_AT_accessibility(DW_ACCESS_public)
     379              
     380              $C$DW$16        .dwtag  DW_TAG_member
     381                      .dwattr $C$DW$16, DW_AT_type(*$C$DW$T$20)
     382                      .dwattr $C$DW$16, DW_AT_name("output_ptr4")
     383                      .dwattr $C$DW$16, DW_AT_TI_symbol_name("_output_ptr4")
     384                      .dwattr $C$DW$16, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
     385                      .dwattr $C$DW$16, DW_AT_accessibility(DW_ACCESS_public)
     386              
     387              $C$DW$17        .dwtag  DW_TAG_member
     388                      .dwattr $C$DW$17, DW_AT_type(*$C$DW$T$19)
     389                      .dwattr $C$DW$17, DW_AT_name("prev_value")
     390                      .dwattr $C$DW$17, DW_AT_TI_symbol_name("_prev_value")
     391                      .dwattr $C$DW$17, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     392                      .dwattr $C$DW$17, DW_AT_accessibility(DW_ACCESS_public)
     393              
     394              $C$DW$18        .dwtag  DW_TAG_member
     395                      .dwattr $C$DW$18, DW_AT_type(*$C$DW$T$19)
     396                      .dwattr $C$DW$18, DW_AT_name("trig_value")
     397                      .dwattr $C$DW$18, DW_AT_TI_symbol_name("_trig_value")
     398                      .dwattr $C$DW$18, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
     399                      .dwattr $C$DW$18, DW_AT_accessibility(DW_ACCESS_public)
     400              
     401              $C$DW$19        .dwtag  DW_TAG_member
     402                      .dwattr $C$DW$19, DW_AT_type(*$C$DW$T$21)
     403                      .dwattr $C$DW$19, DW_AT_name("status")
     404                      .dwattr $C$DW$19, DW_AT_TI_symbol_name("_status")
     405                      .dwattr $C$DW$19, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
     406                      .dwattr $C$DW$19, DW_AT_accessibility(DW_ACCESS_public)
     407              
     408              $C$DW$20        .dwtag  DW_TAG_member
     409                      .dwattr $C$DW$20, DW_AT_type(*$C$DW$T$21)
     410                      .dwattr $C$DW$20, DW_AT_name("pre_scalar")
     411                      .dwattr $C$DW$20, DW_AT_TI_symbol_name("_pre_scalar")
     412                      .dwattr $C$DW$20, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
     413                      .dwattr $C$DW$20, DW_AT_accessibility(DW_ACCESS_public)
     414              
     415              $C$DW$21        .dwtag  DW_TAG_member
     416                      .dwattr $C$DW$21, DW_AT_type(*$C$DW$T$21)
     417                      .dwattr $C$DW$21, DW_AT_name("skip_count")
     418                      .dwattr $C$DW$21, DW_AT_TI_symbol_name("_skip_count")
     419                      .dwattr $C$DW$21, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
     420                      .dwattr $C$DW$21, DW_AT_accessibility(DW_ACCESS_public)
     421              
     422              $C$DW$22        .dwtag  DW_TAG_member
     423                      .dwattr $C$DW$22, DW_AT_type(*$C$DW$T$21)
     424                      .dwattr $C$DW$22, DW_AT_name("size")
     425                      .dwattr $C$DW$22, DW_AT_TI_symbol_name("_size")
     426                      .dwattr $C$DW$22, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
     427                      .dwattr $C$DW$22, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.1 Sun Feb 26 22:57:19 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
DLOG_4CH_F.asm                                                       PAGE    9

     428              
     429              $C$DW$23        .dwtag  DW_TAG_member
     430                      .dwattr $C$DW$23, DW_AT_type(*$C$DW$T$21)
     431                      .dwattr $C$DW$23, DW_AT_name("count")
     432                      .dwattr $C$DW$23, DW_AT_TI_symbol_name("_count")
     433                      .dwattr $C$DW$23, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
     434                      .dwattr $C$DW$23, DW_AT_accessibility(DW_ACCESS_public)
     435              
     436                      .dwendtag $C$DW$T$22
     437              
     438              $C$DW$T$23      .dwtag  DW_TAG_typedef
     439                      .dwattr $C$DW$T$23, DW_AT_name("DLOG_4CH_F")
     440                      .dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$22)
     441                      .dwattr $C$DW$T$23, DW_AT_language(DW_LANG_C)
     442              
     443              $C$DW$T$24      .dwtag  DW_TAG_pointer_type
     444                      .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$23)
     445                      .dwattr $C$DW$T$24, DW_AT_address_class(0x20)
     446              
     447              $C$DW$24        .dwtag  DW_TAG_TI_far_type
     448                      .dwattr $C$DW$24, DW_AT_type(*$C$DW$T$24)
     449              
     450              $C$DW$T$25      .dwtag  DW_TAG_const_type
     451                      .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$24)
     452              
     453              $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
     454                      .dwattr $C$DW$T$2, DW_AT_name("void")
     455              
     456              $C$DW$T$4       .dwtag  DW_TAG_base_type
     457                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
     458                      .dwattr $C$DW$T$4, DW_AT_name("bool")
     459                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
     460              
     461              $C$DW$T$5       .dwtag  DW_TAG_base_type
     462                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
     463                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
     464                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
     465              
     466              $C$DW$T$6       .dwtag  DW_TAG_base_type
     467                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
     468                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
     469                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
     470              
     471              $C$DW$T$7       .dwtag  DW_TAG_base_type
     472                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
     473                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
     474                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
     475              
     476              $C$DW$T$8       .dwtag  DW_TAG_base_type
     477                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
     478                      .dwattr $C$DW$T$8, DW_AT_name("short")
     479                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
     480              
     481              $C$DW$T$9       .dwtag  DW_TAG_base_type
     482                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
TMS320C2000 Assembler PC v15.12.1 Sun Feb 26 22:57:19 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
DLOG_4CH_F.asm                                                       PAGE   10

     483                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
     484                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
     485              
     486              $C$DW$T$10      .dwtag  DW_TAG_base_type
     487                      .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
     488                      .dwattr $C$DW$T$10, DW_AT_name("int")
     489                      .dwattr $C$DW$T$10, DW_AT_byte_size(0x01)
     490              
     491              $C$DW$T$21      .dwtag  DW_TAG_typedef
     492                      .dwattr $C$DW$T$21, DW_AT_name("int16")
     493                      .dwattr $C$DW$T$21, DW_AT_type(*$C$DW$T$10)
     494                      .dwattr $C$DW$T$21, DW_AT_language(DW_LANG_C)
