TMS320C2000 Assembler PC v15.12.1 Sun May 28 10:39:58 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
endat.asm                                                            PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                   PC v15.12.1.LTS *
       3              ;* Date/Time created: Sun May 28 10:39:58 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --cla_support=cla0 --float_support=fpu32 --hll_source=on --mem_model:cod
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../endat.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v15.12.1.LTS Copyright (c) 1996-201
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Keith\Documents\GitHub\ElectricSkateboard\Software\IDDK_PM
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram
      15                      .dwattr $C$DW$1, DW_AT_name("PM_endat22_setFreq")
      16                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_PM_endat22_setFreq")

         00000387 0000 
    2240                      .dwpsn  file "../endat.c",line 386,column 2,is_stmt,isa 0
    2241 00000388 9600-         MOV       @_retval1,AL          ; [CPU_] |386| 
    2242                      .dwpsn  file "../endat.c",line 389,column 2,is_stmt,isa 0
    2243 00000389 A044          MOVL      *-SP[4],XAR5          ; [CPU_] |389| 
    2244 0000038a 761F-         MOVW      DP,#_endat22Data+22   ; [CPU_U] 
         0000038b 0001 
    2245 0000038c A846          MOVL      *-SP[6],XAR4          ; [CPU_] |389| 
    2246 0000038d 0616-         MOVL      ACC,@_endat22Data+22  ; [CPU_] |389| 
    2247 0000038e 8F00-         MOVL      XAR4,#_endat22CRCtable ; [CPU_U] |389| 
         0000038f 00C0 
    2248 00000390 C348          MOVL      *-SP[8],XAR7          ; [CPU_] |389| 
    2249 00000391 C24A          MOVL      *-SP[10],XAR6         ; [CPU_] |389| 
    2250              $C$DW$151       .dwtag  DW_TAG_TI_branch
    2251                      .dwattr $C$DW$151, DW_AT_low_pc(0x00)
    2252                      .dwattr $C$DW$151, DW_AT_name("_PM_endat22_getCrcPos")
    2253                      .dwattr $C$DW$151, DW_AT_TI_call
    2254              
    2255 00000392 7640!         LCR       #_PM_endat22_getCrcPos ; [CPU_] |389| 
         00000393 0000 
    2256                      ; call occurs [#_PM_endat22_getCrcPos] ; [] |389| 
    2257 00000394 761F-         MOVW      DP,#_crc5_result      ; [CPU_U] 
         00000395 0000 
    2258 00000396 9601-         MOV       @_crc5_result,AL      ; [CPU_] |389| 
    2259 00000397 761F-         MOVW      DP,#_endat22Data+7    ; [CPU_U] 
         00000398 0001 
TMS320C2000 Assembler PC v15.12.1 Sun May 28 10:39:58 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
endat.asm                                                            PAGE   47

    2260                      .dwpsn  file "../endat.c",line 392,column 2,is_stmt,isa 0
    2261 00000399 9307-         MOV       AH,@_endat22Data+7    ; [CPU_] |392| 
    2262              $C$DW$152       .dwtag  DW_TAG_TI_branch
    2263                      .dwattr $C$DW$152, DW_AT_low_pc(0x00)
    2264                      .dwattr $C$DW$152, DW_AT_name("_CheckCRC")
    2265                      .dwattr $C$DW$152, DW_AT_TI_call
    2266              
    2267 0000039a 7640'         LCR       #_CheckCRC            ; [CPU_] |392| 
         0000039b 0207 
    2268                      ; call occurs [#_CheckCRC] ; [] |392| 
    2269 0000039c 5200          CMPB      AL,#0                 ; [CPU_] |392| 
    2270 0000039d 6002          B         $C$L28,NEQ            ; [CPU_] |392| 
    2271                      ; branchcc occurs ; [] |392| 
    2272 0000039e 7625   ESTOP0
    2273 0000039f       $C$L28:    
    2274 0000039f FE8A          SUBB      SP,#10                ; [CPU_U] 
    2275                      .dwcfi  cfa_offset, -2
    2276 000003a0 FF69          SPM       #0                    ; [CPU_] 
    2277              $C$DW$153       .dwtag  DW_TAG_TI_branch
    2278                      .dwattr $C$DW$153, DW_AT_low_pc(0x00)
    2279                      .dwattr $C$DW$153, DW_AT_TI_return
    2280              
    2281 000003a1 0006          LRETR     ; [CPU_] 
    2282                      ; return occurs ; [] 
    2283                      .dwattr $C$DW$147, DW_AT_TI_end_file("../endat.c")
    2284                      .dwattr $C$DW$147, DW_AT_TI_end_line(0x18c)
    2285                      .dwattr $C$DW$147, DW_AT_TI_end_column(0x01)
    2286                      .dwendentry
    2287                      .dwendtag $C$DW$147
    2288              
    2289              ;**************************************************************
    2290              ;* UNDEFINED EXTERNAL REFERENCES                              *
    2291              ;**************************************************************
    2292                      .global _PM_endat22_setFreq
    2293                      .global _PM_endat22_startOperation
    2294                      .global _F28x_usDelay
    2295                      .global _PM_endat22_setupPeriph
    2296                      .global _PM_endat22_generateCRCTable
    2297                      .global _PM_endat22_setupCommand
    2298                      .global _PM_endat22_receiveData
    2299                      .global _PM_endat22_getDelayCompVal
    2300                      .global _PM_endat22_getCrcPos
    2301                      .global _PM_endat22_getCrcNorm
    2302                      .global _SpibRegs
    2303                      .global _PieCtrlRegs
    2304                      .global _InputXbarRegs
    2305                      .global _GpioDataRegs
    2306                      .global _CpuSysRegs
    2307                      .global _EPwm4Regs
    2308                      .global _GpioCtrlRegs
    2309                      .global _PieVectTable
    2310              
    2311              ;***************************************************************
    2312              ;* TYPE INFORMATION                                            *
    2313              ;***************************************************************
TMS320C2000 Assembler PC v15.12.1 Sun May 28 10:39:58 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
endat.asm                                                            PAGE   48

    2314              
    2315              $C$DW$T$24      .dwtag  DW_TAG_structure_type
    2316                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x5e)
    2317              $C$DW$154       .dwtag  DW_TAG_member
    2318                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$19)
    2319                      .dwattr $C$DW$154, DW_AT_name("position_lo")
    2320                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_position_lo")
    2321                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2322                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    2323              
    2324              $C$DW$155       .dwtag  DW_TAG_member
    2325                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$19)
    2326                      .dwattr $C$DW$155, DW_AT_name("position_hi")
    2327                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_position_hi")
    2328                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2329                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    2330              
    2331              $C$DW$156       .dwtag  DW_TAG_member
    2332                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$20)
    2333                      .dwattr $C$DW$156, DW_AT_name("error1")
    2334                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_error1")
    2335                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2336                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    2337              
    2338              $C$DW$157       .dwtag  DW_TAG_member
    2339                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$20)
    2340                      .dwattr $C$DW$157, DW_AT_name("error2")
    2341                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_error2")
    2342                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2343                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    2344              
    2345              $C$DW$158       .dwtag  DW_TAG_member
    2346                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$20)
    2347                      .dwattr $C$DW$158, DW_AT_name("data")
    2348                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_data")
    2349                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2350                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    2351              
    2352              $C$DW$159       .dwtag  DW_TAG_member
    2353                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$20)
    2354                      .dwattr $C$DW$159, DW_AT_name("data_crc")
    2355                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_data_crc")
    2356                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    2357                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    2358              
    2359              $C$DW$160       .dwtag  DW_TAG_member
    2360                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$20)
    2361                      .dwattr $C$DW$160, DW_AT_name("address")
    2362                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_address")
    2363                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2364                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    2365              
    2366              $C$DW$161       .dwtag  DW_TAG_member
    2367                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$19)
    2368                      .dwattr $C$DW$161, DW_AT_name("additional_data1")
TMS320C2000 Assembler PC v15.12.1 Sun May 28 10:39:58 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
endat.asm                                                            PAGE   49

    2369                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_additional_data1")
    2370                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2371                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    2372              
    2373              $C$DW$162       .dwtag  DW_TAG_member
    2374                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$19)
    2375                      .dwattr $C$DW$162, DW_AT_name("additional_data2")
    2376                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_additional_data2")
    2377                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2378                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    2379              
    2380              $C$DW$163       .dwtag  DW_TAG_member
    2381                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$19)
    2382                      .dwattr $C$DW$163, DW_AT_name("additional_data1_crc")
    2383                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_additional_data1_crc")
    2384                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    2385                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    2386              
    2387              $C$DW$164       .dwtag  DW_TAG_member
    2388                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$19)
    2389                      .dwattr $C$DW$164, DW_AT_name("additional_data2_crc")
    2390                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_additional_data2_crc")
    2391                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2392                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    2393              
    2394              $C$DW$165       .dwtag  DW_TAG_member
    2395                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$19)
    2396                      .dwattr $C$DW$165, DW_AT_name("test_lo")
    2397                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_test_lo")
    2398                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    2399                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    2400              
    2401              $C$DW$166       .dwtag  DW_TAG_member
    2402                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$19)
    2403                      .dwattr $C$DW$166, DW_AT_name("test_hi")
    2404                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_test_hi")
    2405                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2406                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    2407              
    2408              $C$DW$167       .dwtag  DW_TAG_member
    2409                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$19)
    2410                      .dwattr $C$DW$167, DW_AT_name("position_clocks")
    2411                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_position_clocks")
    2412                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    2413                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    2414              
    2415              $C$DW$168       .dwtag  DW_TAG_member
    2416                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$22)
    2417                      .dwattr $C$DW$168, DW_AT_name("spi")
    2418                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_spi")
    2419                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2420                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    2421              
    2422              $C$DW$169       .dwtag  DW_TAG_member
    2423                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v15.12.1 Sun May 28 10:39:58 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
endat.asm                                                            PAGE   50

    2424                      .dwattr $C$DW$169, DW_AT_name("delay_comp")
    2425                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_delay_comp")
    2426                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    2427                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    2428              
    2429              $C$DW$170       .dwtag  DW_TAG_member
    2430                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$23)
    2431                      .dwattr $C$DW$170, DW_AT_name("sdata")
    2432                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_sdata")
    2433                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2434                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    2435              
    2436              $C$DW$171       .dwtag  DW_TAG_member
    2437                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$23)
    2438                      .dwattr $C$DW$171, DW_AT_name("rdata")
    2439                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_rdata")
    2440                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    2441                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    2442              
    2443              $C$DW$172       .dwtag  DW_TAG_member
    2444                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$20)
    2445                      .dwattr $C$DW$172, DW_AT_name("dataReady")
    2446                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_dataReady")
    2447                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    2448                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    2449              
    2450              $C$DW$173       .dwtag  DW_TAG_member
    2451                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$20)
    2452                      .dwattr $C$DW$173, DW_AT_name("fifo_level")
    2453                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_fifo_level")
    2454                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x5d]
    2455                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    2456              
    2457                      .dwendtag $C$DW$T$24
    2458              
    2459              $C$DW$T$537     .dwtag  DW_TAG_typedef
    2460                      .dwattr $C$DW$T$537, DW_AT_name("ENDAT_DATA_STRUCT")
    2461                      .dwattr $C$DW$T$537, DW_AT_type(*$C$DW$T$24)
    2462                      .dwattr $C$DW$T$537, DW_AT_language(DW_LANG_C)
    2463              
    2464              
    2465              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    2466                      .dwattr $C$DW$T$26, DW_AT_name("AQCSFRC_BITS")
    2467                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x01)
    2468              $C$DW$174       .dwtag  DW_TAG_member
    2469                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$25)
    2470                      .dwattr $C$DW$174, DW_AT_name("CSFA")
    2471                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_CSFA")
    2472                      .dwattr $C$DW$174, DW_AT_bit_offset(0x0e)
    2473                      .dwattr $C$DW$174, DW_AT_bit_size(0x02)
    2474                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2475                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    2476              
    2477              $C$DW$175       .dwtag  DW_TAG_member
    2478                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$25)
TMS320C2000 Assembler PC v15.12.1 Sun May 28 10:39:58 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
endat.asm                                                            PAGE   51

    2479                      .dwattr $C$DW$175, DW_AT_name("CSFB")
    2480                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_CSFB")
    2481                      .dwattr $C$DW$175, DW_AT_bit_offset(0x0c)
    2482                      .dwattr $C$DW$175, DW_AT_bit_size(0x02)
    2483                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2484                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    2485              
    2486              $C$DW$176       .dwtag  DW_TAG_member
    2487                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$25)
    2488                      .dwattr $C$DW$176, DW_AT_name("rsvd1")
    2489                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_rsvd1")
    2490                      .dwattr $C$DW$176, DW_AT_bit_offset(0x00)
    2491                      .dwattr $C$DW$176, DW_AT_bit_size(0x0c)
    2492                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2493                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    2494              
    2495                      .dwendtag $C$DW$T$26
    2496              
    2497              
    2498              $C$DW$T$27      .dwtag  DW_TAG_union_type
    2499                      .dwattr $C$DW$T$27, DW_AT_name("AQCSFRC_REG")
    2500                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x01)
    2501              $C$DW$177       .dwtag  DW_TAG_member
    2502                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$25)
    2503                      .dwattr $C$DW$177, DW_AT_name("all")
    2504                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_all")
    2505                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2506                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    2507              
    2508              $C$DW$178       .dwtag  DW_TAG_member
    2509                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$26)
    2510                      .dwattr $C$DW$178, DW_AT_name("bit")
    2511                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_bit")
    2512                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2513                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    2514              
    2515                      .dwendtag $C$DW$T$27
    2516              
    2517              
    2518              $C$DW$T$28      .dwtag  DW_TAG_structure_type
    2519                      .dwattr $C$DW$T$28, DW_AT_name("AQCTLA2_BITS")
    2520                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x01)
    2521              $C$DW$179       .dwtag  DW_TAG_member
    2522                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$25)
    2523                      .dwattr $C$DW$179, DW_AT_name("T1U")
    2524                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_T1U")
    2525                      .dwattr $C$DW$179, DW_AT_bit_offset(0x0e)
    2526                      .dwattr $C$DW$179, DW_AT_bit_size(0x02)
    2527                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2528                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    2529              
    2530              $C$DW$180       .dwtag  DW_TAG_member
    2531                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$25)
    2532                      .dwattr $C$DW$180, DW_AT_name("T1D")
    2533                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_T1D")
TMS320C2000 Assembler PC v15.12.1 Sun May 28 10:39:58 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
endat.asm                                                            PAGE   52

    2534                      .dwattr $C$DW$180, DW_AT_bit_offset(0x0c)
    2535                      .dwattr $C$DW$180, DW_AT_bit_size(0x02)
    2536                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2537                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    2538              
    2539              $C$DW$181       .dwtag  DW_TAG_member
    2540                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$25)
    2541                      .dwattr $C$DW$181, DW_AT_name("T2U")
    2542                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_T2U")
    2543                      .dwattr $C$DW$181, DW_AT_bit_offset(0x0a)
    2544                      .dwattr $C$DW$181, DW_AT_bit_size(0x02)
    2545                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2546                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    2547              
    2548              $C$DW$182       .dwtag  DW_TAG_member
    2549                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$25)
    2550                      .dwattr $C$DW$182, DW_AT_name("T2D")
    2551                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_T2D")
    2552                      .dwattr $C$DW$182, DW_AT_bit_offset(0x08)
    2553                      .dwattr $C$DW$182, DW_AT_bit_size(0x02)
    2554                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2555                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    2556              
    2557              $C$DW$183       .dwtag  DW_TAG_member
    2558                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$25)
    2559                      .dwattr $C$DW$183, DW_AT_name("rsvd1")
    2560                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_rsvd1")
    2561                      .dwattr $C$DW$183, DW_AT_bit_offset(0x00)
    2562                      .dwattr $C$DW$183, DW_AT_bit_size(0x08)
    2563                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2564                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    2565              
    2566                      .dwendtag $C$DW$T$28
    2567              
    2568              
    2569              $C$DW$T$29      .dwtag  DW_TAG_union_type
    2570                      .dwattr $C$DW$T$29, DW_AT_name("AQCTLA2_REG")
    2571                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x01)
    2572              $C$DW$184       .dwtag  DW_TAG_member
    2573                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$25)
    2574                      .dwattr $C$DW$184, DW_AT_name("all")
    2575                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_all")
    2576                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2577                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    2578              
    2579              $C$DW$185       .dwtag  DW_TAG_member
    2580                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$28)
    2581                      .dwattr $C$DW$185, DW_AT_name("bit")
    2582                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_bit")
    2583                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2584                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    2585              
    2586                      .dwendtag $C$DW$T$29
    2587              
    2588              
TMS320C2000 Assembler PC v15.12.1 Sun May 28 10:39:58 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
endat.asm                                                            PAGE   53

    2589              $C$DW$T$30      .dwtag  DW_TAG_structure_type
    2590                      .dwattr $C$DW$T$30, DW_AT_name("AQCTLA_BITS")
    2591                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x01)
    2592              $C$DW$186       .dwtag  DW_TAG_member
    2593                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$25)
    2594                      .dwattr $C$DW$186, DW_AT_name("ZRO")
    2595                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_ZRO")
    2596                      .dwattr $C$DW$186, DW_AT_bit_offset(0x0e)
    2597                      .dwattr $C$DW$186, DW_AT_bit_size(0x02)
    2598                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2599                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    2600              
    2601              $C$DW$187       .dwtag  DW_TAG_member
    2602                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$25)
    2603                      .dwattr $C$DW$187, DW_AT_name("PRD")
    2604                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_PRD")
    2605                      .dwattr $C$DW$187, DW_AT_bit_offset(0x0c)
    2606                      .dwattr $C$DW$187, DW_AT_bit_size(0x02)
    2607                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2608                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    2609              
    2610              $C$DW$188       .dwtag  DW_TAG_member
    2611                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$25)
    2612                      .dwattr $C$DW$188, DW_AT_name("CAU")
    2613                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_CAU")
    2614                      .dwattr $C$DW$188, DW_AT_bit_offset(0x0a)
    2615                      .dwattr $C$DW$188, DW_AT_bit_size(0x02)
    2616                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2617                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    2618              
    2619              $C$DW$189       .dwtag  DW_TAG_member
    2620                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$25)
    2621                      .dwattr $C$DW$189, DW_AT_name("CAD")
    2622                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_CAD")
    2623                      .dwattr $C$DW$189, DW_AT_bit_offset(0x08)
    2624                      .dwattr $C$DW$189, DW_AT_bit_size(0x02)
    2625                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2626                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    2627              
    2628              $C$DW$190       .dwtag  DW_TAG_member
    2629                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$25)
    2630                      .dwattr $C$DW$190, DW_AT_name("CBU")
    2631                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_CBU")
    2632                      .dwattr $C$DW$190, DW_AT_bit_offset(0x06)
    2633                      .dwattr $C$DW$190, DW_AT_bit_size(0x02)
    2634                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2635                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    2636              
    2637              $C$DW$191       .dwtag  DW_TAG_member
    2638                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$25)
    2639                      .dwattr $C$DW$191, DW_AT_name("CBD")
    2640                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_CBD")
    2641                      .dwattr $C$DW$191, DW_AT_bit_offset(0x04)
    2642                      .dwattr $C$DW$191, DW_AT_bit_size(0x02)
    2643                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v15.12.1 Sun May 28 10:39:58 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
endat.asm                                                            PAGE   54

    2644                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    2645              
    2646              $C$DW$192       .dwtag  DW_TAG_member
    2647                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$25)
    2648                      .dwattr $C$DW$192, DW_AT_name("rsvd1")
    2649                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_rsvd1")
    2650                      .dwattr $C$DW$192, DW_AT_bit_offset(0x00)
    2651                      .dwattr $C$DW$192, DW_AT_bit_size(0x04)
    2652                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2653                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    2654              
    2655                      .dwendtag $C$DW$T$30
    2656              
    2657              
    2658              $C$DW$T$31      .dwtag  DW_TAG_union_type
    2659                      .dwattr $C$DW$T$31, DW_AT_name("AQCTLA_REG")
    2660                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x01)
    2661              $C$DW$193       .dwtag  DW_TAG_member
    2662                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$25)
    2663                      .dwattr $C$DW$193, DW_AT_name("all")
    2664                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_all")
    2665                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2666                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    2667              
    2668              $C$DW$194       .dwtag  DW_TAG_member
    2669                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$30)
    2670                      .dwattr $C$DW$194, DW_AT_name("bit")
    2671                      .dwattr $C$DW$194, DW_AT_TI_symbol_name("_bit")
    2672                      .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2673                      .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    2674              
    2675                      .dwendtag $C$DW$T$31
    2676              
    2677              
    2678              $C$DW$T$32      .dwtag  DW_TAG_structure_type
    2679                      .dwattr $C$DW$T$32, DW_AT_name("AQCTLB2_BITS")
    2680                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x01)
    2681              $C$DW$195       .dwtag  DW_TAG_member
    2682                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$25)
    2683                      .dwattr $C$DW$195, DW_AT_name("T1U")
    2684                      .dwattr $C$DW$195, DW_AT_TI_symbol_name("_T1U")
    2685                      .dwattr $C$DW$195, DW_AT_bit_offset(0x0e)
    2686                      .dwattr $C$DW$195, DW_AT_bit_size(0x02)
    2687                      .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2688                      .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    2689              
    2690              $C$DW$196       .dwtag  DW_TAG_member
    2691                      .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$25)
    2692                      .dwattr $C$DW$196, DW_AT_name("T1D")
    2693                      .dwattr $C$DW$196, DW_AT_TI_symbol_name("_T1D")
    2694                      .dwattr $C$DW$196, DW_AT_bit_offset(0x0c)
    2695                      .dwattr $C$DW$196, DW_AT_bit_size(0x02)
    2696                      .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2697                      .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    2698              
TMS320C2000 Assembler PC v15.12.1 Sun May 28 10:39:58 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
endat.asm                                                            PAGE   55

    2699              $C$DW$197       .dwtag  DW_TAG_member
    2700                      .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$25)
    2701                      .dwattr $C$DW$197, DW_AT_name("T2U")
    2702                      .dwattr $C$DW$197, DW_AT_TI_symbol_name("_T2U")
    2703                      .dwattr $C$DW$197, DW_AT_bit_offset(0x0a)
    2704                      .dwattr $C$DW$197, DW_AT_bit_size(0x02)
    2705                      .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2706                      .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    2707              
    2708              $C$DW$198       .dwtag  DW_TAG_member
    2709                      .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$25)
    2710                      .dwattr $C$DW$198, DW_AT_name("T2D")
    2711                      .dwattr $C$DW$198, DW_AT_TI_symbol_name("_T2D")
    2712                      .dwattr $C$DW$198, DW_AT_bit_offset(0x08)
    2713                      .dwattr $C$DW$198, DW_AT_bit_size(0x02)
    2714                      .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2715                      .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    2716              
    2717              $C$DW$199       .dwtag  DW_TAG_member
    2718                      .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$25)
    2719                      .dwattr $C$DW$199, DW_AT_name("rsvd1")
    2720                      .dwattr $C$DW$199, DW_AT_TI_symbol_name("_rsvd1")
    2721                      .dwattr $C$DW$199, DW_AT_bit_offset(0x00)
    2722                      .dwattr $C$DW$199, DW_AT_bit_size(0x08)
    2723                      .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2724                      .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    2725              
    2726                      .dwendtag $C$DW$T$32
    2727              
    2728              
    2729              $C$DW$T$33      .dwtag  DW_TAG_union_type
    2730                      .dwattr $C$DW$T$33, DW_AT_name("AQCTLB2_REG")
    2731                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
    2732              $C$DW$200       .dwtag  DW_TAG_member
    2733                      .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$25)
    2734                      .dwattr $C$DW$200, DW_AT_name("all")
    2735                      .dwattr $C$DW$200, DW_AT_TI_symbol_name("_all")
    2736                      .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2737                      .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    2738              
    2739              $C$DW$201       .dwtag  DW_TAG_member
    2740                      .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$32)
    2741                      .dwattr $C$DW$201, DW_AT_name("bit")
    2742                      .dwattr $C$DW$201, DW_AT_TI_symbol_name("_bit")
    2743                      .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2744                      .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    2745              
    2746                      .dwendtag $C$DW$T$33
    2747              
    2748              
    2749              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    2750                      .dwattr $C$DW$T$34, DW_AT_name("AQCTLB_BITS")
    2751                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
    2752              $C$DW$202       .dwtag  DW_TAG_member
    2753                      .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$25)
TMS320C2000 Assembler PC v15.12.1 Sun May 28 10:39:58 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
endat.asm                                                            PAGE   56

    2754                      .dwattr $C$DW$202, DW_AT_name("ZRO")
    2755                      .dwattr $C$DW$202, DW_AT_TI_symbol_name("_ZRO")
    2756                      .dwattr $C$DW$202, DW_AT_bit_offset(0x0e)
    2757                      .dwattr $C$DW$202, DW_AT_bit_size(0x02)
    2758                      .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2759                      .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    2760              
    2761              $C$DW$203       .dwtag  DW_TAG_member
    2762                      .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$25)
    2763                      .dwattr $C$DW$203, DW_AT_name("PRD")
    2764                      .dwattr $C$DW$203, DW_AT_TI_symbol_name("_PRD")
    2765                      .dwattr $C$DW$203, DW_AT_bit_offset(0x0c)
    2766                      .dwattr $C$DW$203, DW_AT_bit_size(0x02)
    2767                      .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2768                      .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    2769              
    2770              $C$DW$204       .dwtag  DW_TAG_member
    2771                      .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$25)
    2772                      .dwattr $C$DW$204, DW_AT_name("CAU")
    2773                      .dwattr $C$DW$204, DW_AT_TI_symbol_name("_CAU")
    2774                      .dwattr $C$DW$204, DW_AT_bit_offset(0x0a)
    2775                      .dwattr $C$DW$204, DW_AT_bit_size(0x02)
    2776                      .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2777                      .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    2778              
    2779              $C$DW$205       .dwtag  DW_TAG_member
    2780                      .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$25)
    2781                      .dwattr $C$DW$205, DW_AT_name("CAD")
    2782                      .dwattr $C$DW$205, DW_AT_TI_symbol_name("_CAD")
    2783                      .dwattr $C$DW$205, DW_AT_bit_offset(0x08)
    2784                      .dwattr $C$DW$205, DW_AT_bit_size(0x02)
    2785                      .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2786                      .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    2787              
    2788              $C$DW$206       .dwtag  DW_TAG_member
    2789                      .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$25)
    2790                      .dwattr $C$DW$206, DW_AT_name("CBU")
    2791                      .dwattr $C$DW$206, DW_AT_TI_symbol_name("_CBU")
    2792                      .dwattr $C$DW$206, DW_AT_bit_offset(0x06)
    2793                      .dwattr $C$DW$206, DW_AT_bit_size(0x02)
    2794                      .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2795                      .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    2796              
    2797              $C$DW$207       .dwtag  DW_TAG_member
    2798                      .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$25)
    2799                      .dwattr $C$DW$207, DW_AT_name("CBD")
    2800                      .dwattr $C$DW$207, DW_AT_TI_symbol_name("_CBD")
    2801                      .dwattr $C$DW$207, DW_AT_bit_offset(0x04)
    2802                      .dwattr $C$DW$207, DW_AT_bit_size(0x02)
    2803                      .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2804                      .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    2805              
    2806              $C$DW$208       .dwtag  DW_TAG_member
    2807                      .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$25)
    2808                      .dwattr $C$DW$208, DW_AT_name("rsvd1")
TMS320C2000 Assembler PC v15.12.1 Sun May 28 10:39:58 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
endat.asm                                                            PAGE   57

    2809                      .dwattr $C$DW$208, DW_AT_TI_symbol_name("_rsvd1")
    2810                      .dwattr $C$DW$208, DW_AT_bit_offset(0x00)
    2811                      .dwattr $C$DW$208, DW_AT_bit_size(0x04)
    2812                      .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2813                      .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    2814              
    2815                      .dwendtag $C$DW$T$34
    2816              
    2817              
    2818              $C$DW$T$35      .dwtag  DW_TAG_union_type
    2819                      .dwattr $C$DW$T$35, DW_AT_name("AQCTLB_REG")
    2820                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x01)
    2821              $C$DW$209       .dwtag  DW_TAG_member
    2822                      .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$25)
    2823                      .dwattr $C$DW$209, DW_AT_name("all")
    2824                      .dwattr $C$DW$209, DW_AT_TI_symbol_name("_all")
    2825                      .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2826                      .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    2827              
    2828              $C$DW$210       .dwtag  DW_TAG_member
    2829                      .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$34)
    2830                      .dwattr $C$DW$210, DW_AT_name("bit")
    2831                      .dwattr $C$DW$210, DW_AT_TI_symbol_name("_bit")
    2832                      .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2833                      .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    2834              
    2835                      .dwendtag $C$DW$T$35
    2836              
    2837              
    2838              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    2839                      .dwattr $C$DW$T$36, DW_AT_name("AQCTL_BITS")
    2840                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x01)
    2841              $C$DW$211       .dwtag  DW_TAG_member
    2842                      .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$25)
    2843                      .dwattr $C$DW$211, DW_AT_name("LDAQAMODE")
    2844                      .dwattr $C$DW$211, DW_AT_TI_symbol_name("_LDAQAMODE")
    2845                      .dwattr $C$DW$211, DW_AT_bit_offset(0x0e)
    2846                      .dwattr $C$DW$211, DW_AT_bit_size(0x02)
    2847                      .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2848                      .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    2849              
    2850              $C$DW$212       .dwtag  DW_TAG_member
    2851                      .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$25)
    2852                      .dwattr $C$DW$212, DW_AT_name("LDAQBMODE")
    2853                      .dwattr $C$DW$212, DW_AT_TI_symbol_name("_LDAQBMODE")
    2854                      .dwattr $C$DW$212, DW_AT_bit_offset(0x0c)
    2855                      .dwattr $C$DW$212, DW_AT_bit_size(0x02)
    2856                      .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2857                      .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    2858              
    2859              $C$DW$213       .dwtag  DW_TAG_member
    2860                      .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$25)
    2861                      .dwattr $C$DW$213, DW_AT_name("SHDWAQAMODE")
    2862                      .dwattr $C$DW$213, DW_AT_TI_symbol_name("_SHDWAQAMODE")
    2863                      .dwattr $C$DW$213, DW_AT_bit_offset(0x0b)
TMS320C2000 Assembler PC v15.12.1 Sun May 28 10:39:58 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
endat.asm                                                            PAGE   58

    2864                      .dwattr $C$DW$213, DW_AT_bit_size(0x01)
    2865                      .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2866                      .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    2867              
    2868              $C$DW$214       .dwtag  DW_TAG_member
    2869                      .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$25)
    2870                      .dwattr $C$DW$214, DW_AT_name("rsvd1")
    2871                      .dwattr $C$DW$214, DW_AT_TI_symbol_name("_rsvd1")
    2872                      .dwattr $C$DW$214, DW_AT_bit_offset(0x0a)
    2873                      .dwattr $C$DW$214, DW_AT_bit_size(0x01)
    2874                      .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2875                      .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    2876              
    2877              $C$DW$215       .dwtag  DW_TAG_member
    2878                      .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$25)
    2879                      .dwattr $C$DW$215, DW_AT_name("SHDWAQBMODE")
    2880                      .dwattr $C$DW$215, DW_AT_TI_symbol_name("_SHDWAQBMODE")
    2881                      .dwattr $C$DW$215, DW_AT_bit_offset(0x09)
    2882                      .dwattr $C$DW$215, DW_AT_bit_size(0x01)
    2883                      .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2884                      .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    2885              
    2886              $C$DW$216       .dwtag  DW_TAG_member
    2887                      .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$25)
    2888                      .dwattr $C$DW$216, DW_AT_name("rsvd2")
    2889                      .dwattr $C$DW$216, DW_AT_TI_symbol_name("_rsvd2")
    2890                      .dwattr $C$DW$216, DW_AT_bit_offset(0x08)
    2891                      .dwattr $C$DW$216, DW_AT_bit_size(0x01)
    2892                      .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2893                      .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    2894              
    2895              $C$DW$217       .dwtag  DW_TAG_member
    2896                      .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$25)
    2897                      .dwattr $C$DW$217, DW_AT_name("LDAQASYNC")
    2898                      .dwattr $C$DW$217, DW_AT_TI_symbol_name("_LDAQASYNC")
    2899                      .dwattr $C$DW$217, DW_AT_bit_offset(0x06)
    2900                      .dwattr $C$DW$217, DW_AT_bit_size(0x02)
    2901                      .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2902                      .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    2903              
    2904              $C$DW$218       .dwtag  DW_TAG_member
    2905                      .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$25)
    2906                      .dwattr $C$DW$218, DW_AT_name("LDAQBSYNC")
    2907                      .dwattr $C$DW$218, DW_AT_TI_symbol_name("_LDAQBSYNC")
    2908                      .dwattr $C$DW$218, DW_AT_bit_offset(0x04)
    2909                      .dwattr $C$DW$218, DW_AT_bit_size(0x02)
    2910                      .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2911                      .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
    2912              
    2913              $C$DW$219       .dwtag  DW_TAG_member
    2914                      .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$25)
    2915                      .dwattr $C$DW$219, DW_AT_name("rsvd3")
    2916                      .dwattr $C$DW$219, DW_AT_TI_symbol_name("_rsvd3")
    2917                      .dwattr $C$DW$219, DW_AT_bit_offset(0x00)
    2918                      .dwattr $C$DW$219, DW_AT_bit_size(0x04)
TMS320C2000 Assembler PC v15.12.1 Sun May 28 10:39:58 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
endat.asm                                                            PAGE   59

    2919                      .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2920                      .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    2921              
    2922                      .dwendtag $C$DW$T$36
    2923              
    2924              
    2925              $C$DW$T$37      .dwtag  DW_TAG_union_type
    2926                      .dwattr $C$DW$T$37, DW_AT_name("AQCTL_REG")
    2927                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x01)
    2928              $C$DW$220       .dwtag  DW_TAG_member
    2929                      .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$25)
    2930                      .dwattr $C$DW$220, DW_AT_name("all")
    2931                      .dwattr $C$DW$220, DW_AT_TI_symbol_name("_all")
    2932                      .dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2933                      .dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
    2934              
    2935              $C$DW$221       .dwtag  DW_TAG_member
    2936                      .dwattr $C$DW$221, DW_AT_type(*$C$DW$T$36)
    2937                      .dwattr $C$DW$221, DW_AT_name("bit")
    2938                      .dwattr $C$DW$221, DW_AT_TI_symbol_name("_bit")
    2939                      .dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2940                      .dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
    2941              
    2942                      .dwendtag $C$DW$T$37
    2943              
    2944              
    2945              $C$DW$T$38      .dwtag  DW_TAG_structure_type
    2946                      .dwattr $C$DW$T$38, DW_AT_name("AQSFRC_BITS")
    2947                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x01)
    2948              $C$DW$222       .dwtag  DW_TAG_member
    2949                      .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$25)
    2950                      .dwattr $C$DW$222, DW_AT_name("ACTSFA")
    2951                      .dwattr $C$DW$222, DW_AT_TI_symbol_name("_ACTSFA")
    2952                      .dwattr $C$DW$222, DW_AT_bit_offset(0x0e)
    2953                      .dwattr $C$DW$222, DW_AT_bit_size(0x02)
    2954                      .dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2955                      .dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
    2956              
    2957              $C$DW$223       .dwtag  DW_TAG_member
    2958                      .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$25)
    2959                      .dwattr $C$DW$223, DW_AT_name("OTSFA")
    2960                      .dwattr $C$DW$223, DW_AT_TI_symbol_name("_OTSFA")
    2961                      .dwattr $C$DW$223, DW_AT_bit_offset(0x0d)
    2962                      .dwattr $C$DW$223, DW_AT_bit_size(0x01)
    2963                      .dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2964                      .dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
    2965              
    2966              $C$DW$224       .dwtag  DW_TAG_member
    2967                      .dwattr $C$DW$224, DW_AT_type(*$C$DW$T$25)
    2968                      .dwattr $C$DW$224, DW_AT_name("ACTSFB")
    2969                      .dwattr $C$DW$224, DW_AT_TI_symbol_name("_ACTSFB")
    2970                      .dwattr $C$DW$224, DW_AT_bit_offset(0x0b)
    2971                      .dwattr $C$DW$224, DW_AT_bit_size(0x02)
    2972                      .dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2973                      .dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.1 Sun May 28 10:39:58 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
endat.asm                                                            PAGE   60

    2974              
    2975              $C$DW$225       .dwtag  DW_TAG_member
    2976                      .dwattr $C$DW$225, DW_AT_type(*$C$DW$T$25)
    2977                      .dwattr $C$DW$225, DW_AT_name("OTSFB")
    2978                      .dwattr $C$DW$225, DW_AT_TI_symbol_name("_OTSFB")
    2979                      .dwattr $C$DW$225, DW_AT_bit_offset(0x0a)
    2980                      .dwattr $C$DW$225, DW_AT_bit_size(0x01)
    2981                      .dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2982                      .dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
    2983              
    2984              $C$DW$226       .dwtag  DW_TAG_member
    2985                      .dwattr $C$DW$226, DW_AT_type(*$C$DW$T$25)
    2986                      .dwattr $C$DW$226, DW_AT_name("RLDCSF")
    2987                      .dwattr $C$DW$226, DW_AT_TI_symbol_name("_RLDCSF")
    2988                      .dwattr $C$DW$226, DW_AT_bit_offset(0x08)
    2989                      .dwattr $C$DW$226, DW_AT_bit_size(0x02)
    2990                      .dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2991                      .dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)
    2992              
    2993              $C$DW$227       .dwtag  DW_TAG_member
    2994                      .dwattr $C$DW$227, DW_AT_type(*$C$DW$T$25)
    2995                      .dwattr $C$DW$227, DW_AT_name("rsvd1")
    2996                      .dwattr $C$DW$227, DW_AT_TI_symbol_name("_rsvd1")
    2997                      .dwattr $C$DW$227, DW_AT_bit_offset(0x00)
    2998                      .dwattr $C$DW$227, DW_AT_bit_size(0x08)
    2999                      .dwattr $C$DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3000                      .dwattr $C$DW$227, DW_AT_accessibility(DW_ACCESS_public)
    3001              
    3002                      .dwendtag $C$DW$T$38
    3003              
    3004              
    3005              $C$DW$T$39      .dwtag  DW_TAG_union_type
    3006                      .dwattr $C$DW$T$39, DW_AT_name("AQSFRC_REG")
    3007                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x01)
    3008              $C$DW$228       .dwtag  DW_TAG_member
    3009                      .dwattr $C$DW$228, DW_AT_type(*$C$DW$T$25)
    3010                      .dwattr $C$DW$228, DW_AT_name("all")
    3011                      .dwattr $C$DW$228, DW_AT_TI_symbol_name("_all")
    3012                      .dwattr $C$DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3013                      .dwattr $C$DW$228, DW_AT_accessibility(DW_ACCESS_public)
    3014              
    3015              $C$DW$229       .dwtag  DW_TAG_member
    3016                      .dwattr $C$DW$229, DW_AT_type(*$C$DW$T$38)
    3017                      .dwattr $C$DW$229, DW_AT_name("bit")
    3018                      .dwattr $C$DW$229, DW_AT_TI_symbol_name("_bit")
    3019                      .dwattr $C$DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3020                      .dwattr $C$DW$229, DW_AT_accessibility(DW_ACCESS_public)
    3021              
    3022                      .dwendtag $C$DW$T$39
    3023              
    3024              
    3025              $C$DW$T$40      .dwtag  DW_TAG_structure_type
    3026                      .dwattr $C$DW$T$40, DW_AT_name("AQTSRCSEL_BITS")
    3027                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x01)
    3028              $C$DW$230       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v15.12.1 Sun May 28 10:39:58 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
endat.asm                                                            PAGE   61

    3029                      .dwattr $C$DW$230, DW_AT_type(*$C$DW$T$25)
    3030                      .dwattr $C$DW$230, DW_AT_name("T1SEL")
    3031                      .dwattr $C$DW$230, DW_AT_TI_symbol_name("_T1SEL")
    3032                      .dwattr $C$DW$230, DW_AT_bit_offset(0x0c)
    3033                      .dwattr $C$DW$230, DW_AT_bit_size(0x04)
    3034                      .dwattr $C$DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3035                      .dwattr $C$DW$230, DW_AT_accessibility(DW_ACCESS_public)
    3036              
    3037              $C$DW$231       .dwtag  DW_TAG_member
    3038                      .dwattr $C$DW$231, DW_AT_type(*$C$DW$T$25)
    3039                      .dwattr $C$DW$231, DW_AT_name("T2SEL")
    3040                      .dwattr $C$DW$231, DW_AT_TI_symbol_name("_T2SEL")
    3041                      .dwattr $C$DW$231, DW_AT_bit_offset(0x08)
    3042                      .dwattr $C$DW$231, DW_AT_bit_size(0x04)
    3043                      .dwattr $C$DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3044                      .dwattr $C$DW$231, DW_AT_accessibility(DW_ACCESS_public)
    3045              
    3046              $C$DW$232       .dwtag  DW_TAG_member
    3047                      .dwattr $C$DW$232, DW_AT_type(*$C$DW$T$25)
    3048                      .dwattr $C$DW$232, DW_AT_name("rsvd1")
    3049                      .dwattr $C$DW$232, DW_AT_TI_symbol_name("_rsvd1")
    3050                      .dwattr $C$DW$232, DW_AT_bit_offset(0x00)
    3051                      .dwattr $C$DW$232, DW_AT_bit_size(0x08)
    3052                      .dwattr $C$DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3053                      .dwattr $C$DW$232, DW_AT_accessibility(DW_ACCESS_public)
    3054              
    3055                      .dwendtag $C$DW$T$40
    3056              
    3057              
    3058              $C$DW$T$41      .dwtag  DW_TAG_union_type
    3059                      .dwattr $C$DW$T$41, DW_AT_name("AQTSRCSEL_REG")
    3060                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x01)
    3061              $C$DW$233       .dwtag  DW_TAG_member
    3062                      .dwattr $C$DW$233, DW_AT_type(*$C$DW$T$25)
    3063                      .dwattr $C$DW$233, DW_AT_name("all")
    3064                      .dwattr $C$DW$233, DW_AT_TI_symbol_name("_all")
    3065                      .dwattr $C$DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3066                      .dwattr $C$DW$233, DW_AT_accessibility(DW_ACCESS_public)
    3067              
    3068              $C$DW$234       .dwtag  DW_TAG_member
    3069                      .dwattr $C$DW$234, DW_AT_type(*$C$DW$T$40)
    3070                      .dwattr $C$DW$234, DW_AT_name("bit")
    3071                      .dwattr $C$DW$234, DW_AT_TI_symbol_name("_bit")
    3072                      .dwattr $C$DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3073                      .dwattr $C$DW$234, DW_AT_accessibility(DW_ACCESS_public)
    3074              
    3075                      .dwendtag $C$DW$T$41
    3076              
    3077              
    3078              $C$DW$T$42      .dwtag  DW_TAG_structure_type
    3079                      .dwattr $C$DW$T$42, DW_AT_name("CMPA_BITS")
    3080                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x02)
    3081              $C$DW$235       .dwtag  DW_TAG_member
    3082                      .dwattr $C$DW$235, DW_AT_type(*$C$DW$T$25)
    3083                      .dwattr $C$DW$235, DW_AT_name("CMPAHR")
TMS320C2000 Assembler PC v15.12.1 Sun May 28 10:39:58 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
endat.asm                                                            PAGE   62

    3084                      .dwattr $C$DW$235, DW_AT_TI_symbol_name("_CMPAHR")
    3085                      .dwattr $C$DW$235, DW_AT_bit_offset(0x00)
    3086                      .dwattr $C$DW$235, DW_AT_bit_size(0x10)
    3087                      .dwattr $C$DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3088                      .dwattr $C$DW$235, DW_AT_accessibility(DW_ACCESS_public)
    3089              
    3090              $C$DW$236       .dwtag  DW_TAG_member
    3091                      .dwattr $C$DW$236, DW_AT_type(*$C$DW$T$25)
    3092                      .dwattr $C$DW$236, DW_AT_name("CMPA")
    3093                      .dwattr $C$DW$236, DW_AT_TI_symbol_name("_CMPA")
    3094                      .dwattr $C$DW$236, DW_AT_bit_offset(0x00)
    3095                      .dwattr $C$DW$236, DW_AT_bit_size(0x10)
    3096                      .dwattr $C$DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3097                      .dwattr $C$DW$236, DW_AT_accessibility(DW_ACCESS_public)
    3098              
    3099                      .dwendtag $C$DW$T$42
    3100              
    3101              
    3102              $C$DW$T$44      .dwtag  DW_TAG_union_type
    3103                      .dwattr $C$DW$T$44, DW_AT_name("CMPA_REG")
    3104                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x02)
    3105              $C$DW$237       .dwtag  DW_TAG_member
    3106                      .dwattr $C$DW$237, DW_AT_type(*$C$DW$T$43)
    3107                      .dwattr $C$DW$237, DW_AT_name("all")
    3108                      .dwattr $C$DW$237, DW_AT_TI_symbol_name("_all")
    3109                      .dwattr $C$DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3110                      .dwattr $C$DW$237, DW_AT_accessibility(DW_ACCESS_public)
    3111              
    3112              $C$DW$238       .dwtag  DW_TAG_member
    3113                      .dwattr $C$DW$238, DW_AT_type(*$C$DW$T$42)
    3114                      .dwattr $C$DW$238, DW_AT_name("bit")
    3115                      .dwattr $C$DW$238, DW_AT_TI_symbol_name("_bit")
    3116                      .dwattr $C$DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3117                      .dwattr $C$DW$238, DW_AT_accessibility(DW_ACCESS_public)
    3118              
    3119                      .dwendtag $C$DW$T$44
    3120              
    3121              
    3122              $C$DW$T$45      .dwtag  DW_TAG_structure_type
    3123                      .dwattr $C$DW$T$45, DW_AT_name("CMPB_BITS")
    3124                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x02)
    3125              $C$DW$239       .dwtag  DW_TAG_member
    3126                      .dwattr $C$DW$239, DW_AT_type(*$C$DW$T$25)
    3127                      .dwattr $C$DW$239, DW_AT_name("CMPBHR")
    3128                      .dwattr $C$DW$239, DW_AT_TI_symbol_name("_CMPBHR")
    3129                      .dwattr $C$DW$239, DW_AT_bit_offset(0x00)
    3130                      .dwattr $C$DW$239, DW_AT_bit_size(0x10)
    3131                      .dwattr $C$DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3132                      .dwattr $C$DW$239, DW_AT_accessibility(DW_ACCESS_public)
    3133              
    3134              $C$DW$240       .dwtag  DW_TAG_member
    3135                      .dwattr $C$DW$240, DW_AT_type(*$C$DW$T$25)
    3136                      .dwattr $C$DW$240, DW_AT_name("CMPB")
    3137                      .dwattr $C$DW$240, DW_AT_TI_symbol_name("_CMPB")
    3138                      .dwattr $C$DW$240, DW_AT_bit_offset(0x00)
TMS320C2000 Assembler PC v15.12.1 Sun May 28 10:39:58 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
endat.asm                                                            PAGE   63

    3139                      .dwattr $C$DW$240, DW_AT_bit_size(0x10)
    3140                      .dwattr $C$DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3141                      .dwattr $C$DW$240, DW_AT_accessibility(DW_ACCESS_public)
    3142              
    3143                      .dwendtag $C$DW$T$45
    3144              
    3145              
    3146              $C$DW$T$46      .dwtag  DW_TAG_union_type
    3147                      .dwattr $C$DW$T$46, DW_AT_name("CMPB_REG")
    3148                      .dwattr $C$DW$T$46, DW_AT_byte_size(0x02)
    3149              $C$DW$241       .dwtag  DW_TAG_member
    3150                      .dwattr $C$DW$241, DW_AT_type(*$C$DW$T$43)
    3151                      .dwattr $C$DW$241, DW_AT_name("all")
    3152                      .dwattr $C$DW$241, DW_AT_TI_symbol_name("_all")
    3153                      .dwattr $C$DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3154                      .dwattr $C$DW$241, DW_AT_accessibility(DW_ACCESS_public)
    3155              
    3156              $C$DW$242       .dwtag  DW_TAG_member
    3157                      .dwattr $C$DW$242, DW_AT_type(*$C$DW$T$45)
    3158                      .dwattr $C$DW$242, DW_AT_name("bit")
    3159                      .dwattr $C$DW$242, DW_AT_TI_symbol_name("_bit")
    3160                      .dwattr $C$DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3161                      .dwattr $C$DW$242, DW_AT_accessibility(DW_ACCESS_public)
    3162              
    3163                      .dwendtag $C$DW$T$46
    3164              
    3165              
    3166              $C$DW$T$47      .dwtag  DW_TAG_structure_type
    3167                      .dwattr $C$DW$T$47, DW_AT_name("CMPCTL2_BITS")
    3168                      .dwattr $C$DW$T$47, DW_AT_byte_size(0x01)
    3169              $C$DW$243       .dwtag  DW_TAG_member
    3170                      .dwattr $C$DW$243, DW_AT_type(*$C$DW$T$25)
    3171                      .dwattr $C$DW$243, DW_AT_name("LOADCMODE")
    3172                      .dwattr $C$DW$243, DW_AT_TI_symbol_name("_LOADCMODE")
    3173                      .dwattr $C$DW$243, DW_AT_bit_offset(0x0e)
    3174                      .dwattr $C$DW$243, DW_AT_bit_size(0x02)
    3175                      .dwattr $C$DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3176                      .dwattr $C$DW$243, DW_AT_accessibility(DW_ACCESS_public)
    3177              
    3178              $C$DW$244       .dwtag  DW_TAG_member
    3179                      .dwattr $C$DW$244, DW_AT_type(*$C$DW$T$25)
    3180                      .dwattr $C$DW$244, DW_AT_name("LOADDMODE")
    3181                      .dwattr $C$DW$244, DW_AT_TI_symbol_name("_LOADDMODE")
    3182                      .dwattr $C$DW$244, DW_AT_bit_offset(0x0c)
    3183                      .dwattr $C$DW$244, DW_AT_bit_size(0x02)
    3184                      .dwattr $C$DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3185                      .dwattr $C$DW$244, DW_AT_accessibility(DW_ACCESS_public)
    3186              
    3187              $C$DW$245       .dwtag  DW_TAG_member
    3188                      .dwattr $C$DW$245, DW_AT_type(*$C$DW$T$25)
    3189                      .dwattr $C$DW$245, DW_AT_name("SHDWCMODE")
    3190                      .dwattr $C$DW$245, DW_AT_TI_symbol_name("_SHDWCMODE")
    3191                      .dwattr $C$DW$245, DW_AT_bit_offset(0x0b)
    3192                      .dwattr $C$DW$245, DW_AT_bit_size(0x01)
    3193                      .dwattr $C$DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v15.12.1 Sun May 28 10:39:58 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
endat.asm                                                            PAGE   64

    3194                      .dwattr $C$DW$245, DW_AT_accessibility(DW_ACCESS_public)
    3195              
    3196              $C$DW$246       .dwtag  DW_TAG_member
    3197                      .dwattr $C$DW$246, DW_AT_type(*$C$DW$T$25)
    3198                      .dwattr $C$DW$246, DW_AT_name("rsvd1")
    3199                      .dwattr $C$DW$246, DW_AT_TI_symbol_name("_rsvd1")
    3200                      .dwattr $C$DW$246, DW_AT_bit_offset(0x0a)
    3201                      .dwattr $C$DW$246, DW_AT_bit_size(0x01)
    3202                      .dwattr $C$DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3203                      .dwattr $C$DW$246, DW_AT_accessibility(DW_ACCESS_public)
    3204              
    3205              $C$DW$247       .dwtag  DW_TAG_member
    3206                      .dwattr $C$DW$247, DW_AT_type(*$C$DW$T$25)
    3207                      .dwattr $C$DW$247, DW_AT_name("SHDWDMODE")
    3208                      .dwattr $C$DW$247, DW_AT_TI_symbol_name("_SHDWDMODE")
    3209                      .dwattr $C$DW$247, DW_AT_bit_offset(0x09)
    3210                      .dwattr $C$DW$247, DW_AT_bit_size(0x01)
    3211                      .dwattr $C$DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3212                      .dwattr $C$DW$247, DW_AT_accessibility(DW_ACCESS_public)
    3213              
    3214              $C$DW$248       .dwtag  DW_TAG_member
    3215                      .dwattr $C$DW$248, DW_AT_type(*$C$DW$T$25)
    3216                      .dwattr $C$DW$248, DW_AT_name("rsvd2")
    3217                      .dwattr $C$DW$248, DW_AT_TI_symbol_name("_rsvd2")
    3218                      .dwattr $C$DW$248, DW_AT_bit_offset(0x06)
    3219                      .dwattr $C$DW$248, DW_AT_bit_size(0x03)
    3220                      .dwattr $C$DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3221                      .dwattr $C$DW$248, DW_AT_accessibility(DW_ACCESS_public)
    3222              
    3223              $C$DW$249       .dwtag  DW_TAG_member
    3224                      .dwattr $C$DW$249, DW_AT_type(*$C$DW$T$25)
    3225                      .dwattr $C$DW$249, DW_AT_name("LOADCSYNC")
    3226                      .dwattr $C$DW$249, DW_AT_TI_symbol_name("_LOADCSYNC")
    3227                      .dwattr $C$DW$249, DW_AT_bit_offset(0x04)
    3228                      .dwattr $C$DW$249, DW_AT_bit_size(0x02)
    3229                      .dwattr $C$DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3230                      .dwattr $C$DW$249, DW_AT_accessibility(DW_ACCESS_public)
    3231              
    3232              $C$DW$250       .dwtag  DW_TAG_member
    3233                      .dwattr $C$DW$250, DW_AT_type(*$C$DW$T$25)
    3234                      .dwattr $C$DW$250, DW_AT_name("LOADDSYNC")
    3235                      .dwattr $C$DW$250, DW_AT_TI_symbol_name("_LOADDSYNC")
    3236                      .dwattr $C$DW$250, DW_AT_bit_offset(0x02)
    3237                      .dwattr $C$DW$250, DW_AT_bit_size(0x02)
    3238                      .dwattr $C$DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3239                      .dwattr $C$DW$250, DW_AT_accessibility(DW_ACCESS_public)
    3240              
    3241              $C$DW$251       .dwtag  DW_TAG_member
    3242                      .dwattr $C$DW$251, DW_AT_type(*$C$DW$T$25)
    3243                      .dwattr $C$DW$251, DW_AT_name("rsvd3")
    3244                      .dwattr $C$DW$251, DW_AT_TI_symbol_name("_rsvd3")
    3245                      .dwattr $C$DW$251, DW_AT_bit_offset(0x00)
    3246                      .dwattr $C$DW$251, DW_AT_bit_size(0x02)
    3247                      .dwattr $C$DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3248                      .dwattr $C$DW$251, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.1 Sun May 28 10:39:58 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
endat.asm                                                            PAGE   65

    3249              
    3250                      .dwendtag $C$DW$T$47
    3251              
    3252              
    3253              $C$DW$T$48      .dwtag  DW_TAG_union_type
    3254                      .dwattr $C$DW$T$48, DW_AT_name("CMPCTL2_REG")
    3255                      .dwattr $C$DW$T$48, DW_AT_byte_size(0x01)
    3256              $C$DW$252       .dwtag  DW_TAG_member
    3257                      .dwattr $C$DW$252, DW_AT_type(*$C$DW$T$25)
    3258                      .dwattr $C$DW$252, DW_AT_name("all")
    3259                      .dwattr $C$DW$252, DW_AT_TI_symbol_name("_all")
    3260                      .dwattr $C$DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3261                      .dwattr $C$DW$252, DW_AT_accessibility(DW_ACCESS_public)
    3262              
    3263              $C$DW$253       .dwtag  DW_TAG_member
    3264                      .dwattr $C$DW$253, DW_AT_type(*$C$DW$T$47)
    3265                      .dwattr $C$DW$253, DW_AT_name("bit")
    3266                      .dwattr $C$DW$253, DW_AT_TI_symbol_name("_bit")
    3267                      .dwattr $C$DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3268                      .dwattr $C$DW$253, DW_AT_accessibility(DW_ACCESS_public)
    3269              
    3270                      .dwendtag $C$DW$T$48
    3271              
    3272              
    3273              $C$DW$T$49      .dwtag  DW_TAG_structure_type
    3274                      .dwattr $C$DW$T$49, DW_AT_name("CMPCTL_BITS")
    3275                      .dwattr $C$DW$T$49, DW_AT_byte_size(0x01)
    3276              $C$DW$254       .dwtag  DW_TAG_member
    3277                      .dwattr $C$DW$254, DW_AT_type(*$C$DW$T$25)
    3278                      .dwattr $C$DW$254, DW_AT_name("LOADAMODE")
    3279                      .dwattr $C$DW$254, DW_AT_TI_symbol_name("_LOADAMODE")
    3280                      .dwattr $C$DW$254, DW_AT_bit_offset(0x0e)
    3281                      .dwattr $C$DW$254, DW_AT_bit_size(0x02)
    3282                      .dwattr $C$DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3283                      .dwattr $C$DW$254, DW_AT_accessibility(DW_ACCESS_public)
    3284              
    3285              $C$DW$255       .dwtag  DW_TAG_member
    3286                      .dwattr $C$DW$255, DW_AT_type(*$C$DW$T$25)
    3287                      .dwattr $C$DW$255, DW_AT_name("LOADBMODE")
    3288                      .dwattr $C$DW$255, DW_AT_TI_symbol_name("_LOADBMODE")
    3289                      .dwattr $C$DW$255, DW_AT_bit_offset(0x0c)
    3290                      .dwattr $C$DW$255, DW_AT_bit_size(0x02)
    3291                      .dwattr $C$DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3292                      .dwattr $C$DW$255, DW_AT_accessibility(DW_ACCESS_public)
    3293              
    3294              $C$DW$256       .dwtag  DW_TAG_member
    3295                      .dwattr $C$DW$256, DW_AT_type(*$C$DW$T$25)
    3296                      .dwattr $C$DW$256, DW_AT_name("SHDWAMODE")
    3297                      .dwattr $C$DW$256, DW_AT_TI_symbol_name("_SHDWAMODE")
    3298                      .dwattr $C$DW$256, DW_AT_bit_offset(0x0b)
    3299                      .dwattr $C$DW$256, DW_AT_bit_size(0x01)
    3300                      .dwattr $C$DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3301                      .dwattr $C$DW$256, DW_AT_accessibility(DW_ACCESS_public)
    3302              
    3303              $C$DW$257       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v15.12.1 Sun May 28 10:39:58 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
endat.asm                                                            PAGE   66

    3304                      .dwattr $C$DW$257, DW_AT_type(*$C$DW$T$25)
    3305                      .dwattr $C$DW$257, DW_AT_name("rsvd1")
    3306                      .dwattr $C$DW$257, DW_AT_TI_symbol_name("_rsvd1")
    3307                      .dwattr $C$DW$257, DW_AT_bit_offset(0x0a)
    3308                      .dwattr $C$DW$257, DW_AT_bit_size(0x01)
    3309                      .dwattr $C$DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3310                      .dwattr $C$DW$257, DW_AT_accessibility(DW_ACCESS_public)
    3311              
    3312              $C$DW$258       .dwtag  DW_TAG_member
    3313                      .dwattr $C$DW$258, DW_AT_type(*$C$DW$T$25)
    3314                      .dwattr $C$DW$258, DW_AT_name("SHDWBMODE")
    3315                      .dwattr $C$DW$258, DW_AT_TI_symbol_name("_SHDWBMODE")
    3316                      .dwattr $C$DW$258, DW_AT_bit_offset(0x09)
    3317                      .dwattr $C$DW$258, DW_AT_bit_size(0x01)
    3318                      .dwattr $C$DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3319                      .dwattr $C$DW$258, DW_AT_accessibility(DW_ACCESS_public)
    3320              
    3321              $C$DW$259       .dwtag  DW_TAG_member
    3322                      .dwattr $C$DW$259, DW_AT_type(*$C$DW$T$25)
    3323                      .dwattr $C$DW$259, DW_AT_name("rsvd2")
    3324                      .dwattr $C$DW$259, DW_AT_TI_symbol_name("_rsvd2")
    3325                      .dwattr $C$DW$259, DW_AT_bit_offset(0x08)
    3326                      .dwattr $C$DW$259, DW_AT_bit_size(0x01)
    3327                      .dwattr $C$DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3328                      .dwattr $C$DW$259, DW_AT_accessibility(DW_ACCESS_public)
    3329              
    3330              $C$DW$260       .dwtag  DW_TAG_member
    3331                      .dwattr $C$DW$260, DW_AT_type(*$C$DW$T$25)
    3332                      .dwattr $C$DW$260, DW_AT_name("SHDWAFULL")
    3333                      .dwattr $C$DW$260, DW_AT_TI_symbol_name("_SHDWAFULL")
    3334                      .dwattr $C$DW$260, DW_AT_bit_offset(0x07)
    3335                      .dwattr $C$DW$260, DW_AT_bit_size(0x01)
    3336                      .dwattr $C$DW$260, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3337                      .dwattr $C$DW$260, DW_AT_accessibility(DW_ACCESS_public)
    3338              
    3339              $C$DW$261       .dwtag  DW_TAG_member
    3340                      .dwattr $C$DW$261, DW_AT_type(*$C$DW$T$25)
    3341                      .dwattr $C$DW$261, DW_AT_name("SHDWBFULL")
    3342                      .dwattr $C$DW$261, DW_AT_TI_symbol_name("_SHDWBFULL")
    3343                      .dwattr $C$DW$261, DW_AT_bit_offset(0x06)
    3344                      .dwattr $C$DW$261, DW_AT_bit_size(0x01)
    3345                      .dwattr $C$DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3346                      .dwattr $C$DW$261, DW_AT_accessibility(DW_ACCESS_public)
    3347              
    3348              $C$DW$262       .dwtag  DW_TAG_member
    3349                      .dwattr $C$DW$262, DW_AT_type(*$C$DW$T$25)
    3350                      .dwattr $C$DW$262, DW_AT_name("LOADASYNC")
    3351                      .dwattr $C$DW$262, DW_AT_TI_symbol_name("_LOADASYNC")
    3352                      .dwattr $C$DW$262, DW_AT_bit_offset(0x04)
    3353                      .dwattr $C$DW$262, DW_AT_bit_size(0x02)
    3354                      .dwattr $C$DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3355                      .dwattr $C$DW$262, DW_AT_accessibility(DW_ACCESS_public)
    3356              
    3357              $C$DW$263       .dwtag  DW_TAG_member
    3358                      .dwattr $C$DW$263, DW_AT_type(*$C$DW$T$25)
TMS320C2000 Assembler PC v15.12.1 Sun May 28 10:39:58 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
endat.asm                                                            PAGE   67

    3359                      .dwattr $C$DW$263, DW_AT_name("LOADBSYNC")
    3360                      .dwattr $C$DW$263, DW_AT_TI_symbol_name("_LOADBSYNC")
    3361                      .dwattr $C$DW$263, DW_AT_bit_offset(0x02)
    3362                      .dwattr $C$DW$263, DW_AT_bit_size(0x02)
    3363                      .dwattr $C$DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3364                      .dwattr $C$DW$263, DW_AT_accessibility(DW_ACCESS_public)
    3365              
    3366              $C$DW$264       .dwtag  DW_TAG_member
    3367                      .dwattr $C$DW$264, DW_AT_type(*$C$DW$T$25)
    3368                      .dwattr $C$DW$264, DW_AT_name("rsvd3")
    3369                      .dwattr $C$DW$264, DW_AT_TI_symbol_name("_rsvd3")
    3370                      .dwattr $C$DW$264, DW_AT_bit_offset(0x00)
    3371                      .dwattr $C$DW$264, DW_AT_bit_size(0x02)
    3372                      .dwattr $C$DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3373                      .dwattr $C$DW$264, DW_AT_accessibility(DW_ACCESS_public)
    3374              
    3375                      .dwendtag $C$DW$T$49
    3376              
    3377              
    3378              $C$DW$T$50      .dwtag  DW_TAG_union_type
    3379                      .dwattr $C$DW$T$50, DW_AT_name("CMPCTL_REG")
    3380                      .dwattr $C$DW$T$50, DW_AT_byte_size(0x01)
    3381              $C$DW$265       .dwtag  DW_TAG_member
    3382                      .dwattr $C$DW$265, DW_AT_type(*$C$DW$T$25)
    3383                      .dwattr $C$DW$265, DW_AT_name("all")
    3384                      .dwattr $C$DW$265, DW_AT_TI_symbol_name("_all")
    3385                      .dwattr $C$DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3386                      .dwattr $C$DW$265, DW_AT_accessibility(DW_ACCESS_public)
    3387              
    3388              $C$DW$266       .dwtag  DW_TAG_member
    3389                      .dwattr $C$DW$266, DW_AT_type(*$C$DW$T$49)
    3390                      .dwattr $C$DW$266, DW_AT_name("bit")
    3391                      .dwattr $C$DW$266, DW_AT_TI_symbol_name("_bit")
    3392                      .dwattr $C$DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3393                      .dwattr $C$DW$266, DW_AT_accessibility(DW_ACCESS_public)
    3394              
    3395                      .dwendtag $C$DW$T$50
    3396              
    3397              
    3398              $C$DW$T$51      .dwtag  DW_TAG_structure_type
    3399                      .dwattr $C$DW$T$51, DW_AT_name("CPUSYSLOCK1_BITS")
    3400                      .dwattr $C$DW$T$51, DW_AT_byte_size(0x02)
    3401              $C$DW$267       .dwtag  DW_TAG_member
    3402                      .dwattr $C$DW$267, DW_AT_type(*$C$DW$T$25)
    3403                      .dwattr $C$DW$267, DW_AT_name("HIBBOOTMODE")
    3404                      .dwattr $C$DW$267, DW_AT_TI_symbol_name("_HIBBOOTMODE")
    3405                      .dwattr $C$DW$267, DW_AT_bit_offset(0x0f)
    3406                      .dwattr $C$DW$267, DW_AT_bit_size(0x01)
    3407                      .dwattr $C$DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3408                      .dwattr $C$DW$267, DW_AT_accessibility(DW_ACCESS_public)
    3409              
    3410              $C$DW$268       .dwtag  DW_TAG_member
    3411                      .dwattr $C$DW$268, DW_AT_type(*$C$DW$T$25)
    3412                      .dwattr $C$DW$268, DW_AT_name("IORESTOREADDR")
    3413                      .dwattr $C$DW$268, DW_AT_TI_symbol_name("_IORESTOREADDR")
TMS320C2000 Assembler PC v15.12.1 Sun May 28 10:39:58 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
endat.asm                                                            PAGE   68

    3414                      .dwattr $C$DW$268, DW_AT_bit_offset(0x0e)
    3415                      .dwattr $C$DW$268, DW_AT_bit_size(0x01)
    3416                      .dwattr $C$DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3417                      .dwattr $C$DW$268, DW_AT_accessibility(DW_ACCESS_public)
    3418              
    3419              $C$DW$269       .dwtag  DW_TAG_member
    3420                      .dwattr $C$DW$269, DW_AT_type(*$C$DW$T$25)
    3421                      .dwattr $C$DW$269, DW_AT_name("PIEVERRADDR")
    3422                      .dwattr $C$DW$269, DW_AT_TI_symbol_name("_PIEVERRADDR")
    3423                      .dwattr $C$DW$269, DW_AT_bit_offset(0x0d)
    3424                      .dwattr $C$DW$269, DW_AT_bit_size(0x01)
    3425                      .dwattr $C$DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3426                      .dwattr $C$DW$269, DW_AT_accessibility(DW_ACCESS_public)
    3427              
    3428              $C$DW$270       .dwtag  DW_TAG_member
    3429                      .dwattr $C$DW$270, DW_AT_type(*$C$DW$T$25)
    3430                      .dwattr $C$DW$270, DW_AT_name("PCLKCR0")
    3431                      .dwattr $C$DW$270, DW_AT_TI_symbol_name("_PCLKCR0")
    3432                      .dwattr $C$DW$270, DW_AT_bit_offset(0x0c)
    3433                      .dwattr $C$DW$270, DW_AT_bit_size(0x01)
    3434                      .dwattr $C$DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3435                      .dwattr $C$DW$270, DW_AT_accessibility(DW_ACCESS_public)
    3436              
    3437              $C$DW$271       .dwtag  DW_TAG_member
    3438                      .dwattr $C$DW$271, DW_AT_type(*$C$DW$T$25)
    3439                      .dwattr $C$DW$271, DW_AT_name("PCLKCR1")
    3440                      .dwattr $C$DW$271, DW_AT_TI_symbol_name("_PCLKCR1")
    3441                      .dwattr $C$DW$271, DW_AT_bit_offset(0x0b)
    3442                      .dwattr $C$DW$271, DW_AT_bit_size(0x01)
    3443                      .dwattr $C$DW$271, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3444                      .dwattr $C$DW$271, DW_AT_accessibility(DW_ACCESS_public)
    3445              
    3446              $C$DW$272       .dwtag  DW_TAG_member
    3447                      .dwattr $C$DW$272, DW_AT_type(*$C$DW$T$25)
    3448                      .dwattr $C$DW$272, DW_AT_name("PCLKCR2")
    3449                      .dwattr $C$DW$272, DW_AT_TI_symbol_name("_PCLKCR2")
    3450                      .dwattr $C$DW$272, DW_AT_bit_offset(0x0a)
    3451                      .dwattr $C$DW$272, DW_AT_bit_size(0x01)
    3452                      .dwattr $C$DW$272, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3453                      .dwattr $C$DW$272, DW_AT_accessibility(DW_ACCESS_public)
    3454              
    3455              $C$DW$273       .dwtag  DW_TAG_member
    3456                      .dwattr $C$DW$273, DW_AT_type(*$C$DW$T$25)
    3457                      .dwattr $C$DW$273, DW_AT_name("PCLKCR3")
    3458                      .dwattr $C$DW$273, DW_AT_TI_symbol_name("_PCLKCR3")
    3459                      .dwattr $C$DW$273, DW_AT_bit_offset(0x09)
    3460                      .dwattr $C$DW$273, DW_AT_bit_size(0x01)
    3461                      .dwattr $C$DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3462                      .dwattr $C$DW$273, DW_AT_accessibility(DW_ACCESS_public)
    3463              
    3464              $C$DW$274       .dwtag  DW_TAG_member
    3465                      .dwattr $C$DW$274, DW_AT_type(*$C$DW$T$25)
    3466                      .dwattr $C$DW$274, DW_AT_name("PCLKCR4")
    3467                      .dwattr $C$DW$274, DW_AT_TI_symbol_name("_PCLKCR4")
    3468                      .dwattr $C$DW$274, DW_AT_bit_offset(0x08)
TMS320C2000 Assembler PC v15.12.1 Sun May 28 10:39:58 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
endat.asm                                                            PAGE   69

    3469                      .dwattr $C$DW$274, DW_AT_bit_size(0x01)
    3470                      .dwattr $C$DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3471                      .dwattr $C$DW$274, DW_AT_accessibility(DW_ACCESS_public)
    3472              
    3473              $C$DW$275       .dwtag  DW_TAG_member
    3474                      .dwattr $C$DW$275, DW_AT_type(*$C$DW$T$25)
    3475                      .dwattr $C$DW$275, DW_AT_name("PCLKCR5")
    3476                      .dwattr $C$DW$275, DW_AT_TI_symbol_name("_PCLKCR5")
    3477                      .dwattr $C$DW$275, DW_AT_bit_offset(0x07)
    3478                      .dwattr $C$DW$275, DW_AT_bit_size(0x01)
    3479                      .dwattr $C$DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3480                      .dwattr $C$DW$275, DW_AT_accessibility(DW_ACCESS_public)
    3481              
    3482              $C$DW$276       .dwtag  DW_TAG_member
    3483                      .dwattr $C$DW$276, DW_AT_type(*$C$DW$T$25)
    3484                      .dwattr $C$DW$276, DW_AT_name("PCLKCR6")
    3485                      .dwattr $C$DW$276, DW_AT_TI_symbol_name("_PCLKCR6")
    3486                      .dwattr $C$DW$276, DW_AT_bit_offset(0x06)
    3487                      .dwattr $C$DW$276, DW_AT_bit_size(0x01)
    3488                      .dwattr $C$DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3489                      .dwattr $C$DW$276, DW_AT_accessibility(DW_ACCESS_public)
    3490              
    3491              $C$DW$277       .dwtag  DW_TAG_member
    3492                      .dwattr $C$DW$277, DW_AT_type(*$C$DW$T$25)
    3493                      .dwattr $C$DW$277, DW_AT_name("PCLKCR7")
    3494                      .dwattr $C$DW$277, DW_AT_TI_symbol_name("_PCLKCR7")
    3495                      .dwattr $C$DW$277, DW_AT_bit_offset(0x05)
    3496                      .dwattr $C$DW$277, DW_AT_bit_size(0x01)
    3497                      .dwattr $C$DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3498                      .dwattr $C$DW$277, DW_AT_accessibility(DW_ACCESS_public)
    3499              
    3500              $C$DW$278       .dwtag  DW_TAG_member
    3501                      .dwattr $C$DW$278, DW_AT_type(*$C$DW$T$25)
    3502                      .dwattr $C$DW$278, DW_AT_name("PCLKCR8")
    3503                      .dwattr $C$DW$278, DW_AT_TI_symbol_name("_PCLKCR8")
    3504                      .dwattr $C$DW$278, DW_AT_bit_offset(0x04)
    3505                      .dwattr $C$DW$278, DW_AT_bit_size(0x01)
    3506                      .dwattr $C$DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3507                      .dwattr $C$DW$278, DW_AT_accessibility(DW_ACCESS_public)
    3508              
    3509              $C$DW$279       .dwtag  DW_TAG_member
    3510                      .dwattr $C$DW$279, DW_AT_type(*$C$DW$T$25)
    3511                      .dwattr $C$DW$279, DW_AT_name("PCLKCR9")
    3512                      .dwattr $C$DW$279, DW_AT_TI_symbol_name("_PCLKCR9")
    3513                      .dwattr $C$DW$279, DW_AT_bit_offset(0x03)
    3514                      .dwattr $C$DW$279, DW_AT_bit_size(0x01)
    3515                      .dwattr $C$DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3516                      .dwattr $C$DW$279, DW_AT_accessibility(DW_ACCESS_public)
    3517              
    3518              $C$DW$280       .dwtag  DW_TAG_member
    3519                      .dwattr $C$DW$280, DW_AT_type(*$C$DW$T$25)
    3520                      .dwattr $C$DW$280, DW_AT_name("PCLKCR10")
    3521                      .dwattr $C$DW$280, DW_AT_TI_symbol_name("_PCLKCR10")
    3522                      .dwattr $C$DW$280, DW_AT_bit_offset(0x02)
    3523                      .dwattr $C$DW$280, DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v15.12.1 Sun May 28 10:39:58 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
endat.asm                                                            PAGE   70

    3524                      .dwattr $C$DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3525                      .dwattr $C$DW$280, DW_AT_accessibility(DW_ACCESS_public)
    3526              
    3527              $C$DW$281       .dwtag  DW_TAG_member
    3528                      .dwattr $C$DW$281, DW_AT_type(*$C$DW$T$25)
    3529                      .dwattr $C$DW$281, DW_AT_name("PCLKCR11")
    3530                      .dwattr $C$DW$281, DW_AT_TI_symbol_name("_PCLKCR11")
    3531                      .dwattr $C$DW$281, DW_AT_bit_offset(0x01)
    3532                      .dwattr $C$DW$281, DW_AT_bit_size(0x01)
    3533                      .dwattr $C$DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3534                      .dwattr $C$DW$281, DW_AT_accessibility(DW_ACCESS_public)
    3535              
    3536              $C$DW$282       .dwtag  DW_TAG_member
    3537                      .dwattr $C$DW$282, DW_AT_type(*$C$DW$T$25)
    3538                      .dwattr $C$DW$282, DW_AT_name("PCLKCR12")
    3539                      .dwattr $C$DW$282, DW_AT_TI_symbol_name("_PCLKCR12")
    3540                      .dwattr $C$DW$282, DW_AT_bit_offset(0x00)
    3541                      .dwattr $C$DW$282, DW_AT_bit_size(0x01)
    3542                      .dwattr $C$DW$282, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3543                      .dwattr $C$DW$282, DW_AT_accessibility(DW_ACCESS_public)
    3544              
    3545              $C$DW$283       .dwtag  DW_TAG_member
    3546                      .dwattr $C$DW$283, DW_AT_type(*$C$DW$T$25)
    3547                      .dwattr $C$DW$283, DW_AT_name("PCLKCR13")
    3548                      .dwattr $C$DW$283, DW_AT_TI_symbol_name("_PCLKCR13")
    3549                      .dwattr $C$DW$283, DW_AT_bit_offset(0x0f)
    3550                      .dwattr $C$DW$283, DW_AT_bit_size(0x01)
    3551                      .dwattr $C$DW$283, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3552                      .dwattr $C$DW$283, DW_AT_accessibility(DW_ACCESS_public)
    3553              
    3554              $C$DW$284       .dwtag  DW_TAG_member
    3555                      .dwattr $C$DW$284, DW_AT_type(*$C$DW$T$25)
    3556                      .dwattr $C$DW$284, DW_AT_name("PCLKCR14")
    3557                      .dwattr $C$DW$284, DW_AT_TI_symbol_name("_PCLKCR14")
    3558                      .dwattr $C$DW$284, DW_AT_bit_offset(0x0e)
    3559                      .dwattr $C$DW$284, DW_AT_bit_size(0x01)
    3560                      .dwattr $C$DW$284, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3561                      .dwattr $C$DW$284, DW_AT_accessibility(DW_ACCESS_public)
    3562              
    3563              $C$DW$285       .dwtag  DW_TAG_member
    3564                      .dwattr $C$DW$285, DW_AT_type(*$C$DW$T$25)
    3565                      .dwattr $C$DW$285, DW_AT_name("PCLKCR15")
    3566                      .dwattr $C$DW$285, DW_AT_TI_symbol_name("_PCLKCR15")
    3567                      .dwattr $C$DW$285, DW_AT_bit_offset(0x0d)
    3568                      .dwattr $C$DW$285, DW_AT_bit_size(0x01)
    3569                      .dwattr $C$DW$285, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3570                      .dwattr $C$DW$285, DW_AT_accessibility(DW_ACCESS_public)
    3571              
    3572              $C$DW$286       .dwtag  DW_TAG_member
    3573                      .dwattr $C$DW$286, DW_AT_type(*$C$DW$T$25)
    3574                      .dwattr $C$DW$286, DW_AT_name("PCLKCR16")
    3575                      .dwattr $C$DW$286, DW_AT_TI_symbol_name("_PCLKCR16")
    3576                      .dwattr $C$DW$286, DW_AT_bit_offset(0x0c)
    3577                      .dwattr $C$DW$286, DW_AT_bit_size(0x01)
    3578                      .dwattr $C$DW$286, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
TMS320C2000 Assembler PC v15.12.1 Sun May 28 10:39:58 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
endat.asm                                                            PAGE   71

    3579                      .dwattr $C$DW$286, DW_AT_accessibility(DW_ACCESS_public)
    3580              
    3581              $C$DW$287       .dwtag  DW_TAG_member
    3582                      .dwattr $C$DW$287, DW_AT_type(*$C$DW$T$25)
    3583                      .dwattr $C$DW$287, DW_AT_name("SECMSEL")
    3584                      .dwattr $C$DW$287, DW_AT_TI_symbol_name("_SECMSEL")
    3585                      .dwattr $C$DW$287, DW_AT_bit_offset(0x0b)
    3586                      .dwattr $C$DW$287, DW_AT_bit_size(0x01)
