TMS320C2000 Assembler PC v15.12.1 Sun May 28 10:39:54 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_sdfm_drivers.asm                                             PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                   PC v15.12.1.LTS *
       3              ;* Date/Time created: Sun May 28 10:39:53 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --cla_support=cla0 --float_support=fpu32 --hll_source=on --mem_model:cod
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/controlSUITE/device_support/F2837xD/v170/F2837xD_common/source/F2
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v15.12.1.LTS Copyright (c) 1996-201
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Keith\Documents\GitHub\ElectricSkateboard\Software\IDDK_PM
      13              $C$DW$1 .dwtag  DW_TAG_variable
      14                      .dwattr $C$DW$1, DW_AT_name("SDFM")
      15                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_SDFM")

    1810                      .dwattr $C$DW$76, DW_AT_high_pc(0x00)
    1811                      .dwattr $C$DW$76, DW_AT_TI_symbol_name("_Sdfm_clearFlagRegister")
    1812                      .dwattr $C$DW$76, DW_AT_external
    1813                      .dwattr $C$DW$76, DW_AT_TI_begin_file("C:/ti/controlSUITE/device_support/F2837xD/v170/F2837xD_common/
    1814                      .dwattr $C$DW$76, DW_AT_TI_begin_line(0x192)
    1815                      .dwattr $C$DW$76, DW_AT_TI_begin_column(0x06)
    1816                      .dwattr $C$DW$76, DW_AT_TI_max_frame_size(-2)
    1817                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xD/v170/F2837xD_common/source/F2837xD_sdfm_drive
    1818              
    1819                      .dwfde $C$DW$CIE, _Sdfm_clearFlagRegister
    1820              $C$DW$77        .dwtag  DW_TAG_formal_parameter
    1821                      .dwattr $C$DW$77, DW_AT_name("sdfmNumber")
    1822                      .dwattr $C$DW$77, DW_AT_TI_symbol_name("_sdfmNumber")
    1823                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$19)
    1824                      .dwattr $C$DW$77, DW_AT_location[DW_OP_reg12]
    1825              
    1826              $C$DW$78        .dwtag  DW_TAG_formal_parameter
    1827                      .dwattr $C$DW$78, DW_AT_name("sdfmReadFlagRegister")
    1828                      .dwattr $C$DW$78, DW_AT_TI_symbol_name("_sdfmReadFlagRegister")
    1829                      .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$55)
    1830                      .dwattr $C$DW$78, DW_AT_location[DW_OP_reg0]
    1831              
    1832              
    1833              ;***************************************************************
    1834              ;* FNAME: _Sdfm_clearFlagRegister       FR SIZE:   0           *
    1835              ;*                                                             *
    1836              ;* FUNCTION ENVIRONMENT                                        *
    1837              ;*                                                             *
    1838              ;* FUNCTION PROPERTIES                                         *
    1839              ;*                            0 Parameter,  0 Auto,  0 SOE     *
    1840              ;***************************************************************
    1841              
    1842              _Sdfm_clearFlagRegister:
TMS320C2000 Assembler PC v15.12.1 Sun May 28 10:39:54 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_sdfm_drivers.asm                                             PAGE   39

    1843              ;* AR6   assigned to _sdfmReadFlagRegister
    1844              $C$DW$79        .dwtag  DW_TAG_variable
    1845                      .dwattr $C$DW$79, DW_AT_name("sdfmReadFlagRegister")
    1846                      .dwattr $C$DW$79, DW_AT_TI_symbol_name("_sdfmReadFlagRegister")
    1847                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$105)
    1848                      .dwattr $C$DW$79, DW_AT_location[DW_OP_reg16]
    1849              
    1850                      .dwcfi  cfa_offset, -2
    1851                      .dwcfi  save_reg_to_mem, 26, 0
    1852 000003df 1EA6          MOVL      XAR6,ACC              ; [CPU_] |403| 
    1853 000003e0 2901          CLRC      SXM                   ; [CPU_] 
    1854                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xD/v170/F2837xD_common/source/F2837xD_sdfm_drive
    1855 000003e1 5603          MOV       ACC,AR4 << 1          ; [CPU_] |404| 
         000003e2 01A4 
    1856 000003e3 8F00!         MOVL      XAR4,#_SDFM           ; [CPU_U] |404| 
         000003e4 0000 
    1857 000003e5 5601          ADDL      XAR4,ACC              ; [CPU_] |404| 
         000003e6 00A4 
    1858 000003e7 8AC4          MOVL      XAR4,*+XAR4[0]        ; [CPU_] |404| 
    1859 000003e8 C2D4          MOVL      *+XAR4[2],XAR6        ; [CPU_] |404| 
    1860              $C$DW$80        .dwtag  DW_TAG_TI_branch
    1861                      .dwattr $C$DW$80, DW_AT_low_pc(0x00)
    1862                      .dwattr $C$DW$80, DW_AT_TI_return
    1863              
    1864 000003e9 0006          LRETR     ; [CPU_] 
    1865                      ; return occurs ; [] 
    1866                      .dwattr $C$DW$76, DW_AT_TI_end_file("C:/ti/controlSUITE/device_support/F2837xD/v170/F2837xD_common/so
    1867                      .dwattr $C$DW$76, DW_AT_TI_end_line(0x195)
    1868                      .dwattr $C$DW$76, DW_AT_TI_end_column(0x01)
    1869                      .dwendentry
    1870                      .dwendtag $C$DW$76
    1871              
    1872              ;**************************************************************
    1873              ;* UNDEFINED EXTERNAL REFERENCES                              *
    1874              ;**************************************************************
    1875                      .global _SDFM
    1876              
    1877              ;***************************************************************
    1878              ;* TYPE INFORMATION                                            *
    1879              ;***************************************************************
    1880              
    1881              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    1882                      .dwattr $C$DW$T$20, DW_AT_name("SDCMPH1_BITS")
    1883                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x01)
    1884              $C$DW$81        .dwtag  DW_TAG_member
    1885                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$19)
    1886                      .dwattr $C$DW$81, DW_AT_name("HLT")
    1887                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_HLT")
    1888                      .dwattr $C$DW$81, DW_AT_bit_offset(0x01)
    1889                      .dwattr $C$DW$81, DW_AT_bit_size(0x0f)
    1890                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1891                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1892              
    1893              $C$DW$82        .dwtag  DW_TAG_member
    1894                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v15.12.1 Sun May 28 10:39:54 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_sdfm_drivers.asm                                             PAGE   40

    1895                      .dwattr $C$DW$82, DW_AT_name("rsvd1")
    1896                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_rsvd1")
    1897                      .dwattr $C$DW$82, DW_AT_bit_offset(0x00)
    1898                      .dwattr $C$DW$82, DW_AT_bit_size(0x01)
    1899                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1900                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1901              
    1902                      .dwendtag $C$DW$T$20
    1903              
    1904              
    1905              $C$DW$T$21      .dwtag  DW_TAG_union_type
    1906                      .dwattr $C$DW$T$21, DW_AT_name("SDCMPH1_REG")
    1907                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x01)
    1908              $C$DW$83        .dwtag  DW_TAG_member
    1909                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$19)
    1910                      .dwattr $C$DW$83, DW_AT_name("all")
    1911                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_all")
    1912                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1913                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1914              
    1915              $C$DW$84        .dwtag  DW_TAG_member
    1916                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$20)
    1917                      .dwattr $C$DW$84, DW_AT_name("bit")
    1918                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_bit")
    1919                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1920                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1921              
    1922                      .dwendtag $C$DW$T$21
    1923              
    1924              
    1925              $C$DW$T$22      .dwtag  DW_TAG_structure_type
    1926                      .dwattr $C$DW$T$22, DW_AT_name("SDCMPH2_BITS")
    1927                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x01)
    1928              $C$DW$85        .dwtag  DW_TAG_member
    1929                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$19)
    1930                      .dwattr $C$DW$85, DW_AT_name("HLT")
    1931                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_HLT")
    1932                      .dwattr $C$DW$85, DW_AT_bit_offset(0x01)
    1933                      .dwattr $C$DW$85, DW_AT_bit_size(0x0f)
    1934                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1935                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1936              
    1937              $C$DW$86        .dwtag  DW_TAG_member
    1938                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$19)
    1939                      .dwattr $C$DW$86, DW_AT_name("rsvd1")
    1940                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_rsvd1")
    1941                      .dwattr $C$DW$86, DW_AT_bit_offset(0x00)
    1942                      .dwattr $C$DW$86, DW_AT_bit_size(0x01)
    1943                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1944                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1945              
    1946                      .dwendtag $C$DW$T$22
    1947              
    1948              
    1949              $C$DW$T$23      .dwtag  DW_TAG_union_type
TMS320C2000 Assembler PC v15.12.1 Sun May 28 10:39:54 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_sdfm_drivers.asm                                             PAGE   41

    1950                      .dwattr $C$DW$T$23, DW_AT_name("SDCMPH2_REG")
    1951                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x01)
    1952              $C$DW$87        .dwtag  DW_TAG_member
    1953                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$19)
    1954                      .dwattr $C$DW$87, DW_AT_name("all")
    1955                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_all")
    1956                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1957                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1958              
    1959              $C$DW$88        .dwtag  DW_TAG_member
    1960                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$22)
    1961                      .dwattr $C$DW$88, DW_AT_name("bit")
    1962                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_bit")
    1963                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1964                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1965              
    1966                      .dwendtag $C$DW$T$23
    1967              
    1968              
    1969              $C$DW$T$24      .dwtag  DW_TAG_structure_type
    1970                      .dwattr $C$DW$T$24, DW_AT_name("SDCMPH3_BITS")
    1971                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x01)
    1972              $C$DW$89        .dwtag  DW_TAG_member
    1973                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$19)
    1974                      .dwattr $C$DW$89, DW_AT_name("HLT")
    1975                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_HLT")
    1976                      .dwattr $C$DW$89, DW_AT_bit_offset(0x01)
    1977                      .dwattr $C$DW$89, DW_AT_bit_size(0x0f)
    1978                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1979                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1980              
    1981              $C$DW$90        .dwtag  DW_TAG_member
    1982                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$19)
    1983                      .dwattr $C$DW$90, DW_AT_name("rsvd1")
    1984                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_rsvd1")
    1985                      .dwattr $C$DW$90, DW_AT_bit_offset(0x00)
    1986                      .dwattr $C$DW$90, DW_AT_bit_size(0x01)
    1987                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1988                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1989              
    1990                      .dwendtag $C$DW$T$24
    1991              
    1992              
    1993              $C$DW$T$25      .dwtag  DW_TAG_union_type
    1994                      .dwattr $C$DW$T$25, DW_AT_name("SDCMPH3_REG")
    1995                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x01)
    1996              $C$DW$91        .dwtag  DW_TAG_member
    1997                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$19)
    1998                      .dwattr $C$DW$91, DW_AT_name("all")
    1999                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_all")
    2000                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2001                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    2002              
    2003              $C$DW$92        .dwtag  DW_TAG_member
    2004                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$24)
TMS320C2000 Assembler PC v15.12.1 Sun May 28 10:39:54 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_sdfm_drivers.asm                                             PAGE   42

    2005                      .dwattr $C$DW$92, DW_AT_name("bit")
    2006                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_bit")
    2007                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2008                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    2009              
    2010                      .dwendtag $C$DW$T$25
    2011              
    2012              
    2013              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    2014                      .dwattr $C$DW$T$26, DW_AT_name("SDCMPH4_BITS")
    2015                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x01)
    2016              $C$DW$93        .dwtag  DW_TAG_member
    2017                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$19)
    2018                      .dwattr $C$DW$93, DW_AT_name("HLT")
    2019                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_HLT")
    2020                      .dwattr $C$DW$93, DW_AT_bit_offset(0x01)
    2021                      .dwattr $C$DW$93, DW_AT_bit_size(0x0f)
    2022                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2023                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    2024              
    2025              $C$DW$94        .dwtag  DW_TAG_member
    2026                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$19)
    2027                      .dwattr $C$DW$94, DW_AT_name("rsvd1")
    2028                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_rsvd1")
    2029                      .dwattr $C$DW$94, DW_AT_bit_offset(0x00)
    2030                      .dwattr $C$DW$94, DW_AT_bit_size(0x01)
    2031                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2032                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    2033              
    2034                      .dwendtag $C$DW$T$26
    2035              
    2036              
    2037              $C$DW$T$27      .dwtag  DW_TAG_union_type
    2038                      .dwattr $C$DW$T$27, DW_AT_name("SDCMPH4_REG")
    2039                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x01)
    2040              $C$DW$95        .dwtag  DW_TAG_member
    2041                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$19)
    2042                      .dwattr $C$DW$95, DW_AT_name("all")
    2043                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_all")
    2044                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2045                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    2046              
    2047              $C$DW$96        .dwtag  DW_TAG_member
    2048                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$26)
    2049                      .dwattr $C$DW$96, DW_AT_name("bit")
    2050                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_bit")
    2051                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2052                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    2053              
    2054                      .dwendtag $C$DW$T$27
    2055              
    2056              
    2057              $C$DW$T$28      .dwtag  DW_TAG_structure_type
    2058                      .dwattr $C$DW$T$28, DW_AT_name("SDCMPL1_BITS")
    2059                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x01)
TMS320C2000 Assembler PC v15.12.1 Sun May 28 10:39:54 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_sdfm_drivers.asm                                             PAGE   43

    2060              $C$DW$97        .dwtag  DW_TAG_member
    2061                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$19)
    2062                      .dwattr $C$DW$97, DW_AT_name("LLT")
    2063                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_LLT")
    2064                      .dwattr $C$DW$97, DW_AT_bit_offset(0x01)
    2065                      .dwattr $C$DW$97, DW_AT_bit_size(0x0f)
    2066                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2067                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    2068              
    2069              $C$DW$98        .dwtag  DW_TAG_member
    2070                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$19)
    2071                      .dwattr $C$DW$98, DW_AT_name("rsvd1")
    2072                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_rsvd1")
    2073                      .dwattr $C$DW$98, DW_AT_bit_offset(0x00)
    2074                      .dwattr $C$DW$98, DW_AT_bit_size(0x01)
    2075                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2076                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    2077              
    2078                      .dwendtag $C$DW$T$28
    2079              
    2080              
    2081              $C$DW$T$29      .dwtag  DW_TAG_union_type
    2082                      .dwattr $C$DW$T$29, DW_AT_name("SDCMPL1_REG")
    2083                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x01)
    2084              $C$DW$99        .dwtag  DW_TAG_member
    2085                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$19)
    2086                      .dwattr $C$DW$99, DW_AT_name("all")
    2087                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_all")
    2088                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2089                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    2090              
    2091              $C$DW$100       .dwtag  DW_TAG_member
    2092                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$28)
    2093                      .dwattr $C$DW$100, DW_AT_name("bit")
    2094                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_bit")
    2095                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2096                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    2097              
    2098                      .dwendtag $C$DW$T$29
    2099              
    2100              
    2101              $C$DW$T$30      .dwtag  DW_TAG_structure_type
    2102                      .dwattr $C$DW$T$30, DW_AT_name("SDCMPL2_BITS")
    2103                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x01)
    2104              $C$DW$101       .dwtag  DW_TAG_member
    2105                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$19)
    2106                      .dwattr $C$DW$101, DW_AT_name("LLT")
    2107                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_LLT")
    2108                      .dwattr $C$DW$101, DW_AT_bit_offset(0x01)
    2109                      .dwattr $C$DW$101, DW_AT_bit_size(0x0f)
    2110                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2111                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    2112              
    2113              $C$DW$102       .dwtag  DW_TAG_member
    2114                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v15.12.1 Sun May 28 10:39:54 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_sdfm_drivers.asm                                             PAGE   44

    2115                      .dwattr $C$DW$102, DW_AT_name("rsvd1")
    2116                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_rsvd1")
    2117                      .dwattr $C$DW$102, DW_AT_bit_offset(0x00)
    2118                      .dwattr $C$DW$102, DW_AT_bit_size(0x01)
    2119                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2120                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    2121              
    2122                      .dwendtag $C$DW$T$30
    2123              
    2124              
    2125              $C$DW$T$31      .dwtag  DW_TAG_union_type
    2126                      .dwattr $C$DW$T$31, DW_AT_name("SDCMPL2_REG")
    2127                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x01)
    2128              $C$DW$103       .dwtag  DW_TAG_member
    2129                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$19)
    2130                      .dwattr $C$DW$103, DW_AT_name("all")
    2131                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_all")
    2132                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2133                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    2134              
    2135              $C$DW$104       .dwtag  DW_TAG_member
    2136                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$30)
    2137                      .dwattr $C$DW$104, DW_AT_name("bit")
    2138                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_bit")
    2139                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2140                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    2141              
    2142                      .dwendtag $C$DW$T$31
    2143              
    2144              
    2145              $C$DW$T$32      .dwtag  DW_TAG_structure_type
    2146                      .dwattr $C$DW$T$32, DW_AT_name("SDCMPL3_BITS")
    2147                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x01)
    2148              $C$DW$105       .dwtag  DW_TAG_member
    2149                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$19)
    2150                      .dwattr $C$DW$105, DW_AT_name("LLT")
    2151                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_LLT")
    2152                      .dwattr $C$DW$105, DW_AT_bit_offset(0x01)
    2153                      .dwattr $C$DW$105, DW_AT_bit_size(0x0f)
    2154                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2155                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    2156              
    2157              $C$DW$106       .dwtag  DW_TAG_member
    2158                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$19)
    2159                      .dwattr $C$DW$106, DW_AT_name("rsvd1")
    2160                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_rsvd1")
    2161                      .dwattr $C$DW$106, DW_AT_bit_offset(0x00)
    2162                      .dwattr $C$DW$106, DW_AT_bit_size(0x01)
    2163                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2164                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    2165              
    2166                      .dwendtag $C$DW$T$32
    2167              
    2168              
    2169              $C$DW$T$33      .dwtag  DW_TAG_union_type
TMS320C2000 Assembler PC v15.12.1 Sun May 28 10:39:54 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_sdfm_drivers.asm                                             PAGE   45

    2170                      .dwattr $C$DW$T$33, DW_AT_name("SDCMPL3_REG")
    2171                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
    2172              $C$DW$107       .dwtag  DW_TAG_member
    2173                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$19)
    2174                      .dwattr $C$DW$107, DW_AT_name("all")
    2175                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_all")
    2176                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2177                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    2178              
    2179              $C$DW$108       .dwtag  DW_TAG_member
    2180                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$32)
    2181                      .dwattr $C$DW$108, DW_AT_name("bit")
    2182                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_bit")
    2183                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2184                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    2185              
    2186                      .dwendtag $C$DW$T$33
    2187              
    2188              
    2189              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    2190                      .dwattr $C$DW$T$34, DW_AT_name("SDCMPL4_BITS")
    2191                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
    2192              $C$DW$109       .dwtag  DW_TAG_member
    2193                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$19)
    2194                      .dwattr $C$DW$109, DW_AT_name("LLT")
    2195                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_LLT")
    2196                      .dwattr $C$DW$109, DW_AT_bit_offset(0x01)
    2197                      .dwattr $C$DW$109, DW_AT_bit_size(0x0f)
    2198                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2199                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    2200              
    2201              $C$DW$110       .dwtag  DW_TAG_member
    2202                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$19)
    2203                      .dwattr $C$DW$110, DW_AT_name("rsvd1")
    2204                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_rsvd1")
    2205                      .dwattr $C$DW$110, DW_AT_bit_offset(0x00)
    2206                      .dwattr $C$DW$110, DW_AT_bit_size(0x01)
    2207                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2208                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    2209              
    2210                      .dwendtag $C$DW$T$34
    2211              
    2212              
    2213              $C$DW$T$35      .dwtag  DW_TAG_union_type
    2214                      .dwattr $C$DW$T$35, DW_AT_name("SDCMPL4_REG")
    2215                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x01)
    2216              $C$DW$111       .dwtag  DW_TAG_member
    2217                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$19)
    2218                      .dwattr $C$DW$111, DW_AT_name("all")
    2219                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_all")
    2220                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2221                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    2222              
    2223              $C$DW$112       .dwtag  DW_TAG_member
    2224                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$34)
TMS320C2000 Assembler PC v15.12.1 Sun May 28 10:39:54 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_sdfm_drivers.asm                                             PAGE   46

    2225                      .dwattr $C$DW$112, DW_AT_name("bit")
    2226                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_bit")
    2227                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2228                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    2229              
    2230                      .dwendtag $C$DW$T$35
    2231              
    2232              
    2233              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    2234                      .dwattr $C$DW$T$36, DW_AT_name("SDCPARM1_BITS")
    2235                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x01)
    2236              $C$DW$113       .dwtag  DW_TAG_member
    2237                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$19)
    2238                      .dwattr $C$DW$113, DW_AT_name("COSR")
    2239                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_COSR")
    2240                      .dwattr $C$DW$113, DW_AT_bit_offset(0x0b)
    2241                      .dwattr $C$DW$113, DW_AT_bit_size(0x05)
    2242                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2243                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    2244              
    2245              $C$DW$114       .dwtag  DW_TAG_member
    2246                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$19)
    2247                      .dwattr $C$DW$114, DW_AT_name("IEH")
    2248                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_IEH")
    2249                      .dwattr $C$DW$114, DW_AT_bit_offset(0x0a)
    2250                      .dwattr $C$DW$114, DW_AT_bit_size(0x01)
    2251                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2252                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    2253              
    2254              $C$DW$115       .dwtag  DW_TAG_member
    2255                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$19)
    2256                      .dwattr $C$DW$115, DW_AT_name("IEL")
    2257                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_IEL")
    2258                      .dwattr $C$DW$115, DW_AT_bit_offset(0x09)
    2259                      .dwattr $C$DW$115, DW_AT_bit_size(0x01)
    2260                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2261                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    2262              
    2263              $C$DW$116       .dwtag  DW_TAG_member
    2264                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$19)
    2265                      .dwattr $C$DW$116, DW_AT_name("CS1_CS0")
    2266                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_CS1_CS0")
    2267                      .dwattr $C$DW$116, DW_AT_bit_offset(0x07)
    2268                      .dwattr $C$DW$116, DW_AT_bit_size(0x02)
    2269                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2270                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    2271              
    2272              $C$DW$117       .dwtag  DW_TAG_member
    2273                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$19)
    2274                      .dwattr $C$DW$117, DW_AT_name("MFIE")
    2275                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_MFIE")
    2276                      .dwattr $C$DW$117, DW_AT_bit_offset(0x06)
    2277                      .dwattr $C$DW$117, DW_AT_bit_size(0x01)
    2278                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2279                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.1 Sun May 28 10:39:54 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_sdfm_drivers.asm                                             PAGE   47

    2280              
    2281              $C$DW$118       .dwtag  DW_TAG_member
    2282                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$19)
    2283                      .dwattr $C$DW$118, DW_AT_name("rsvd1")
    2284                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_rsvd1")
    2285                      .dwattr $C$DW$118, DW_AT_bit_offset(0x00)
    2286                      .dwattr $C$DW$118, DW_AT_bit_size(0x06)
    2287                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2288                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    2289              
    2290                      .dwendtag $C$DW$T$36
    2291              
    2292              
    2293              $C$DW$T$37      .dwtag  DW_TAG_union_type
    2294                      .dwattr $C$DW$T$37, DW_AT_name("SDCPARM1_REG")
    2295                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x01)
    2296              $C$DW$119       .dwtag  DW_TAG_member
    2297                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$19)
    2298                      .dwattr $C$DW$119, DW_AT_name("all")
    2299                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_all")
    2300                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2301                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    2302              
    2303              $C$DW$120       .dwtag  DW_TAG_member
    2304                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$36)
    2305                      .dwattr $C$DW$120, DW_AT_name("bit")
    2306                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_bit")
    2307                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2308                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    2309              
    2310                      .dwendtag $C$DW$T$37
    2311              
    2312              
    2313              $C$DW$T$38      .dwtag  DW_TAG_structure_type
    2314                      .dwattr $C$DW$T$38, DW_AT_name("SDCPARM2_BITS")
    2315                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x01)
    2316              $C$DW$121       .dwtag  DW_TAG_member
    2317                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$19)
    2318                      .dwattr $C$DW$121, DW_AT_name("COSR")
    2319                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_COSR")
    2320                      .dwattr $C$DW$121, DW_AT_bit_offset(0x0b)
    2321                      .dwattr $C$DW$121, DW_AT_bit_size(0x05)
    2322                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2323                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    2324              
    2325              $C$DW$122       .dwtag  DW_TAG_member
    2326                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$19)
    2327                      .dwattr $C$DW$122, DW_AT_name("IEH")
    2328                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_IEH")
    2329                      .dwattr $C$DW$122, DW_AT_bit_offset(0x0a)
    2330                      .dwattr $C$DW$122, DW_AT_bit_size(0x01)
    2331                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2332                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    2333              
    2334              $C$DW$123       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v15.12.1 Sun May 28 10:39:54 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_sdfm_drivers.asm                                             PAGE   48

    2335                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$19)
    2336                      .dwattr $C$DW$123, DW_AT_name("IEL")
    2337                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_IEL")
    2338                      .dwattr $C$DW$123, DW_AT_bit_offset(0x09)
    2339                      .dwattr $C$DW$123, DW_AT_bit_size(0x01)
    2340                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2341                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    2342              
    2343              $C$DW$124       .dwtag  DW_TAG_member
    2344                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$19)
    2345                      .dwattr $C$DW$124, DW_AT_name("CS1_CS0")
    2346                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_CS1_CS0")
    2347                      .dwattr $C$DW$124, DW_AT_bit_offset(0x07)
    2348                      .dwattr $C$DW$124, DW_AT_bit_size(0x02)
    2349                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2350                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    2351              
    2352              $C$DW$125       .dwtag  DW_TAG_member
    2353                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$19)
    2354                      .dwattr $C$DW$125, DW_AT_name("MFIE")
    2355                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_MFIE")
    2356                      .dwattr $C$DW$125, DW_AT_bit_offset(0x06)
    2357                      .dwattr $C$DW$125, DW_AT_bit_size(0x01)
    2358                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2359                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    2360              
    2361              $C$DW$126       .dwtag  DW_TAG_member
    2362                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$19)
    2363                      .dwattr $C$DW$126, DW_AT_name("rsvd1")
    2364                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_rsvd1")
    2365                      .dwattr $C$DW$126, DW_AT_bit_offset(0x00)
    2366                      .dwattr $C$DW$126, DW_AT_bit_size(0x06)
    2367                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2368                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    2369              
    2370                      .dwendtag $C$DW$T$38
    2371              
    2372              
    2373              $C$DW$T$39      .dwtag  DW_TAG_union_type
    2374                      .dwattr $C$DW$T$39, DW_AT_name("SDCPARM2_REG")
    2375                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x01)
    2376              $C$DW$127       .dwtag  DW_TAG_member
    2377                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$19)
    2378                      .dwattr $C$DW$127, DW_AT_name("all")
    2379                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_all")
    2380                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2381                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    2382              
    2383              $C$DW$128       .dwtag  DW_TAG_member
    2384                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$38)
    2385                      .dwattr $C$DW$128, DW_AT_name("bit")
    2386                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_bit")
    2387                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2388                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    2389              
TMS320C2000 Assembler PC v15.12.1 Sun May 28 10:39:54 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_sdfm_drivers.asm                                             PAGE   49

    2390                      .dwendtag $C$DW$T$39
    2391              
    2392              
    2393              $C$DW$T$40      .dwtag  DW_TAG_structure_type
    2394                      .dwattr $C$DW$T$40, DW_AT_name("SDCPARM3_BITS")
    2395                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x01)
    2396              $C$DW$129       .dwtag  DW_TAG_member
    2397                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$19)
    2398                      .dwattr $C$DW$129, DW_AT_name("COSR")
    2399                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_COSR")
    2400                      .dwattr $C$DW$129, DW_AT_bit_offset(0x0b)
    2401                      .dwattr $C$DW$129, DW_AT_bit_size(0x05)
    2402                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2403                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    2404              
    2405              $C$DW$130       .dwtag  DW_TAG_member
    2406                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$19)
    2407                      .dwattr $C$DW$130, DW_AT_name("IEH")
    2408                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_IEH")
    2409                      .dwattr $C$DW$130, DW_AT_bit_offset(0x0a)
    2410                      .dwattr $C$DW$130, DW_AT_bit_size(0x01)
    2411                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2412                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    2413              
    2414              $C$DW$131       .dwtag  DW_TAG_member
    2415                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$19)
    2416                      .dwattr $C$DW$131, DW_AT_name("IEL")
    2417                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_IEL")
    2418                      .dwattr $C$DW$131, DW_AT_bit_offset(0x09)
    2419                      .dwattr $C$DW$131, DW_AT_bit_size(0x01)
    2420                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2421                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    2422              
    2423              $C$DW$132       .dwtag  DW_TAG_member
    2424                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$19)
    2425                      .dwattr $C$DW$132, DW_AT_name("CS1_CS0")
    2426                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_CS1_CS0")
    2427                      .dwattr $C$DW$132, DW_AT_bit_offset(0x07)
    2428                      .dwattr $C$DW$132, DW_AT_bit_size(0x02)
    2429                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2430                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    2431              
    2432              $C$DW$133       .dwtag  DW_TAG_member
    2433                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$19)
    2434                      .dwattr $C$DW$133, DW_AT_name("MFIE")
    2435                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_MFIE")
    2436                      .dwattr $C$DW$133, DW_AT_bit_offset(0x06)
    2437                      .dwattr $C$DW$133, DW_AT_bit_size(0x01)
    2438                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2439                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    2440              
    2441              $C$DW$134       .dwtag  DW_TAG_member
    2442                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$19)
    2443                      .dwattr $C$DW$134, DW_AT_name("rsvd1")
    2444                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_rsvd1")
TMS320C2000 Assembler PC v15.12.1 Sun May 28 10:39:54 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_sdfm_drivers.asm                                             PAGE   50

    2445                      .dwattr $C$DW$134, DW_AT_bit_offset(0x00)
    2446                      .dwattr $C$DW$134, DW_AT_bit_size(0x06)
    2447                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2448                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    2449              
    2450                      .dwendtag $C$DW$T$40
    2451              
    2452              
    2453              $C$DW$T$41      .dwtag  DW_TAG_union_type
    2454                      .dwattr $C$DW$T$41, DW_AT_name("SDCPARM3_REG")
    2455                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x01)
    2456              $C$DW$135       .dwtag  DW_TAG_member
    2457                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$19)
    2458                      .dwattr $C$DW$135, DW_AT_name("all")
    2459                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_all")
    2460                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2461                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    2462              
    2463              $C$DW$136       .dwtag  DW_TAG_member
    2464                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$40)
    2465                      .dwattr $C$DW$136, DW_AT_name("bit")
    2466                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_bit")
    2467                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2468                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    2469              
    2470                      .dwendtag $C$DW$T$41
    2471              
    2472              
    2473              $C$DW$T$42      .dwtag  DW_TAG_structure_type
    2474                      .dwattr $C$DW$T$42, DW_AT_name("SDCPARM4_BITS")
    2475                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x01)
    2476              $C$DW$137       .dwtag  DW_TAG_member
    2477                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$19)
    2478                      .dwattr $C$DW$137, DW_AT_name("COSR")
    2479                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_COSR")
    2480                      .dwattr $C$DW$137, DW_AT_bit_offset(0x0b)
    2481                      .dwattr $C$DW$137, DW_AT_bit_size(0x05)
    2482                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2483                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    2484              
    2485              $C$DW$138       .dwtag  DW_TAG_member
    2486                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$19)
    2487                      .dwattr $C$DW$138, DW_AT_name("IEH")
    2488                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_IEH")
    2489                      .dwattr $C$DW$138, DW_AT_bit_offset(0x0a)
    2490                      .dwattr $C$DW$138, DW_AT_bit_size(0x01)
    2491                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2492                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    2493              
    2494              $C$DW$139       .dwtag  DW_TAG_member
    2495                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$19)
    2496                      .dwattr $C$DW$139, DW_AT_name("IEL")
    2497                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_IEL")
    2498                      .dwattr $C$DW$139, DW_AT_bit_offset(0x09)
    2499                      .dwattr $C$DW$139, DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v15.12.1 Sun May 28 10:39:54 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_sdfm_drivers.asm                                             PAGE   51

    2500                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2501                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    2502              
    2503              $C$DW$140       .dwtag  DW_TAG_member
    2504                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$19)
    2505                      .dwattr $C$DW$140, DW_AT_name("CS1_CS0")
    2506                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_CS1_CS0")
    2507                      .dwattr $C$DW$140, DW_AT_bit_offset(0x07)
    2508                      .dwattr $C$DW$140, DW_AT_bit_size(0x02)
    2509                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2510                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    2511              
    2512              $C$DW$141       .dwtag  DW_TAG_member
    2513                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$19)
    2514                      .dwattr $C$DW$141, DW_AT_name("MFIE")
    2515                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_MFIE")
    2516                      .dwattr $C$DW$141, DW_AT_bit_offset(0x06)
    2517                      .dwattr $C$DW$141, DW_AT_bit_size(0x01)
    2518                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2519                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    2520              
    2521              $C$DW$142       .dwtag  DW_TAG_member
    2522                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$19)
    2523                      .dwattr $C$DW$142, DW_AT_name("rsvd1")
    2524                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_rsvd1")
    2525                      .dwattr $C$DW$142, DW_AT_bit_offset(0x00)
    2526                      .dwattr $C$DW$142, DW_AT_bit_size(0x06)
    2527                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2528                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    2529              
    2530                      .dwendtag $C$DW$T$42
    2531              
    2532              
    2533              $C$DW$T$43      .dwtag  DW_TAG_union_type
    2534                      .dwattr $C$DW$T$43, DW_AT_name("SDCPARM4_REG")
    2535                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x01)
    2536              $C$DW$143       .dwtag  DW_TAG_member
    2537                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$19)
    2538                      .dwattr $C$DW$143, DW_AT_name("all")
    2539                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_all")
    2540                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2541                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    2542              
    2543              $C$DW$144       .dwtag  DW_TAG_member
    2544                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$42)
    2545                      .dwattr $C$DW$144, DW_AT_name("bit")
    2546                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_bit")
    2547                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2548                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    2549              
    2550                      .dwendtag $C$DW$T$43
    2551              
    2552              
    2553              $C$DW$T$44      .dwtag  DW_TAG_structure_type
    2554                      .dwattr $C$DW$T$44, DW_AT_name("SDCTLPARM1_BITS")
TMS320C2000 Assembler PC v15.12.1 Sun May 28 10:39:54 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_sdfm_drivers.asm                                             PAGE   52

    2555                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x01)
    2556              $C$DW$145       .dwtag  DW_TAG_member
    2557                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$19)
    2558                      .dwattr $C$DW$145, DW_AT_name("MOD")
    2559                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_MOD")
    2560                      .dwattr $C$DW$145, DW_AT_bit_offset(0x0e)
    2561                      .dwattr $C$DW$145, DW_AT_bit_size(0x02)
    2562                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2563                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    2564              
    2565              $C$DW$146       .dwtag  DW_TAG_member
    2566                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$19)
    2567                      .dwattr $C$DW$146, DW_AT_name("rsvd1")
    2568                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_rsvd1")
    2569                      .dwattr $C$DW$146, DW_AT_bit_offset(0x0d)
    2570                      .dwattr $C$DW$146, DW_AT_bit_size(0x01)
    2571                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2572                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    2573              
    2574              $C$DW$147       .dwtag  DW_TAG_member
    2575                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$19)
    2576                      .dwattr $C$DW$147, DW_AT_name("rsvd2")
    2577                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_rsvd2")
    2578                      .dwattr $C$DW$147, DW_AT_bit_offset(0x0c)
    2579                      .dwattr $C$DW$147, DW_AT_bit_size(0x01)
    2580                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2581                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    2582              
    2583              $C$DW$148       .dwtag  DW_TAG_member
    2584                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$19)
    2585                      .dwattr $C$DW$148, DW_AT_name("rsvd3")
    2586                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_rsvd3")
    2587                      .dwattr $C$DW$148, DW_AT_bit_offset(0x0b)
    2588                      .dwattr $C$DW$148, DW_AT_bit_size(0x01)
    2589                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2590                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    2591              
    2592              $C$DW$149       .dwtag  DW_TAG_member
    2593                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$19)
    2594                      .dwattr $C$DW$149, DW_AT_name("rsvd4")
    2595                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_rsvd4")
    2596                      .dwattr $C$DW$149, DW_AT_bit_offset(0x00)
    2597                      .dwattr $C$DW$149, DW_AT_bit_size(0x0b)
    2598                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2599                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    2600              
    2601                      .dwendtag $C$DW$T$44
    2602              
    2603              
    2604              $C$DW$T$45      .dwtag  DW_TAG_union_type
    2605                      .dwattr $C$DW$T$45, DW_AT_name("SDCTLPARM1_REG")
    2606                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x01)
    2607              $C$DW$150       .dwtag  DW_TAG_member
    2608                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$19)
    2609                      .dwattr $C$DW$150, DW_AT_name("all")
TMS320C2000 Assembler PC v15.12.1 Sun May 28 10:39:54 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_sdfm_drivers.asm                                             PAGE   53

    2610                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_all")
    2611                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2612                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    2613              
    2614              $C$DW$151       .dwtag  DW_TAG_member
    2615                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$44)
    2616                      .dwattr $C$DW$151, DW_AT_name("bit")
    2617                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_bit")
    2618                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2619                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    2620              
    2621                      .dwendtag $C$DW$T$45
    2622              
    2623              
    2624              $C$DW$T$46      .dwtag  DW_TAG_structure_type
    2625                      .dwattr $C$DW$T$46, DW_AT_name("SDCTLPARM2_BITS")
    2626                      .dwattr $C$DW$T$46, DW_AT_byte_size(0x01)
    2627              $C$DW$152       .dwtag  DW_TAG_member
    2628                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$19)
    2629                      .dwattr $C$DW$152, DW_AT_name("MOD")
    2630                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_MOD")
    2631                      .dwattr $C$DW$152, DW_AT_bit_offset(0x0e)
    2632                      .dwattr $C$DW$152, DW_AT_bit_size(0x02)
    2633                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2634                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    2635              
    2636              $C$DW$153       .dwtag  DW_TAG_member
    2637                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$19)
    2638                      .dwattr $C$DW$153, DW_AT_name("rsvd1")
    2639                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_rsvd1")
    2640                      .dwattr $C$DW$153, DW_AT_bit_offset(0x0d)
    2641                      .dwattr $C$DW$153, DW_AT_bit_size(0x01)
    2642                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2643                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    2644              
    2645              $C$DW$154       .dwtag  DW_TAG_member
    2646                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$19)
    2647                      .dwattr $C$DW$154, DW_AT_name("rsvd2")
    2648                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_rsvd2")
    2649                      .dwattr $C$DW$154, DW_AT_bit_offset(0x0c)
    2650                      .dwattr $C$DW$154, DW_AT_bit_size(0x01)
    2651                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2652                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    2653              
    2654              $C$DW$155       .dwtag  DW_TAG_member
    2655                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$19)
    2656                      .dwattr $C$DW$155, DW_AT_name("rsvd3")
    2657                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_rsvd3")
    2658                      .dwattr $C$DW$155, DW_AT_bit_offset(0x0b)
    2659                      .dwattr $C$DW$155, DW_AT_bit_size(0x01)
    2660                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2661                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    2662              
    2663              $C$DW$156       .dwtag  DW_TAG_member
    2664                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v15.12.1 Sun May 28 10:39:54 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_sdfm_drivers.asm                                             PAGE   54

    2665                      .dwattr $C$DW$156, DW_AT_name("MS")
    2666                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_MS")
    2667                      .dwattr $C$DW$156, DW_AT_bit_offset(0x00)
    2668                      .dwattr $C$DW$156, DW_AT_bit_size(0x0b)
    2669                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2670                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    2671              
    2672                      .dwendtag $C$DW$T$46
    2673              
    2674              
    2675              $C$DW$T$47      .dwtag  DW_TAG_union_type
    2676                      .dwattr $C$DW$T$47, DW_AT_name("SDCTLPARM2_REG")
    2677                      .dwattr $C$DW$T$47, DW_AT_byte_size(0x01)
    2678              $C$DW$157       .dwtag  DW_TAG_member
    2679                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$19)
    2680                      .dwattr $C$DW$157, DW_AT_name("all")
    2681                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_all")
    2682                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2683                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    2684              
    2685              $C$DW$158       .dwtag  DW_TAG_member
    2686                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$46)
    2687                      .dwattr $C$DW$158, DW_AT_name("bit")
    2688                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_bit")
    2689                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2690                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    2691              
    2692                      .dwendtag $C$DW$T$47
    2693              
    2694              
    2695              $C$DW$T$48      .dwtag  DW_TAG_structure_type
    2696                      .dwattr $C$DW$T$48, DW_AT_name("SDCTLPARM3_BITS")
    2697                      .dwattr $C$DW$T$48, DW_AT_byte_size(0x01)
    2698              $C$DW$159       .dwtag  DW_TAG_member
    2699                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$19)
    2700                      .dwattr $C$DW$159, DW_AT_name("MOD")
    2701                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_MOD")
    2702                      .dwattr $C$DW$159, DW_AT_bit_offset(0x0e)
    2703                      .dwattr $C$DW$159, DW_AT_bit_size(0x02)
    2704                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2705                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    2706              
    2707              $C$DW$160       .dwtag  DW_TAG_member
    2708                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$19)
    2709                      .dwattr $C$DW$160, DW_AT_name("rsvd1")
    2710                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_rsvd1")
    2711                      .dwattr $C$DW$160, DW_AT_bit_offset(0x0d)
    2712                      .dwattr $C$DW$160, DW_AT_bit_size(0x01)
    2713                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2714                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    2715              
    2716              $C$DW$161       .dwtag  DW_TAG_member
    2717                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$19)
    2718                      .dwattr $C$DW$161, DW_AT_name("rsvd2")
    2719                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_rsvd2")
TMS320C2000 Assembler PC v15.12.1 Sun May 28 10:39:54 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_sdfm_drivers.asm                                             PAGE   55

    2720                      .dwattr $C$DW$161, DW_AT_bit_offset(0x0c)
    2721                      .dwattr $C$DW$161, DW_AT_bit_size(0x01)
    2722                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2723                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    2724              
    2725              $C$DW$162       .dwtag  DW_TAG_member
    2726                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$19)
    2727                      .dwattr $C$DW$162, DW_AT_name("rsvd3")
    2728                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_rsvd3")
    2729                      .dwattr $C$DW$162, DW_AT_bit_offset(0x0b)
    2730                      .dwattr $C$DW$162, DW_AT_bit_size(0x01)
    2731                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2732                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    2733              
    2734              $C$DW$163       .dwtag  DW_TAG_member
    2735                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$19)
    2736                      .dwattr $C$DW$163, DW_AT_name("MS")
    2737                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_MS")
    2738                      .dwattr $C$DW$163, DW_AT_bit_offset(0x00)
    2739                      .dwattr $C$DW$163, DW_AT_bit_size(0x0b)
    2740                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2741                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    2742              
    2743                      .dwendtag $C$DW$T$48
    2744              
    2745              
    2746              $C$DW$T$49      .dwtag  DW_TAG_union_type
    2747                      .dwattr $C$DW$T$49, DW_AT_name("SDCTLPARM3_REG")
    2748                      .dwattr $C$DW$T$49, DW_AT_byte_size(0x01)
    2749              $C$DW$164       .dwtag  DW_TAG_member
    2750                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$19)
    2751                      .dwattr $C$DW$164, DW_AT_name("all")
    2752                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_all")
    2753                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2754                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    2755              
    2756              $C$DW$165       .dwtag  DW_TAG_member
    2757                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$48)
    2758                      .dwattr $C$DW$165, DW_AT_name("bit")
    2759                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_bit")
    2760                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2761                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    2762              
    2763                      .dwendtag $C$DW$T$49
    2764              
    2765              
    2766              $C$DW$T$50      .dwtag  DW_TAG_structure_type
    2767                      .dwattr $C$DW$T$50, DW_AT_name("SDCTLPARM4_BITS")
    2768                      .dwattr $C$DW$T$50, DW_AT_byte_size(0x01)
    2769              $C$DW$166       .dwtag  DW_TAG_member
    2770                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$19)
    2771                      .dwattr $C$DW$166, DW_AT_name("MOD")
    2772                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_MOD")
    2773                      .dwattr $C$DW$166, DW_AT_bit_offset(0x0e)
    2774                      .dwattr $C$DW$166, DW_AT_bit_size(0x02)
TMS320C2000 Assembler PC v15.12.1 Sun May 28 10:39:54 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_sdfm_drivers.asm                                             PAGE   56

    2775                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2776                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    2777              
    2778              $C$DW$167       .dwtag  DW_TAG_member
    2779                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$19)
    2780                      .dwattr $C$DW$167, DW_AT_name("rsvd1")
    2781                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_rsvd1")
    2782                      .dwattr $C$DW$167, DW_AT_bit_offset(0x0d)
    2783                      .dwattr $C$DW$167, DW_AT_bit_size(0x01)
    2784                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2785                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    2786              
    2787              $C$DW$168       .dwtag  DW_TAG_member
    2788                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$19)
    2789                      .dwattr $C$DW$168, DW_AT_name("rsvd2")
    2790                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_rsvd2")
    2791                      .dwattr $C$DW$168, DW_AT_bit_offset(0x0c)
    2792                      .dwattr $C$DW$168, DW_AT_bit_size(0x01)
    2793                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2794                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    2795              
    2796              $C$DW$169       .dwtag  DW_TAG_member
    2797                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$19)
    2798                      .dwattr $C$DW$169, DW_AT_name("rsvd3")
    2799                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_rsvd3")
    2800                      .dwattr $C$DW$169, DW_AT_bit_offset(0x0b)
    2801                      .dwattr $C$DW$169, DW_AT_bit_size(0x01)
    2802                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2803                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    2804              
    2805              $C$DW$170       .dwtag  DW_TAG_member
    2806                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$19)
    2807                      .dwattr $C$DW$170, DW_AT_name("MS")
    2808                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_MS")
    2809                      .dwattr $C$DW$170, DW_AT_bit_offset(0x00)
    2810                      .dwattr $C$DW$170, DW_AT_bit_size(0x0b)
    2811                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2812                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    2813              
    2814                      .dwendtag $C$DW$T$50
    2815              
    2816              
    2817              $C$DW$T$51      .dwtag  DW_TAG_union_type
    2818                      .dwattr $C$DW$T$51, DW_AT_name("SDCTLPARM4_REG")
    2819                      .dwattr $C$DW$T$51, DW_AT_byte_size(0x01)
    2820              $C$DW$171       .dwtag  DW_TAG_member
    2821                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$19)
    2822                      .dwattr $C$DW$171, DW_AT_name("all")
    2823                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_all")
    2824                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2825                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    2826              
    2827              $C$DW$172       .dwtag  DW_TAG_member
    2828                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$50)
    2829                      .dwattr $C$DW$172, DW_AT_name("bit")
TMS320C2000 Assembler PC v15.12.1 Sun May 28 10:39:54 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_sdfm_drivers.asm                                             PAGE   57

    2830                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_bit")
    2831                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2832                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    2833              
    2834                      .dwendtag $C$DW$T$51
    2835              
    2836              
    2837              $C$DW$T$52      .dwtag  DW_TAG_structure_type
    2838                      .dwattr $C$DW$T$52, DW_AT_name("SDCTL_BITS")
    2839                      .dwattr $C$DW$T$52, DW_AT_byte_size(0x01)
    2840              $C$DW$173       .dwtag  DW_TAG_member
    2841                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$19)
    2842                      .dwattr $C$DW$173, DW_AT_name("rsvd1")
    2843                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_rsvd1")
    2844                      .dwattr $C$DW$173, DW_AT_bit_offset(0x03)
    2845                      .dwattr $C$DW$173, DW_AT_bit_size(0x0d)
    2846                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2847                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    2848              
    2849              $C$DW$174       .dwtag  DW_TAG_member
    2850                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$19)
    2851                      .dwattr $C$DW$174, DW_AT_name("MIE")
    2852                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_MIE")
    2853                      .dwattr $C$DW$174, DW_AT_bit_offset(0x02)
    2854                      .dwattr $C$DW$174, DW_AT_bit_size(0x01)
    2855                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2856                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    2857              
    2858              $C$DW$175       .dwtag  DW_TAG_member
    2859                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$19)
    2860                      .dwattr $C$DW$175, DW_AT_name("rsvd2")
    2861                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_rsvd2")
    2862                      .dwattr $C$DW$175, DW_AT_bit_offset(0x01)
    2863                      .dwattr $C$DW$175, DW_AT_bit_size(0x01)
    2864                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2865                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    2866              
    2867              $C$DW$176       .dwtag  DW_TAG_member
    2868                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$19)
    2869                      .dwattr $C$DW$176, DW_AT_name("rsvd3")
    2870                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_rsvd3")
    2871                      .dwattr $C$DW$176, DW_AT_bit_offset(0x00)
    2872                      .dwattr $C$DW$176, DW_AT_bit_size(0x01)
    2873                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2874                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    2875              
    2876                      .dwendtag $C$DW$T$52
    2877              
    2878              
    2879              $C$DW$T$53      .dwtag  DW_TAG_union_type
    2880                      .dwattr $C$DW$T$53, DW_AT_name("SDCTL_REG")
    2881                      .dwattr $C$DW$T$53, DW_AT_byte_size(0x01)
    2882              $C$DW$177       .dwtag  DW_TAG_member
    2883                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$19)
    2884                      .dwattr $C$DW$177, DW_AT_name("all")
TMS320C2000 Assembler PC v15.12.1 Sun May 28 10:39:54 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_sdfm_drivers.asm                                             PAGE   58

    2885                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_all")
    2886                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2887                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    2888              
    2889              $C$DW$178       .dwtag  DW_TAG_member
    2890                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$52)
    2891                      .dwattr $C$DW$178, DW_AT_name("bit")
    2892                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_bit")
    2893                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2894                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    2895              
    2896                      .dwendtag $C$DW$T$53
    2897              
    2898              
    2899              $C$DW$T$54      .dwtag  DW_TAG_structure_type
    2900                      .dwattr $C$DW$T$54, DW_AT_name("SDDATA1_BITS")
    2901                      .dwattr $C$DW$T$54, DW_AT_byte_size(0x02)
    2902              $C$DW$179       .dwtag  DW_TAG_member
    2903                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$19)
    2904                      .dwattr $C$DW$179, DW_AT_name("DATA16")
    2905                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_DATA16")
    2906                      .dwattr $C$DW$179, DW_AT_bit_offset(0x00)
    2907                      .dwattr $C$DW$179, DW_AT_bit_size(0x10)
    2908                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2909                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    2910              
    2911              $C$DW$180       .dwtag  DW_TAG_member
    2912                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$19)
    2913                      .dwattr $C$DW$180, DW_AT_name("DATA32HI")
    2914                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_DATA32HI")
    2915                      .dwattr $C$DW$180, DW_AT_bit_offset(0x00)
    2916                      .dwattr $C$DW$180, DW_AT_bit_size(0x10)
    2917                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2918                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    2919              
    2920                      .dwendtag $C$DW$T$54
    2921              
    2922              
    2923              $C$DW$T$56      .dwtag  DW_TAG_union_type
    2924                      .dwattr $C$DW$T$56, DW_AT_name("SDDATA1_REG")
    2925                      .dwattr $C$DW$T$56, DW_AT_byte_size(0x02)
    2926              $C$DW$181       .dwtag  DW_TAG_member
    2927                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$55)
    2928                      .dwattr $C$DW$181, DW_AT_name("all")
    2929                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_all")
    2930                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2931                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    2932              
    2933              $C$DW$182       .dwtag  DW_TAG_member
    2934                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$54)
    2935                      .dwattr $C$DW$182, DW_AT_name("bit")
    2936                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_bit")
    2937                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2938                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    2939              
TMS320C2000 Assembler PC v15.12.1 Sun May 28 10:39:54 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_sdfm_drivers.asm                                             PAGE   59

    2940                      .dwendtag $C$DW$T$56
    2941              
    2942              
    2943              $C$DW$T$57      .dwtag  DW_TAG_structure_type
    2944                      .dwattr $C$DW$T$57, DW_AT_name("SDDATA2_BITS")
    2945                      .dwattr $C$DW$T$57, DW_AT_byte_size(0x02)
    2946              $C$DW$183       .dwtag  DW_TAG_member
    2947                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$19)
    2948                      .dwattr $C$DW$183, DW_AT_name("DATA16")
    2949                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_DATA16")
    2950                      .dwattr $C$DW$183, DW_AT_bit_offset(0x00)
    2951                      .dwattr $C$DW$183, DW_AT_bit_size(0x10)
    2952                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2953                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    2954              
    2955              $C$DW$184       .dwtag  DW_TAG_member
    2956                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$19)
    2957                      .dwattr $C$DW$184, DW_AT_name("DATA32HI")
    2958                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_DATA32HI")
    2959                      .dwattr $C$DW$184, DW_AT_bit_offset(0x00)
    2960                      .dwattr $C$DW$184, DW_AT_bit_size(0x10)
    2961                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2962                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    2963              
    2964                      .dwendtag $C$DW$T$57
    2965              
    2966              
    2967              $C$DW$T$58      .dwtag  DW_TAG_union_type
    2968                      .dwattr $C$DW$T$58, DW_AT_name("SDDATA2_REG")
    2969                      .dwattr $C$DW$T$58, DW_AT_byte_size(0x02)
    2970              $C$DW$185       .dwtag  DW_TAG_member
    2971                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$55)
    2972                      .dwattr $C$DW$185, DW_AT_name("all")
    2973                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_all")
    2974                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2975                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    2976              
    2977              $C$DW$186       .dwtag  DW_TAG_member
    2978                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$57)
    2979                      .dwattr $C$DW$186, DW_AT_name("bit")
    2980                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_bit")
    2981                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2982                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    2983              
    2984                      .dwendtag $C$DW$T$58
    2985              
    2986              
    2987              $C$DW$T$59      .dwtag  DW_TAG_structure_type
    2988                      .dwattr $C$DW$T$59, DW_AT_name("SDDATA3_BITS")
    2989                      .dwattr $C$DW$T$59, DW_AT_byte_size(0x02)
    2990              $C$DW$187       .dwtag  DW_TAG_member
    2991                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$19)
    2992                      .dwattr $C$DW$187, DW_AT_name("DATA16")
    2993                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_DATA16")
    2994                      .dwattr $C$DW$187, DW_AT_bit_offset(0x00)
TMS320C2000 Assembler PC v15.12.1 Sun May 28 10:39:54 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_sdfm_drivers.asm                                             PAGE   60

    2995                      .dwattr $C$DW$187, DW_AT_bit_size(0x10)
    2996                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2997                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    2998              
    2999              $C$DW$188       .dwtag  DW_TAG_member
    3000                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$19)
    3001                      .dwattr $C$DW$188, DW_AT_name("DATA32HI")
    3002                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_DATA32HI")
    3003                      .dwattr $C$DW$188, DW_AT_bit_offset(0x00)
    3004                      .dwattr $C$DW$188, DW_AT_bit_size(0x10)
    3005                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3006                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    3007              
    3008                      .dwendtag $C$DW$T$59
    3009              
    3010              
    3011              $C$DW$T$60      .dwtag  DW_TAG_union_type
    3012                      .dwattr $C$DW$T$60, DW_AT_name("SDDATA3_REG")
    3013                      .dwattr $C$DW$T$60, DW_AT_byte_size(0x02)
    3014              $C$DW$189       .dwtag  DW_TAG_member
    3015                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$55)
    3016                      .dwattr $C$DW$189, DW_AT_name("all")
    3017                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_all")
    3018                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3019                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    3020              
    3021              $C$DW$190       .dwtag  DW_TAG_member
    3022                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$59)
    3023                      .dwattr $C$DW$190, DW_AT_name("bit")
    3024                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_bit")
    3025                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3026                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    3027              
    3028                      .dwendtag $C$DW$T$60
    3029              
    3030              
    3031              $C$DW$T$61      .dwtag  DW_TAG_structure_type
    3032                      .dwattr $C$DW$T$61, DW_AT_name("SDDATA4_BITS")
    3033                      .dwattr $C$DW$T$61, DW_AT_byte_size(0x02)
    3034              $C$DW$191       .dwtag  DW_TAG_member
    3035                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$19)
    3036                      .dwattr $C$DW$191, DW_AT_name("DATA16")
    3037                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_DATA16")
    3038                      .dwattr $C$DW$191, DW_AT_bit_offset(0x00)
    3039                      .dwattr $C$DW$191, DW_AT_bit_size(0x10)
    3040                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3041                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    3042              
    3043              $C$DW$192       .dwtag  DW_TAG_member
    3044                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$19)
    3045                      .dwattr $C$DW$192, DW_AT_name("DATA32HI")
    3046                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_DATA32HI")
    3047                      .dwattr $C$DW$192, DW_AT_bit_offset(0x00)
    3048                      .dwattr $C$DW$192, DW_AT_bit_size(0x10)
    3049                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
TMS320C2000 Assembler PC v15.12.1 Sun May 28 10:39:54 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_sdfm_drivers.asm                                             PAGE   61

    3050                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    3051              
    3052                      .dwendtag $C$DW$T$61
    3053              
    3054              
    3055              $C$DW$T$62      .dwtag  DW_TAG_union_type
    3056                      .dwattr $C$DW$T$62, DW_AT_name("SDDATA4_REG")
    3057                      .dwattr $C$DW$T$62, DW_AT_byte_size(0x02)
    3058              $C$DW$193       .dwtag  DW_TAG_member
    3059                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$55)
    3060                      .dwattr $C$DW$193, DW_AT_name("all")
    3061                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_all")
    3062                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3063                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    3064              
    3065              $C$DW$194       .dwtag  DW_TAG_member
    3066                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$61)
    3067                      .dwattr $C$DW$194, DW_AT_name("bit")
    3068                      .dwattr $C$DW$194, DW_AT_TI_symbol_name("_bit")
    3069                      .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3070                      .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    3071              
    3072                      .dwendtag $C$DW$T$62
    3073              
    3074              
    3075              $C$DW$T$63      .dwtag  DW_TAG_structure_type
    3076                      .dwattr $C$DW$T$63, DW_AT_name("SDDFPARM1_BITS")
    3077                      .dwattr $C$DW$T$63, DW_AT_byte_size(0x01)
    3078              $C$DW$195       .dwtag  DW_TAG_member
    3079                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$19)
    3080                      .dwattr $C$DW$195, DW_AT_name("DOSR")
    3081                      .dwattr $C$DW$195, DW_AT_TI_symbol_name("_DOSR")
    3082                      .dwattr $C$DW$195, DW_AT_bit_offset(0x08)
    3083                      .dwattr $C$DW$195, DW_AT_bit_size(0x08)
    3084                      .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3085                      .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    3086              
    3087              $C$DW$196       .dwtag  DW_TAG_member
    3088                      .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$19)
    3089                      .dwattr $C$DW$196, DW_AT_name("FEN")
    3090                      .dwattr $C$DW$196, DW_AT_TI_symbol_name("_FEN")
    3091                      .dwattr $C$DW$196, DW_AT_bit_offset(0x07)
    3092                      .dwattr $C$DW$196, DW_AT_bit_size(0x01)
    3093                      .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3094                      .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    3095              
    3096              $C$DW$197       .dwtag  DW_TAG_member
    3097                      .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$19)
    3098                      .dwattr $C$DW$197, DW_AT_name("AE")
    3099                      .dwattr $C$DW$197, DW_AT_TI_symbol_name("_AE")
    3100                      .dwattr $C$DW$197, DW_AT_bit_offset(0x06)
    3101                      .dwattr $C$DW$197, DW_AT_bit_size(0x01)
    3102                      .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3103                      .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    3104              
TMS320C2000 Assembler PC v15.12.1 Sun May 28 10:39:54 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_sdfm_drivers.asm                                             PAGE   62

    3105              $C$DW$198       .dwtag  DW_TAG_member
    3106                      .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$19)
    3107                      .dwattr $C$DW$198, DW_AT_name("SST")
    3108                      .dwattr $C$DW$198, DW_AT_TI_symbol_name("_SST")
    3109                      .dwattr $C$DW$198, DW_AT_bit_offset(0x04)
    3110                      .dwattr $C$DW$198, DW_AT_bit_size(0x02)
    3111                      .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3112                      .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    3113              
    3114              $C$DW$199       .dwtag  DW_TAG_member
    3115                      .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$19)
    3116                      .dwattr $C$DW$199, DW_AT_name("FILRESEN")
    3117                      .dwattr $C$DW$199, DW_AT_TI_symbol_name("_FILRESEN")
    3118                      .dwattr $C$DW$199, DW_AT_bit_offset(0x03)
    3119                      .dwattr $C$DW$199, DW_AT_bit_size(0x01)
    3120                      .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3121                      .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    3122              
    3123              $C$DW$200       .dwtag  DW_TAG_member
    3124                      .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$19)
    3125                      .dwattr $C$DW$200, DW_AT_name("rsvd1")
    3126                      .dwattr $C$DW$200, DW_AT_TI_symbol_name("_rsvd1")
    3127                      .dwattr $C$DW$200, DW_AT_bit_offset(0x00)
    3128                      .dwattr $C$DW$200, DW_AT_bit_size(0x03)
    3129                      .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3130                      .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    3131              
    3132                      .dwendtag $C$DW$T$63
    3133              
    3134              
    3135              $C$DW$T$64      .dwtag  DW_TAG_union_type
    3136                      .dwattr $C$DW$T$64, DW_AT_name("SDDFPARM1_REG")
    3137                      .dwattr $C$DW$T$64, DW_AT_byte_size(0x01)
    3138              $C$DW$201       .dwtag  DW_TAG_member
    3139                      .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$19)
    3140                      .dwattr $C$DW$201, DW_AT_name("all")
    3141                      .dwattr $C$DW$201, DW_AT_TI_symbol_name("_all")
    3142                      .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3143                      .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    3144              
    3145              $C$DW$202       .dwtag  DW_TAG_member
    3146                      .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$63)
    3147                      .dwattr $C$DW$202, DW_AT_name("bit")
    3148                      .dwattr $C$DW$202, DW_AT_TI_symbol_name("_bit")
    3149                      .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3150                      .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    3151              
    3152                      .dwendtag $C$DW$T$64
    3153              
    3154              
    3155              $C$DW$T$65      .dwtag  DW_TAG_structure_type
    3156                      .dwattr $C$DW$T$65, DW_AT_name("SDDFPARM2_BITS")
    3157                      .dwattr $C$DW$T$65, DW_AT_byte_size(0x01)
    3158              $C$DW$203       .dwtag  DW_TAG_member
    3159                      .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v15.12.1 Sun May 28 10:39:54 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_sdfm_drivers.asm                                             PAGE   63

    3160                      .dwattr $C$DW$203, DW_AT_name("DOSR")
    3161                      .dwattr $C$DW$203, DW_AT_TI_symbol_name("_DOSR")
    3162                      .dwattr $C$DW$203, DW_AT_bit_offset(0x08)
    3163                      .dwattr $C$DW$203, DW_AT_bit_size(0x08)
    3164                      .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3165                      .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    3166              
    3167              $C$DW$204       .dwtag  DW_TAG_member
    3168                      .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$19)
    3169                      .dwattr $C$DW$204, DW_AT_name("FEN")
    3170                      .dwattr $C$DW$204, DW_AT_TI_symbol_name("_FEN")
    3171                      .dwattr $C$DW$204, DW_AT_bit_offset(0x07)
    3172                      .dwattr $C$DW$204, DW_AT_bit_size(0x01)
    3173                      .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3174                      .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    3175              
    3176              $C$DW$205       .dwtag  DW_TAG_member
    3177                      .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$19)
    3178                      .dwattr $C$DW$205, DW_AT_name("AE")
    3179                      .dwattr $C$DW$205, DW_AT_TI_symbol_name("_AE")
    3180                      .dwattr $C$DW$205, DW_AT_bit_offset(0x06)
    3181                      .dwattr $C$DW$205, DW_AT_bit_size(0x01)
    3182                      .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3183                      .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    3184              
    3185              $C$DW$206       .dwtag  DW_TAG_member
    3186                      .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$19)
    3187                      .dwattr $C$DW$206, DW_AT_name("SST")
    3188                      .dwattr $C$DW$206, DW_AT_TI_symbol_name("_SST")
    3189                      .dwattr $C$DW$206, DW_AT_bit_offset(0x04)
