TMS320C2000 Assembler PC v15.12.1 Sun Feb 26 22:57:13 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                   PC v15.12.1.LTS *
       3              ;* Date/Time created: Sun Feb 26 22:57:13 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --cla_support=cla0 --float_support=fpu32 --hll_source=on --mem_model:cod
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/controlSUITE/device_support/F2837xD/v170/F2837xD_common/source/F2
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v15.12.1.LTS Copyright (c) 1996-201
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Keith\workspace_v6_1_3\IDDK_PM_Servo_F2837x-v2\F2837x_FLAS
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram
      15                      .dwattr $C$DW$1, DW_AT_name("F28x_usDelay")

         000002e3 0001 
    2035                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xD/v170/F2837xD_common/source/F2837xD_SysCtrl.c"
    2036 000002e4 1A36!         OR        @_CpuSysRegs+118,#0x0003 ; [CPU_] |691| 
         000002e5 0003 
    2037 000002e6 761A   EDIS
    2038 000002e7       $C$L25:    
    2039                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xD/v170/F2837xD_common/source/F2837xD_SysCtrl.c"
    2040 000002e7 8F00!         MOVL      XAR4,#_DevCfgRegs     ; [CPU_U] |693| 
         000002e8 0000 
    2041 000002e9 A8A9          MOVL      ACC,XAR4              ; [CPU_] |693| 
    2042 000002ea FF10          ADD       ACC,#293 << 0         ; [CPU_] |693| 
         000002eb 0125 
    2043 000002ec 83A9          MOVL      XAR5,ACC              ; [CPU_] |693| 
    2044 000002ed 92C5          MOV       AL,*+XAR5[0]          ; [CPU_] |693| 
    2045 000002ee 9003          ANDB      AL,#0x03              ; [CPU_] |693| 
    2046 000002ef 6007          B         $C$L26,NEQ            ; [CPU_] |693| 
    2047                      ; branchcc occurs ; [] |693| 
    2048 000002f0 A8A9          MOVL      ACC,XAR4              ; [CPU_] |693| 
    2049 000002f1 FF12          ADD       ACC,#73 << 2          ; [CPU_] |693| 
         000002f2 0049 
    2050 000002f3 8AA9          MOVL      XAR4,ACC              ; [CPU_] |693| 
    2051 000002f4 40C4          TBIT      *+XAR4[0],#0          ; [CPU_] |693| 
    2052 000002f5 6DF2          B         $C$L25,TC             ; [CPU_] |693| 
    2053                      ; branchcc occurs ; [] |693| 
    2054 000002f6       $C$L26:    
    2055 000002f6 FF69          SPM       #0                    ; [CPU_] 
    2056                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xD/v170/F2837xD_common/source/F2837xD_SysCtrl.c"
    2057              $C$DW$87        .dwtag  DW_TAG_TI_branch
    2058                      .dwattr $C$DW$87, DW_AT_low_pc(0x00)
    2059                      .dwattr $C$DW$87, DW_AT_name("_DisablePeripheralClocks")
    2060                      .dwattr $C$DW$87, DW_AT_TI_call
    2061              
    2062 000002f7 7640'         LCR       #_DisablePeripheralClocks ; [CPU_] |694| 
         000002f8 00EC 
    2063                      ; call occurs [#_DisablePeripheralClocks] ; [] |694| 
TMS320C2000 Assembler PC v15.12.1 Sun Feb 26 22:57:13 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   42

    2064 000002f9 7622   EALLOW
    2065 000002fa 761F!         MOVW      DP,#_ClkCfgRegs+14    ; [CPU_U] 
         000002fb 0000 
    2066                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xD/v170/F2837xD_common/source/F2837xD_SysCtrl.c"
    2067 000002fc 180E!         AND       @_ClkCfgRegs+14,#0xfffd ; [CPU_] |696| 
         000002fd FFFD 
    2068                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xD/v170/F2837xD_common/source/F2837xD_SysCtrl.c"
    2069 000002fe 180E!         AND       @_ClkCfgRegs+14,#0xfffe ; [CPU_] |697| 
         000002ff FFFE 
    2070 00000300 761A   EDIS
    2071 00000301 7621   IDLE
    2072 00000302 FF69          SPM       #0                    ; [CPU_] 
    2073              $C$DW$88        .dwtag  DW_TAG_TI_branch
    2074                      .dwattr $C$DW$88, DW_AT_low_pc(0x00)
    2075                      .dwattr $C$DW$88, DW_AT_TI_return
    2076              
    2077 00000303 0006          LRETR     ; [CPU_] 
    2078                      ; return occurs ; [] 
    2079                      .dwattr $C$DW$86, DW_AT_TI_end_file("C:/ti/controlSUITE/device_support/F2837xD/v170/F2837xD_common/so
    2080                      .dwattr $C$DW$86, DW_AT_TI_end_line(0x2bd)
    2081                      .dwattr $C$DW$86, DW_AT_TI_end_column(0x01)
    2082                      .dwendentry
    2083                      .dwendtag $C$DW$86
    2084              
    2085              ;**************************************************************
    2086              ;* UNDEFINED EXTERNAL REFERENCES                              *
    2087              ;**************************************************************
    2088                      .global _F28x_usDelay
    2089                      .global _GPIO_EnableUnbondedIOPullups
    2090                      .global _RamfuncsLoadStart
    2091                      .global _RamfuncsLoadSize
    2092                      .global _RamfuncsRunStart
    2093                      .global _DcsmZ1Regs
    2094                      .global _DcsmZ2Regs
    2095                      .global _Flash0EccRegs
    2096                      .global _WdRegs
    2097                      .global _ClkCfgRegs
    2098                      .global _AnalogSubsysRegs
    2099                      .global _CpuSysRegs
    2100                      .global _DevCfgRegs
    2101                      .global _Flash0CtrlRegs
    2102                      .global _memcpy
    2103              
    2104              ;***************************************************************
    2105              ;* TYPE INFORMATION                                            *
    2106              ;***************************************************************
    2107              
    2108              $C$DW$T$25      .dwtag  DW_TAG_structure_type
    2109                      .dwattr $C$DW$T$25, DW_AT_name("ANALOG_SUBSYS_REGS")
    2110                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x48)
    2111              $C$DW$89        .dwtag  DW_TAG_member
    2112                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$20)
    2113                      .dwattr $C$DW$89, DW_AT_name("rsvd1")
    2114                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_rsvd1")
    2115                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v15.12.1 Sun Feb 26 22:57:13 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   43

    2116                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    2117              
    2118              $C$DW$90        .dwtag  DW_TAG_member
    2119                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$192)
    2120                      .dwattr $C$DW$90, DW_AT_name("INTOSC1TRIM")
    2121                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_INTOSC1TRIM")
    2122                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    2123                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    2124              
    2125              $C$DW$91        .dwtag  DW_TAG_member
    2126                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$194)
    2127                      .dwattr $C$DW$91, DW_AT_name("INTOSC2TRIM")
    2128                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_INTOSC2TRIM")
    2129                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    2130                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    2131              
    2132              $C$DW$92        .dwtag  DW_TAG_member
    2133                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$21)
    2134                      .dwattr $C$DW$92, DW_AT_name("rsvd2")
    2135                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_rsvd2")
    2136                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    2137                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    2138              
    2139              $C$DW$93        .dwtag  DW_TAG_member
    2140                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$292)
    2141                      .dwattr $C$DW$93, DW_AT_name("TSNSCTL")
    2142                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_TSNSCTL")
    2143                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    2144                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    2145              
    2146              $C$DW$94        .dwtag  DW_TAG_member
    2147                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$22)
    2148                      .dwattr $C$DW$94, DW_AT_name("rsvd3")
    2149                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_rsvd3")
    2150                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
    2151                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    2152              
    2153              $C$DW$95        .dwtag  DW_TAG_member
    2154                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$198)
    2155                      .dwattr $C$DW$95, DW_AT_name("LOCK")
    2156                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_LOCK")
    2157                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    2158                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    2159              
    2160              $C$DW$96        .dwtag  DW_TAG_member
    2161                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$23)
    2162                      .dwattr $C$DW$96, DW_AT_name("rsvd4")
    2163                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_rsvd4")
    2164                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    2165                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    2166              
    2167              $C$DW$97        .dwtag  DW_TAG_member
    2168                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$28)
    2169                      .dwattr $C$DW$97, DW_AT_name("ANAREFTRIMA")
    2170                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_ANAREFTRIMA")
TMS320C2000 Assembler PC v15.12.1 Sun Feb 26 22:57:13 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   44

    2171                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    2172                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    2173              
    2174              $C$DW$98        .dwtag  DW_TAG_member
    2175                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$30)
    2176                      .dwattr $C$DW$98, DW_AT_name("ANAREFTRIMB")
    2177                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_ANAREFTRIMB")
    2178                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    2179                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    2180              
    2181              $C$DW$99        .dwtag  DW_TAG_member
    2182                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$32)
    2183                      .dwattr $C$DW$99, DW_AT_name("ANAREFTRIMC")
    2184                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_ANAREFTRIMC")
    2185                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    2186                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    2187              
    2188              $C$DW$100       .dwtag  DW_TAG_member
    2189                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$34)
    2190                      .dwattr $C$DW$100, DW_AT_name("ANAREFTRIMD")
    2191                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_ANAREFTRIMD")
    2192                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    2193                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    2194              
    2195              $C$DW$101       .dwtag  DW_TAG_member
    2196                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$24)
    2197                      .dwattr $C$DW$101, DW_AT_name("rsvd5")
    2198                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_rsvd5")
    2199                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
    2200                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    2201              
    2202                      .dwendtag $C$DW$T$25
    2203              
    2204              $C$DW$102       .dwtag  DW_TAG_TI_far_type
    2205                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$25)
    2206              
    2207              $C$DW$T$340     .dwtag  DW_TAG_volatile_type
    2208                      .dwattr $C$DW$T$340, DW_AT_type(*$C$DW$102)
    2209              
    2210              
    2211              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    2212                      .dwattr $C$DW$T$26, DW_AT_name("ANAREFTRIMA_BITS")
    2213                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x02)
    2214              $C$DW$103       .dwtag  DW_TAG_member
    2215                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$19)
    2216                      .dwattr $C$DW$103, DW_AT_name("BGVALTRIM")
    2217                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_BGVALTRIM")
    2218                      .dwattr $C$DW$103, DW_AT_bit_offset(0x0a)
    2219                      .dwattr $C$DW$103, DW_AT_bit_size(0x06)
    2220                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2221                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    2222              
    2223              $C$DW$104       .dwtag  DW_TAG_member
    2224                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$19)
    2225                      .dwattr $C$DW$104, DW_AT_name("BGSLOPETRIM")
TMS320C2000 Assembler PC v15.12.1 Sun Feb 26 22:57:13 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   45

    2226                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_BGSLOPETRIM")
    2227                      .dwattr $C$DW$104, DW_AT_bit_offset(0x05)
    2228                      .dwattr $C$DW$104, DW_AT_bit_size(0x05)
    2229                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2230                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    2231              
    2232              $C$DW$105       .dwtag  DW_TAG_member
    2233                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$19)
    2234                      .dwattr $C$DW$105, DW_AT_name("IREFTRIM")
    2235                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_IREFTRIM")
    2236                      .dwattr $C$DW$105, DW_AT_bit_offset(0x00)
    2237                      .dwattr $C$DW$105, DW_AT_bit_size(0x05)
    2238                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2239                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    2240              
    2241              $C$DW$106       .dwtag  DW_TAG_member
    2242                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$19)
    2243                      .dwattr $C$DW$106, DW_AT_name("rsvd1")
    2244                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_rsvd1")
    2245                      .dwattr $C$DW$106, DW_AT_bit_offset(0x08)
    2246                      .dwattr $C$DW$106, DW_AT_bit_size(0x08)
    2247                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2248                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    2249              
    2250              $C$DW$107       .dwtag  DW_TAG_member
    2251                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$19)
    2252                      .dwattr $C$DW$107, DW_AT_name("rsvd2")
    2253                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_rsvd2")
    2254                      .dwattr $C$DW$107, DW_AT_bit_offset(0x00)
    2255                      .dwattr $C$DW$107, DW_AT_bit_size(0x08)
    2256                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2257                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    2258              
    2259                      .dwendtag $C$DW$T$26
    2260              
    2261              
    2262              $C$DW$T$28      .dwtag  DW_TAG_union_type
    2263                      .dwattr $C$DW$T$28, DW_AT_name("ANAREFTRIMA_REG")
    2264                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x02)
    2265              $C$DW$108       .dwtag  DW_TAG_member
    2266                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$27)
    2267                      .dwattr $C$DW$108, DW_AT_name("all")
    2268                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_all")
    2269                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2270                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    2271              
    2272              $C$DW$109       .dwtag  DW_TAG_member
    2273                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$26)
    2274                      .dwattr $C$DW$109, DW_AT_name("bit")
    2275                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_bit")
    2276                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2277                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    2278              
    2279                      .dwendtag $C$DW$T$28
    2280              
TMS320C2000 Assembler PC v15.12.1 Sun Feb 26 22:57:13 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   46

    2281              
    2282              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    2283                      .dwattr $C$DW$T$29, DW_AT_name("ANAREFTRIMB_BITS")
    2284                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x02)
    2285              $C$DW$110       .dwtag  DW_TAG_member
    2286                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$19)
    2287                      .dwattr $C$DW$110, DW_AT_name("BGVALTRIM")
    2288                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_BGVALTRIM")
    2289                      .dwattr $C$DW$110, DW_AT_bit_offset(0x0a)
    2290                      .dwattr $C$DW$110, DW_AT_bit_size(0x06)
    2291                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2292                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    2293              
    2294              $C$DW$111       .dwtag  DW_TAG_member
    2295                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$19)
    2296                      .dwattr $C$DW$111, DW_AT_name("BGSLOPETRIM")
    2297                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_BGSLOPETRIM")
    2298                      .dwattr $C$DW$111, DW_AT_bit_offset(0x05)
    2299                      .dwattr $C$DW$111, DW_AT_bit_size(0x05)
    2300                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2301                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    2302              
    2303              $C$DW$112       .dwtag  DW_TAG_member
    2304                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$19)
    2305                      .dwattr $C$DW$112, DW_AT_name("IREFTRIM")
    2306                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_IREFTRIM")
    2307                      .dwattr $C$DW$112, DW_AT_bit_offset(0x00)
    2308                      .dwattr $C$DW$112, DW_AT_bit_size(0x05)
    2309                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2310                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    2311              
    2312              $C$DW$113       .dwtag  DW_TAG_member
    2313                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$19)
    2314                      .dwattr $C$DW$113, DW_AT_name("rsvd1")
    2315                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_rsvd1")
    2316                      .dwattr $C$DW$113, DW_AT_bit_offset(0x08)
    2317                      .dwattr $C$DW$113, DW_AT_bit_size(0x08)
    2318                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2319                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    2320              
    2321              $C$DW$114       .dwtag  DW_TAG_member
    2322                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$19)
    2323                      .dwattr $C$DW$114, DW_AT_name("rsvd2")
    2324                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_rsvd2")
    2325                      .dwattr $C$DW$114, DW_AT_bit_offset(0x00)
    2326                      .dwattr $C$DW$114, DW_AT_bit_size(0x08)
    2327                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2328                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    2329              
    2330                      .dwendtag $C$DW$T$29
    2331              
    2332              
    2333              $C$DW$T$30      .dwtag  DW_TAG_union_type
    2334                      .dwattr $C$DW$T$30, DW_AT_name("ANAREFTRIMB_REG")
    2335                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x02)
TMS320C2000 Assembler PC v15.12.1 Sun Feb 26 22:57:13 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   47

    2336              $C$DW$115       .dwtag  DW_TAG_member
    2337                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$27)
    2338                      .dwattr $C$DW$115, DW_AT_name("all")
    2339                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_all")
    2340                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2341                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    2342              
    2343              $C$DW$116       .dwtag  DW_TAG_member
    2344                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$29)
    2345                      .dwattr $C$DW$116, DW_AT_name("bit")
    2346                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_bit")
    2347                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2348                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    2349              
    2350                      .dwendtag $C$DW$T$30
    2351              
    2352              
    2353              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    2354                      .dwattr $C$DW$T$31, DW_AT_name("ANAREFTRIMC_BITS")
    2355                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x02)
    2356              $C$DW$117       .dwtag  DW_TAG_member
    2357                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$19)
    2358                      .dwattr $C$DW$117, DW_AT_name("BGVALTRIM")
    2359                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_BGVALTRIM")
    2360                      .dwattr $C$DW$117, DW_AT_bit_offset(0x0a)
    2361                      .dwattr $C$DW$117, DW_AT_bit_size(0x06)
    2362                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2363                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    2364              
    2365              $C$DW$118       .dwtag  DW_TAG_member
    2366                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$19)
    2367                      .dwattr $C$DW$118, DW_AT_name("BGSLOPETRIM")
    2368                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_BGSLOPETRIM")
    2369                      .dwattr $C$DW$118, DW_AT_bit_offset(0x05)
    2370                      .dwattr $C$DW$118, DW_AT_bit_size(0x05)
    2371                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2372                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    2373              
    2374              $C$DW$119       .dwtag  DW_TAG_member
    2375                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$19)
    2376                      .dwattr $C$DW$119, DW_AT_name("IREFTRIM")
    2377                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_IREFTRIM")
    2378                      .dwattr $C$DW$119, DW_AT_bit_offset(0x00)
    2379                      .dwattr $C$DW$119, DW_AT_bit_size(0x05)
    2380                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2381                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    2382              
    2383              $C$DW$120       .dwtag  DW_TAG_member
    2384                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$19)
    2385                      .dwattr $C$DW$120, DW_AT_name("rsvd1")
    2386                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_rsvd1")
    2387                      .dwattr $C$DW$120, DW_AT_bit_offset(0x08)
    2388                      .dwattr $C$DW$120, DW_AT_bit_size(0x08)
    2389                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2390                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.1 Sun Feb 26 22:57:13 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   48

    2391              
    2392              $C$DW$121       .dwtag  DW_TAG_member
    2393                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$19)
    2394                      .dwattr $C$DW$121, DW_AT_name("rsvd2")
    2395                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_rsvd2")
    2396                      .dwattr $C$DW$121, DW_AT_bit_offset(0x00)
    2397                      .dwattr $C$DW$121, DW_AT_bit_size(0x08)
    2398                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2399                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    2400              
    2401                      .dwendtag $C$DW$T$31
    2402              
    2403              
    2404              $C$DW$T$32      .dwtag  DW_TAG_union_type
    2405                      .dwattr $C$DW$T$32, DW_AT_name("ANAREFTRIMC_REG")
    2406                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x02)
    2407              $C$DW$122       .dwtag  DW_TAG_member
    2408                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$27)
    2409                      .dwattr $C$DW$122, DW_AT_name("all")
    2410                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_all")
    2411                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2412                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    2413              
    2414              $C$DW$123       .dwtag  DW_TAG_member
    2415                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$31)
    2416                      .dwattr $C$DW$123, DW_AT_name("bit")
    2417                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_bit")
    2418                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2419                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    2420              
    2421                      .dwendtag $C$DW$T$32
    2422              
    2423              
    2424              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    2425                      .dwattr $C$DW$T$33, DW_AT_name("ANAREFTRIMD_BITS")
    2426                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x02)
    2427              $C$DW$124       .dwtag  DW_TAG_member
    2428                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$19)
    2429                      .dwattr $C$DW$124, DW_AT_name("BGVALTRIM")
    2430                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_BGVALTRIM")
    2431                      .dwattr $C$DW$124, DW_AT_bit_offset(0x0a)
    2432                      .dwattr $C$DW$124, DW_AT_bit_size(0x06)
    2433                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2434                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    2435              
    2436              $C$DW$125       .dwtag  DW_TAG_member
    2437                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$19)
    2438                      .dwattr $C$DW$125, DW_AT_name("BGSLOPETRIM")
    2439                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_BGSLOPETRIM")
    2440                      .dwattr $C$DW$125, DW_AT_bit_offset(0x05)
    2441                      .dwattr $C$DW$125, DW_AT_bit_size(0x05)
    2442                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2443                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    2444              
    2445              $C$DW$126       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v15.12.1 Sun Feb 26 22:57:13 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   49

    2446                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$19)
    2447                      .dwattr $C$DW$126, DW_AT_name("IREFTRIM")
    2448                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_IREFTRIM")
    2449                      .dwattr $C$DW$126, DW_AT_bit_offset(0x00)
    2450                      .dwattr $C$DW$126, DW_AT_bit_size(0x05)
    2451                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2452                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    2453              
    2454              $C$DW$127       .dwtag  DW_TAG_member
    2455                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$19)
    2456                      .dwattr $C$DW$127, DW_AT_name("rsvd1")
    2457                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_rsvd1")
    2458                      .dwattr $C$DW$127, DW_AT_bit_offset(0x08)
    2459                      .dwattr $C$DW$127, DW_AT_bit_size(0x08)
    2460                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2461                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    2462              
    2463              $C$DW$128       .dwtag  DW_TAG_member
    2464                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$19)
    2465                      .dwattr $C$DW$128, DW_AT_name("rsvd2")
    2466                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_rsvd2")
    2467                      .dwattr $C$DW$128, DW_AT_bit_offset(0x00)
    2468                      .dwattr $C$DW$128, DW_AT_bit_size(0x08)
    2469                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2470                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    2471              
    2472                      .dwendtag $C$DW$T$33
    2473              
    2474              
    2475              $C$DW$T$34      .dwtag  DW_TAG_union_type
    2476                      .dwattr $C$DW$T$34, DW_AT_name("ANAREFTRIMD_REG")
    2477                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x02)
    2478              $C$DW$129       .dwtag  DW_TAG_member
    2479                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$27)
    2480                      .dwattr $C$DW$129, DW_AT_name("all")
    2481                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_all")
    2482                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2483                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    2484              
    2485              $C$DW$130       .dwtag  DW_TAG_member
    2486                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$33)
    2487                      .dwattr $C$DW$130, DW_AT_name("bit")
    2488                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_bit")
    2489                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2490                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    2491              
    2492                      .dwendtag $C$DW$T$34
    2493              
    2494              
    2495              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    2496                      .dwattr $C$DW$T$35, DW_AT_name("AUXCLKDIVSEL_BITS")
    2497                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x02)
    2498              $C$DW$131       .dwtag  DW_TAG_member
    2499                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$19)
    2500                      .dwattr $C$DW$131, DW_AT_name("AUXPLLDIV")
TMS320C2000 Assembler PC v15.12.1 Sun Feb 26 22:57:13 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   50

    2501                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_AUXPLLDIV")
    2502                      .dwattr $C$DW$131, DW_AT_bit_offset(0x0e)
    2503                      .dwattr $C$DW$131, DW_AT_bit_size(0x02)
    2504                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2505                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    2506              
    2507              $C$DW$132       .dwtag  DW_TAG_member
    2508                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$19)
    2509                      .dwattr $C$DW$132, DW_AT_name("rsvd1")
    2510                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_rsvd1")
    2511                      .dwattr $C$DW$132, DW_AT_bit_offset(0x00)
    2512                      .dwattr $C$DW$132, DW_AT_bit_size(0x0e)
    2513                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2514                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    2515              
    2516              $C$DW$133       .dwtag  DW_TAG_member
    2517                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$19)
    2518                      .dwattr $C$DW$133, DW_AT_name("rsvd2")
    2519                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_rsvd2")
    2520                      .dwattr $C$DW$133, DW_AT_bit_offset(0x00)
    2521                      .dwattr $C$DW$133, DW_AT_bit_size(0x10)
    2522                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2523                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    2524              
    2525                      .dwendtag $C$DW$T$35
    2526              
    2527              
    2528              $C$DW$T$36      .dwtag  DW_TAG_union_type
    2529                      .dwattr $C$DW$T$36, DW_AT_name("AUXCLKDIVSEL_REG")
    2530                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x02)
    2531              $C$DW$134       .dwtag  DW_TAG_member
    2532                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$27)
    2533                      .dwattr $C$DW$134, DW_AT_name("all")
    2534                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_all")
    2535                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2536                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    2537              
    2538              $C$DW$135       .dwtag  DW_TAG_member
    2539                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$35)
    2540                      .dwattr $C$DW$135, DW_AT_name("bit")
    2541                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_bit")
    2542                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2543                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    2544              
    2545                      .dwendtag $C$DW$T$36
    2546              
    2547              
    2548              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    2549                      .dwattr $C$DW$T$37, DW_AT_name("AUXPLLCTL1_BITS")
    2550                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x02)
    2551              $C$DW$136       .dwtag  DW_TAG_member
    2552                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$19)
    2553                      .dwattr $C$DW$136, DW_AT_name("PLLEN")
    2554                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_PLLEN")
    2555                      .dwattr $C$DW$136, DW_AT_bit_offset(0x0f)
TMS320C2000 Assembler PC v15.12.1 Sun Feb 26 22:57:13 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   51

    2556                      .dwattr $C$DW$136, DW_AT_bit_size(0x01)
    2557                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2558                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    2559              
    2560              $C$DW$137       .dwtag  DW_TAG_member
    2561                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$19)
    2562                      .dwattr $C$DW$137, DW_AT_name("PLLCLKEN")
    2563                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_PLLCLKEN")
    2564                      .dwattr $C$DW$137, DW_AT_bit_offset(0x0e)
    2565                      .dwattr $C$DW$137, DW_AT_bit_size(0x01)
    2566                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2567                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    2568              
    2569              $C$DW$138       .dwtag  DW_TAG_member
    2570                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$19)
    2571                      .dwattr $C$DW$138, DW_AT_name("rsvd1")
    2572                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_rsvd1")
    2573                      .dwattr $C$DW$138, DW_AT_bit_offset(0x00)
    2574                      .dwattr $C$DW$138, DW_AT_bit_size(0x0e)
    2575                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2576                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    2577              
    2578              $C$DW$139       .dwtag  DW_TAG_member
    2579                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$19)
    2580                      .dwattr $C$DW$139, DW_AT_name("rsvd2")
    2581                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_rsvd2")
    2582                      .dwattr $C$DW$139, DW_AT_bit_offset(0x00)
    2583                      .dwattr $C$DW$139, DW_AT_bit_size(0x10)
    2584                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2585                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    2586              
    2587                      .dwendtag $C$DW$T$37
    2588              
    2589              
    2590              $C$DW$T$38      .dwtag  DW_TAG_union_type
    2591                      .dwattr $C$DW$T$38, DW_AT_name("AUXPLLCTL1_REG")
    2592                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x02)
    2593              $C$DW$140       .dwtag  DW_TAG_member
    2594                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$27)
    2595                      .dwattr $C$DW$140, DW_AT_name("all")
    2596                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_all")
    2597                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2598                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    2599              
    2600              $C$DW$141       .dwtag  DW_TAG_member
    2601                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$37)
    2602                      .dwattr $C$DW$141, DW_AT_name("bit")
    2603                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_bit")
    2604                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2605                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    2606              
    2607                      .dwendtag $C$DW$T$38
    2608              
    2609              
    2610              $C$DW$T$39      .dwtag  DW_TAG_structure_type
TMS320C2000 Assembler PC v15.12.1 Sun Feb 26 22:57:13 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   52

    2611                      .dwattr $C$DW$T$39, DW_AT_name("AUXPLLMULT_BITS")
    2612                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x02)
    2613              $C$DW$142       .dwtag  DW_TAG_member
    2614                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$19)
    2615                      .dwattr $C$DW$142, DW_AT_name("IMULT")
    2616                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_IMULT")
    2617                      .dwattr $C$DW$142, DW_AT_bit_offset(0x09)
    2618                      .dwattr $C$DW$142, DW_AT_bit_size(0x07)
    2619                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2620                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    2621              
    2622              $C$DW$143       .dwtag  DW_TAG_member
    2623                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$19)
    2624                      .dwattr $C$DW$143, DW_AT_name("rsvd1")
    2625                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_rsvd1")
    2626                      .dwattr $C$DW$143, DW_AT_bit_offset(0x08)
    2627                      .dwattr $C$DW$143, DW_AT_bit_size(0x01)
    2628                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2629                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    2630              
    2631              $C$DW$144       .dwtag  DW_TAG_member
    2632                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$19)
    2633                      .dwattr $C$DW$144, DW_AT_name("FMULT")
    2634                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_FMULT")
    2635                      .dwattr $C$DW$144, DW_AT_bit_offset(0x06)
    2636                      .dwattr $C$DW$144, DW_AT_bit_size(0x02)
    2637                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2638                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    2639              
    2640              $C$DW$145       .dwtag  DW_TAG_member
    2641                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$19)
    2642                      .dwattr $C$DW$145, DW_AT_name("rsvd2")
    2643                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_rsvd2")
    2644                      .dwattr $C$DW$145, DW_AT_bit_offset(0x00)
    2645                      .dwattr $C$DW$145, DW_AT_bit_size(0x06)
    2646                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2647                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    2648              
    2649              $C$DW$146       .dwtag  DW_TAG_member
    2650                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$19)
    2651                      .dwattr $C$DW$146, DW_AT_name("rsvd3")
    2652                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_rsvd3")
    2653                      .dwattr $C$DW$146, DW_AT_bit_offset(0x00)
    2654                      .dwattr $C$DW$146, DW_AT_bit_size(0x10)
    2655                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2656                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    2657              
    2658                      .dwendtag $C$DW$T$39
    2659              
    2660              
    2661              $C$DW$T$40      .dwtag  DW_TAG_union_type
    2662                      .dwattr $C$DW$T$40, DW_AT_name("AUXPLLMULT_REG")
    2663                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x02)
    2664              $C$DW$147       .dwtag  DW_TAG_member
    2665                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$27)
TMS320C2000 Assembler PC v15.12.1 Sun Feb 26 22:57:13 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   53

    2666                      .dwattr $C$DW$147, DW_AT_name("all")
    2667                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_all")
    2668                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2669                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    2670              
    2671              $C$DW$148       .dwtag  DW_TAG_member
    2672                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$39)
    2673                      .dwattr $C$DW$148, DW_AT_name("bit")
    2674                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_bit")
    2675                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2676                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    2677              
    2678                      .dwendtag $C$DW$T$40
    2679              
    2680              
    2681              $C$DW$T$41      .dwtag  DW_TAG_structure_type
    2682                      .dwattr $C$DW$T$41, DW_AT_name("AUXPLLSTS_BITS")
    2683                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x02)
    2684              $C$DW$149       .dwtag  DW_TAG_member
    2685                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$19)
    2686                      .dwattr $C$DW$149, DW_AT_name("LOCKS")
    2687                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_LOCKS")
    2688                      .dwattr $C$DW$149, DW_AT_bit_offset(0x0f)
    2689                      .dwattr $C$DW$149, DW_AT_bit_size(0x01)
    2690                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2691                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    2692              
    2693              $C$DW$150       .dwtag  DW_TAG_member
    2694                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$19)
    2695                      .dwattr $C$DW$150, DW_AT_name("SLIPS")
    2696                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_SLIPS")
    2697                      .dwattr $C$DW$150, DW_AT_bit_offset(0x0e)
    2698                      .dwattr $C$DW$150, DW_AT_bit_size(0x01)
    2699                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2700                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    2701              
    2702              $C$DW$151       .dwtag  DW_TAG_member
    2703                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$19)
    2704                      .dwattr $C$DW$151, DW_AT_name("rsvd1")
    2705                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_rsvd1")
    2706                      .dwattr $C$DW$151, DW_AT_bit_offset(0x00)
    2707                      .dwattr $C$DW$151, DW_AT_bit_size(0x0e)
    2708                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2709                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    2710              
    2711              $C$DW$152       .dwtag  DW_TAG_member
    2712                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$19)
    2713                      .dwattr $C$DW$152, DW_AT_name("rsvd2")
    2714                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_rsvd2")
    2715                      .dwattr $C$DW$152, DW_AT_bit_offset(0x00)
    2716                      .dwattr $C$DW$152, DW_AT_bit_size(0x10)
    2717                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2718                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    2719              
    2720                      .dwendtag $C$DW$T$41
TMS320C2000 Assembler PC v15.12.1 Sun Feb 26 22:57:13 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   54

    2721              
    2722              
    2723              $C$DW$T$42      .dwtag  DW_TAG_union_type
    2724                      .dwattr $C$DW$T$42, DW_AT_name("AUXPLLSTS_REG")
    2725                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x02)
    2726              $C$DW$153       .dwtag  DW_TAG_member
    2727                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$27)
    2728                      .dwattr $C$DW$153, DW_AT_name("all")
    2729                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_all")
    2730                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2731                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    2732              
    2733              $C$DW$154       .dwtag  DW_TAG_member
    2734                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$41)
    2735                      .dwattr $C$DW$154, DW_AT_name("bit")
    2736                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_bit")
    2737                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2738                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    2739              
    2740                      .dwendtag $C$DW$T$42
    2741              
    2742              
    2743              $C$DW$T$43      .dwtag  DW_TAG_structure_type
    2744                      .dwattr $C$DW$T$43, DW_AT_name("CLKCFGLOCK1_BITS")
    2745                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x02)
    2746              $C$DW$155       .dwtag  DW_TAG_member
    2747                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$19)
    2748                      .dwattr $C$DW$155, DW_AT_name("CLKSRCCTL1")
    2749                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_CLKSRCCTL1")
    2750                      .dwattr $C$DW$155, DW_AT_bit_offset(0x0f)
    2751                      .dwattr $C$DW$155, DW_AT_bit_size(0x01)
    2752                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2753                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    2754              
    2755              $C$DW$156       .dwtag  DW_TAG_member
    2756                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$19)
    2757                      .dwattr $C$DW$156, DW_AT_name("CLKSRCCTL2")
    2758                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_CLKSRCCTL2")
    2759                      .dwattr $C$DW$156, DW_AT_bit_offset(0x0e)
    2760                      .dwattr $C$DW$156, DW_AT_bit_size(0x01)
    2761                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2762                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    2763              
    2764              $C$DW$157       .dwtag  DW_TAG_member
    2765                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$19)
    2766                      .dwattr $C$DW$157, DW_AT_name("CLKSRCCTL3")
    2767                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_CLKSRCCTL3")
    2768                      .dwattr $C$DW$157, DW_AT_bit_offset(0x0d)
    2769                      .dwattr $C$DW$157, DW_AT_bit_size(0x01)
    2770                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2771                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    2772              
    2773              $C$DW$158       .dwtag  DW_TAG_member
    2774                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$19)
    2775                      .dwattr $C$DW$158, DW_AT_name("SYSPLLCTL1")
TMS320C2000 Assembler PC v15.12.1 Sun Feb 26 22:57:13 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   55

    2776                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_SYSPLLCTL1")
    2777                      .dwattr $C$DW$158, DW_AT_bit_offset(0x0c)
    2778                      .dwattr $C$DW$158, DW_AT_bit_size(0x01)
    2779                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2780                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    2781              
    2782              $C$DW$159       .dwtag  DW_TAG_member
    2783                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$19)
    2784                      .dwattr $C$DW$159, DW_AT_name("SYSPLLCTL2")
    2785                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_SYSPLLCTL2")
    2786                      .dwattr $C$DW$159, DW_AT_bit_offset(0x0b)
    2787                      .dwattr $C$DW$159, DW_AT_bit_size(0x01)
    2788                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2789                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    2790              
    2791              $C$DW$160       .dwtag  DW_TAG_member
    2792                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$19)
    2793                      .dwattr $C$DW$160, DW_AT_name("SYSPLLCTL3")
    2794                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_SYSPLLCTL3")
    2795                      .dwattr $C$DW$160, DW_AT_bit_offset(0x0a)
    2796                      .dwattr $C$DW$160, DW_AT_bit_size(0x01)
    2797                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2798                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    2799              
    2800              $C$DW$161       .dwtag  DW_TAG_member
    2801                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$19)
    2802                      .dwattr $C$DW$161, DW_AT_name("SYSPLLMULT")
    2803                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_SYSPLLMULT")
    2804                      .dwattr $C$DW$161, DW_AT_bit_offset(0x09)
    2805                      .dwattr $C$DW$161, DW_AT_bit_size(0x01)
    2806                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2807                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    2808              
    2809              $C$DW$162       .dwtag  DW_TAG_member
    2810                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$19)
    2811                      .dwattr $C$DW$162, DW_AT_name("AUXPLLCTL1")
    2812                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_AUXPLLCTL1")
    2813                      .dwattr $C$DW$162, DW_AT_bit_offset(0x08)
    2814                      .dwattr $C$DW$162, DW_AT_bit_size(0x01)
    2815                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2816                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    2817              
    2818              $C$DW$163       .dwtag  DW_TAG_member
    2819                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$19)
    2820                      .dwattr $C$DW$163, DW_AT_name("rsvd1")
    2821                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_rsvd1")
    2822                      .dwattr $C$DW$163, DW_AT_bit_offset(0x07)
    2823                      .dwattr $C$DW$163, DW_AT_bit_size(0x01)
    2824                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2825                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    2826              
    2827              $C$DW$164       .dwtag  DW_TAG_member
    2828                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$19)
    2829                      .dwattr $C$DW$164, DW_AT_name("rsvd2")
    2830                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_rsvd2")
TMS320C2000 Assembler PC v15.12.1 Sun Feb 26 22:57:13 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   56

    2831                      .dwattr $C$DW$164, DW_AT_bit_offset(0x06)
    2832                      .dwattr $C$DW$164, DW_AT_bit_size(0x01)
    2833                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2834                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    2835              
    2836              $C$DW$165       .dwtag  DW_TAG_member
    2837                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$19)
    2838                      .dwattr $C$DW$165, DW_AT_name("AUXPLLMULT")
    2839                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_AUXPLLMULT")
    2840                      .dwattr $C$DW$165, DW_AT_bit_offset(0x05)
    2841                      .dwattr $C$DW$165, DW_AT_bit_size(0x01)
    2842                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2843                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    2844              
    2845              $C$DW$166       .dwtag  DW_TAG_member
    2846                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$19)
    2847                      .dwattr $C$DW$166, DW_AT_name("SYSCLKDIVSEL")
    2848                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_SYSCLKDIVSEL")
    2849                      .dwattr $C$DW$166, DW_AT_bit_offset(0x04)
    2850                      .dwattr $C$DW$166, DW_AT_bit_size(0x01)
    2851                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2852                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    2853              
    2854              $C$DW$167       .dwtag  DW_TAG_member
    2855                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$19)
    2856                      .dwattr $C$DW$167, DW_AT_name("AUXCLKDIVSEL")
    2857                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_AUXCLKDIVSEL")
    2858                      .dwattr $C$DW$167, DW_AT_bit_offset(0x03)
    2859                      .dwattr $C$DW$167, DW_AT_bit_size(0x01)
    2860                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2861                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    2862              
    2863              $C$DW$168       .dwtag  DW_TAG_member
    2864                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$19)
    2865                      .dwattr $C$DW$168, DW_AT_name("PERCLKDIVSEL")
    2866                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_PERCLKDIVSEL")
    2867                      .dwattr $C$DW$168, DW_AT_bit_offset(0x02)
    2868                      .dwattr $C$DW$168, DW_AT_bit_size(0x01)
    2869                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2870                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    2871              
    2872              $C$DW$169       .dwtag  DW_TAG_member
    2873                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$19)
    2874                      .dwattr $C$DW$169, DW_AT_name("rsvd3")
    2875                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_rsvd3")
    2876                      .dwattr $C$DW$169, DW_AT_bit_offset(0x01)
    2877                      .dwattr $C$DW$169, DW_AT_bit_size(0x01)
    2878                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2879                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    2880              
    2881              $C$DW$170       .dwtag  DW_TAG_member
    2882                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$19)
    2883                      .dwattr $C$DW$170, DW_AT_name("LOSPCP")
    2884                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_LOSPCP")
    2885                      .dwattr $C$DW$170, DW_AT_bit_offset(0x00)
TMS320C2000 Assembler PC v15.12.1 Sun Feb 26 22:57:13 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   57

    2886                      .dwattr $C$DW$170, DW_AT_bit_size(0x01)
    2887                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2888                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    2889              
    2890              $C$DW$171       .dwtag  DW_TAG_member
    2891                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$19)
    2892                      .dwattr $C$DW$171, DW_AT_name("rsvd4")
    2893                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_rsvd4")
    2894                      .dwattr $C$DW$171, DW_AT_bit_offset(0x00)
    2895                      .dwattr $C$DW$171, DW_AT_bit_size(0x10)
    2896                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2897                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    2898              
    2899                      .dwendtag $C$DW$T$43
    2900              
    2901              
    2902              $C$DW$T$44      .dwtag  DW_TAG_union_type
    2903                      .dwattr $C$DW$T$44, DW_AT_name("CLKCFGLOCK1_REG")
    2904                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x02)
    2905              $C$DW$172       .dwtag  DW_TAG_member
    2906                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$27)
    2907                      .dwattr $C$DW$172, DW_AT_name("all")
    2908                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_all")
    2909                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2910                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    2911              
    2912              $C$DW$173       .dwtag  DW_TAG_member
    2913                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$43)
    2914                      .dwattr $C$DW$173, DW_AT_name("bit")
    2915                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_bit")
    2916                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2917                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    2918              
    2919                      .dwendtag $C$DW$T$44
    2920              
    2921              
    2922              $C$DW$T$45      .dwtag  DW_TAG_structure_type
    2923                      .dwattr $C$DW$T$45, DW_AT_name("CLKSEM_BITS")
    2924                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x02)
    2925              $C$DW$174       .dwtag  DW_TAG_member
    2926                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$19)
    2927                      .dwattr $C$DW$174, DW_AT_name("SEM")
    2928                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_SEM")
    2929                      .dwattr $C$DW$174, DW_AT_bit_offset(0x0e)
    2930                      .dwattr $C$DW$174, DW_AT_bit_size(0x02)
    2931                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2932                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    2933              
    2934              $C$DW$175       .dwtag  DW_TAG_member
    2935                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$19)
    2936                      .dwattr $C$DW$175, DW_AT_name("rsvd1")
    2937                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_rsvd1")
    2938                      .dwattr $C$DW$175, DW_AT_bit_offset(0x00)
    2939                      .dwattr $C$DW$175, DW_AT_bit_size(0x0e)
    2940                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v15.12.1 Sun Feb 26 22:57:13 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   58

    2941                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    2942              
    2943              $C$DW$176       .dwtag  DW_TAG_member
    2944                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$19)
    2945                      .dwattr $C$DW$176, DW_AT_name("KEY")
    2946                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_KEY")
    2947                      .dwattr $C$DW$176, DW_AT_bit_offset(0x00)
    2948                      .dwattr $C$DW$176, DW_AT_bit_size(0x10)
    2949                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2950                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    2951              
    2952                      .dwendtag $C$DW$T$45
    2953              
    2954              
    2955              $C$DW$T$46      .dwtag  DW_TAG_union_type
    2956                      .dwattr $C$DW$T$46, DW_AT_name("CLKSEM_REG")
    2957                      .dwattr $C$DW$T$46, DW_AT_byte_size(0x02)
    2958              $C$DW$177       .dwtag  DW_TAG_member
    2959                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$27)
    2960                      .dwattr $C$DW$177, DW_AT_name("all")
    2961                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_all")
    2962                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2963                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    2964              
    2965              $C$DW$178       .dwtag  DW_TAG_member
    2966                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$45)
    2967                      .dwattr $C$DW$178, DW_AT_name("bit")
    2968                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_bit")
    2969                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2970                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    2971              
    2972                      .dwendtag $C$DW$T$46
    2973              
    2974              
    2975              $C$DW$T$47      .dwtag  DW_TAG_structure_type
    2976                      .dwattr $C$DW$T$47, DW_AT_name("CLKSRCCTL1_BITS")
    2977                      .dwattr $C$DW$T$47, DW_AT_byte_size(0x02)
    2978              $C$DW$179       .dwtag  DW_TAG_member
    2979                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$19)
    2980                      .dwattr $C$DW$179, DW_AT_name("OSCCLKSRCSEL")
    2981                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_OSCCLKSRCSEL")
    2982                      .dwattr $C$DW$179, DW_AT_bit_offset(0x0e)
    2983                      .dwattr $C$DW$179, DW_AT_bit_size(0x02)
    2984                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2985                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    2986              
    2987              $C$DW$180       .dwtag  DW_TAG_member
    2988                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$19)
    2989                      .dwattr $C$DW$180, DW_AT_name("rsvd1")
    2990                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_rsvd1")
    2991                      .dwattr $C$DW$180, DW_AT_bit_offset(0x0d)
    2992                      .dwattr $C$DW$180, DW_AT_bit_size(0x01)
    2993                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2994                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    2995              
TMS320C2000 Assembler PC v15.12.1 Sun Feb 26 22:57:13 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   59

    2996              $C$DW$181       .dwtag  DW_TAG_member
    2997                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$19)
    2998                      .dwattr $C$DW$181, DW_AT_name("INTOSC2OFF")
    2999                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_INTOSC2OFF")
    3000                      .dwattr $C$DW$181, DW_AT_bit_offset(0x0c)
    3001                      .dwattr $C$DW$181, DW_AT_bit_size(0x01)
    3002                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3003                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    3004              
    3005              $C$DW$182       .dwtag  DW_TAG_member
    3006                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$19)
    3007                      .dwattr $C$DW$182, DW_AT_name("XTALOFF")
    3008                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_XTALOFF")
    3009                      .dwattr $C$DW$182, DW_AT_bit_offset(0x0b)
    3010                      .dwattr $C$DW$182, DW_AT_bit_size(0x01)
    3011                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3012                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    3013              
    3014              $C$DW$183       .dwtag  DW_TAG_member
    3015                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$19)
    3016                      .dwattr $C$DW$183, DW_AT_name("WDHALTI")
    3017                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_WDHALTI")
    3018                      .dwattr $C$DW$183, DW_AT_bit_offset(0x0a)
    3019                      .dwattr $C$DW$183, DW_AT_bit_size(0x01)
    3020                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3021                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    3022              
    3023              $C$DW$184       .dwtag  DW_TAG_member
    3024                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$19)
    3025                      .dwattr $C$DW$184, DW_AT_name("rsvd2")
    3026                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_rsvd2")
    3027                      .dwattr $C$DW$184, DW_AT_bit_offset(0x00)
    3028                      .dwattr $C$DW$184, DW_AT_bit_size(0x0a)
    3029                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3030                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    3031              
    3032              $C$DW$185       .dwtag  DW_TAG_member
    3033                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$19)
    3034                      .dwattr $C$DW$185, DW_AT_name("rsvd3")
    3035                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_rsvd3")
    3036                      .dwattr $C$DW$185, DW_AT_bit_offset(0x00)
    3037                      .dwattr $C$DW$185, DW_AT_bit_size(0x10)
    3038                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3039                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    3040              
    3041                      .dwendtag $C$DW$T$47
    3042              
    3043              
    3044              $C$DW$T$48      .dwtag  DW_TAG_union_type
    3045                      .dwattr $C$DW$T$48, DW_AT_name("CLKSRCCTL1_REG")
    3046                      .dwattr $C$DW$T$48, DW_AT_byte_size(0x02)
    3047              $C$DW$186       .dwtag  DW_TAG_member
    3048                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$27)
    3049                      .dwattr $C$DW$186, DW_AT_name("all")
    3050                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_all")
TMS320C2000 Assembler PC v15.12.1 Sun Feb 26 22:57:13 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   60

    3051                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3052                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    3053              
    3054              $C$DW$187       .dwtag  DW_TAG_member
    3055                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$47)
    3056                      .dwattr $C$DW$187, DW_AT_name("bit")
    3057                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_bit")
    3058                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3059                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    3060              
    3061                      .dwendtag $C$DW$T$48
    3062              
    3063              
    3064              $C$DW$T$49      .dwtag  DW_TAG_structure_type
    3065                      .dwattr $C$DW$T$49, DW_AT_name("CLKSRCCTL2_BITS")
    3066                      .dwattr $C$DW$T$49, DW_AT_byte_size(0x02)
    3067              $C$DW$188       .dwtag  DW_TAG_member
    3068                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$19)
    3069                      .dwattr $C$DW$188, DW_AT_name("AUXOSCCLKSRCSEL")
    3070                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_AUXOSCCLKSRCSEL")
    3071                      .dwattr $C$DW$188, DW_AT_bit_offset(0x0e)
    3072                      .dwattr $C$DW$188, DW_AT_bit_size(0x02)
    3073                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3074                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    3075              
    3076              $C$DW$189       .dwtag  DW_TAG_member
    3077                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$19)
    3078                      .dwattr $C$DW$189, DW_AT_name("CANABCLKSEL")
    3079                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_CANABCLKSEL")
    3080                      .dwattr $C$DW$189, DW_AT_bit_offset(0x0c)
    3081                      .dwattr $C$DW$189, DW_AT_bit_size(0x02)
    3082                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3083                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    3084              
    3085              $C$DW$190       .dwtag  DW_TAG_member
    3086                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$19)
    3087                      .dwattr $C$DW$190, DW_AT_name("CANBBCLKSEL")
    3088                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_CANBBCLKSEL")
    3089                      .dwattr $C$DW$190, DW_AT_bit_offset(0x0a)
    3090                      .dwattr $C$DW$190, DW_AT_bit_size(0x02)
    3091                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3092                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    3093              
    3094              $C$DW$191       .dwtag  DW_TAG_member
    3095                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$19)
    3096                      .dwattr $C$DW$191, DW_AT_name("rsvd1")
    3097                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_rsvd1")
    3098                      .dwattr $C$DW$191, DW_AT_bit_offset(0x08)
    3099                      .dwattr $C$DW$191, DW_AT_bit_size(0x02)
    3100                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3101                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    3102              
    3103              $C$DW$192       .dwtag  DW_TAG_member
    3104                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$19)
    3105                      .dwattr $C$DW$192, DW_AT_name("rsvd2")
TMS320C2000 Assembler PC v15.12.1 Sun Feb 26 22:57:13 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   61

    3106                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_rsvd2")
    3107                      .dwattr $C$DW$192, DW_AT_bit_offset(0x06)
    3108                      .dwattr $C$DW$192, DW_AT_bit_size(0x02)
    3109                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3110                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    3111              
    3112              $C$DW$193       .dwtag  DW_TAG_member
    3113                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$19)
    3114                      .dwattr $C$DW$193, DW_AT_name("rsvd3")
    3115                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_rsvd3")
    3116                      .dwattr $C$DW$193, DW_AT_bit_offset(0x00)
    3117                      .dwattr $C$DW$193, DW_AT_bit_size(0x06)
    3118                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3119                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    3120              
    3121              $C$DW$194       .dwtag  DW_TAG_member
    3122                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$19)
    3123                      .dwattr $C$DW$194, DW_AT_name("rsvd4")
    3124                      .dwattr $C$DW$194, DW_AT_TI_symbol_name("_rsvd4")
    3125                      .dwattr $C$DW$194, DW_AT_bit_offset(0x00)
    3126                      .dwattr $C$DW$194, DW_AT_bit_size(0x10)
    3127                      .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3128                      .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    3129              
    3130                      .dwendtag $C$DW$T$49
    3131              
    3132              
    3133              $C$DW$T$50      .dwtag  DW_TAG_union_type
    3134                      .dwattr $C$DW$T$50, DW_AT_name("CLKSRCCTL2_REG")
    3135                      .dwattr $C$DW$T$50, DW_AT_byte_size(0x02)
    3136              $C$DW$195       .dwtag  DW_TAG_member
    3137                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$27)
    3138                      .dwattr $C$DW$195, DW_AT_name("all")
    3139                      .dwattr $C$DW$195, DW_AT_TI_symbol_name("_all")
    3140                      .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3141                      .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    3142              
    3143              $C$DW$196       .dwtag  DW_TAG_member
    3144                      .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$49)
    3145                      .dwattr $C$DW$196, DW_AT_name("bit")
    3146                      .dwattr $C$DW$196, DW_AT_TI_symbol_name("_bit")
    3147                      .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3148                      .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    3149              
    3150                      .dwendtag $C$DW$T$50
    3151              
    3152              
    3153              $C$DW$T$51      .dwtag  DW_TAG_structure_type
    3154                      .dwattr $C$DW$T$51, DW_AT_name("CLKSRCCTL3_BITS")
    3155                      .dwattr $C$DW$T$51, DW_AT_byte_size(0x02)
    3156              $C$DW$197       .dwtag  DW_TAG_member
    3157                      .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$19)
    3158                      .dwattr $C$DW$197, DW_AT_name("XCLKOUTSEL")
    3159                      .dwattr $C$DW$197, DW_AT_TI_symbol_name("_XCLKOUTSEL")
    3160                      .dwattr $C$DW$197, DW_AT_bit_offset(0x0d)
TMS320C2000 Assembler PC v15.12.1 Sun Feb 26 22:57:13 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   62

    3161                      .dwattr $C$DW$197, DW_AT_bit_size(0x03)
    3162                      .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3163                      .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    3164              
    3165              $C$DW$198       .dwtag  DW_TAG_member
    3166                      .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$19)
    3167                      .dwattr $C$DW$198, DW_AT_name("rsvd1")
    3168                      .dwattr $C$DW$198, DW_AT_TI_symbol_name("_rsvd1")
    3169                      .dwattr $C$DW$198, DW_AT_bit_offset(0x00)
    3170                      .dwattr $C$DW$198, DW_AT_bit_size(0x0d)
    3171                      .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3172                      .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    3173              
    3174              $C$DW$199       .dwtag  DW_TAG_member
    3175                      .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$19)
    3176                      .dwattr $C$DW$199, DW_AT_name("rsvd2")
    3177                      .dwattr $C$DW$199, DW_AT_TI_symbol_name("_rsvd2")
    3178                      .dwattr $C$DW$199, DW_AT_bit_offset(0x00)
    3179                      .dwattr $C$DW$199, DW_AT_bit_size(0x10)
    3180                      .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3181                      .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    3182              
    3183                      .dwendtag $C$DW$T$51
    3184              
    3185              
    3186              $C$DW$T$52      .dwtag  DW_TAG_union_type
    3187                      .dwattr $C$DW$T$52, DW_AT_name("CLKSRCCTL3_REG")
    3188                      .dwattr $C$DW$T$52, DW_AT_byte_size(0x02)
    3189              $C$DW$200       .dwtag  DW_TAG_member
    3190                      .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$27)
    3191                      .dwattr $C$DW$200, DW_AT_name("all")
    3192                      .dwattr $C$DW$200, DW_AT_TI_symbol_name("_all")
    3193                      .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3194                      .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    3195              
    3196              $C$DW$201       .dwtag  DW_TAG_member
    3197                      .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$51)
    3198                      .dwattr $C$DW$201, DW_AT_name("bit")
    3199                      .dwattr $C$DW$201, DW_AT_TI_symbol_name("_bit")
    3200                      .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3201                      .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    3202              
    3203                      .dwendtag $C$DW$T$52
    3204              
    3205              
    3206              $C$DW$T$54      .dwtag  DW_TAG_structure_type
    3207                      .dwattr $C$DW$T$54, DW_AT_name("CLK_CFG_REGS")
    3208                      .dwattr $C$DW$T$54, DW_AT_byte_size(0x32)
    3209              $C$DW$202       .dwtag  DW_TAG_member
    3210                      .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$46)
    3211                      .dwattr $C$DW$202, DW_AT_name("CLKSEM")
    3212                      .dwattr $C$DW$202, DW_AT_TI_symbol_name("_CLKSEM")
    3213                      .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3214                      .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    3215              
TMS320C2000 Assembler PC v15.12.1 Sun Feb 26 22:57:13 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   63

    3216              $C$DW$203       .dwtag  DW_TAG_member
    3217                      .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$44)
    3218                      .dwattr $C$DW$203, DW_AT_name("CLKCFGLOCK1")
    3219                      .dwattr $C$DW$203, DW_AT_TI_symbol_name("_CLKCFGLOCK1")
    3220                      .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3221                      .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    3222              
    3223              $C$DW$204       .dwtag  DW_TAG_member
    3224                      .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$53)
    3225                      .dwattr $C$DW$204, DW_AT_name("rsvd1")
    3226                      .dwattr $C$DW$204, DW_AT_TI_symbol_name("_rsvd1")
    3227                      .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3228                      .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    3229              
    3230              $C$DW$205       .dwtag  DW_TAG_member
    3231                      .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$48)
    3232                      .dwattr $C$DW$205, DW_AT_name("CLKSRCCTL1")
    3233                      .dwattr $C$DW$205, DW_AT_TI_symbol_name("_CLKSRCCTL1")
    3234                      .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3235                      .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    3236              
    3237              $C$DW$206       .dwtag  DW_TAG_member
    3238                      .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$50)
    3239                      .dwattr $C$DW$206, DW_AT_name("CLKSRCCTL2")
    3240                      .dwattr $C$DW$206, DW_AT_TI_symbol_name("_CLKSRCCTL2")
    3241                      .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3242                      .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    3243              
    3244              $C$DW$207       .dwtag  DW_TAG_member
    3245                      .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$52)
    3246                      .dwattr $C$DW$207, DW_AT_name("CLKSRCCTL3")
    3247                      .dwattr $C$DW$207, DW_AT_TI_symbol_name("_CLKSRCCTL3")
    3248                      .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3249                      .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    3250              
    3251              $C$DW$208       .dwtag  DW_TAG_member
    3252                      .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$284)
    3253                      .dwattr $C$DW$208, DW_AT_name("SYSPLLCTL1")
    3254                      .dwattr $C$DW$208, DW_AT_TI_symbol_name("_SYSPLLCTL1")
    3255                      .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    3256                      .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    3257              
    3258              $C$DW$209       .dwtag  DW_TAG_member
    3259                      .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$53)
    3260                      .dwattr $C$DW$209, DW_AT_name("rsvd2")
    3261                      .dwattr $C$DW$209, DW_AT_TI_symbol_name("_rsvd2")
    3262                      .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3263                      .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    3264              
    3265              $C$DW$210       .dwtag  DW_TAG_member
    3266                      .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$286)
    3267                      .dwattr $C$DW$210, DW_AT_name("SYSPLLMULT")
    3268                      .dwattr $C$DW$210, DW_AT_TI_symbol_name("_SYSPLLMULT")
    3269                      .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3270                      .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.1 Sun Feb 26 22:57:13 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   64

    3271              
    3272              $C$DW$211       .dwtag  DW_TAG_member
    3273                      .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$288)
    3274                      .dwattr $C$DW$211, DW_AT_name("SYSPLLSTS")
    3275                      .dwattr $C$DW$211, DW_AT_TI_symbol_name("_SYSPLLSTS")
    3276                      .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    3277                      .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    3278              
    3279              $C$DW$212       .dwtag  DW_TAG_member
    3280                      .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$38)
    3281                      .dwattr $C$DW$212, DW_AT_name("AUXPLLCTL1")
    3282                      .dwattr $C$DW$212, DW_AT_TI_symbol_name("_AUXPLLCTL1")
    3283                      .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3284                      .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    3285              
    3286              $C$DW$213       .dwtag  DW_TAG_member
    3287                      .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$53)
    3288                      .dwattr $C$DW$213, DW_AT_name("rsvd3")
    3289                      .dwattr $C$DW$213, DW_AT_TI_symbol_name("_rsvd3")
    3290                      .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    3291                      .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    3292              
    3293              $C$DW$214       .dwtag  DW_TAG_member
    3294                      .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$40)
    3295                      .dwattr $C$DW$214, DW_AT_name("AUXPLLMULT")
    3296                      .dwattr $C$DW$214, DW_AT_TI_symbol_name("_AUXPLLMULT")
    3297                      .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    3298                      .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    3299              
    3300              $C$DW$215       .dwtag  DW_TAG_member
    3301                      .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$42)
    3302                      .dwattr $C$DW$215, DW_AT_name("AUXPLLSTS")
    3303                      .dwattr $C$DW$215, DW_AT_TI_symbol_name("_AUXPLLSTS")
    3304                      .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    3305                      .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    3306              
    3307              $C$DW$216       .dwtag  DW_TAG_member
    3308                      .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$282)
    3309                      .dwattr $C$DW$216, DW_AT_name("SYSCLKDIVSEL")
    3310                      .dwattr $C$DW$216, DW_AT_TI_symbol_name("_SYSCLKDIVSEL")
    3311                      .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    3312                      .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    3313              
    3314              $C$DW$217       .dwtag  DW_TAG_member
    3315                      .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$36)
    3316                      .dwattr $C$DW$217, DW_AT_name("AUXCLKDIVSEL")
    3317                      .dwattr $C$DW$217, DW_AT_TI_symbol_name("_AUXCLKDIVSEL")
    3318                      .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    3319                      .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    3320              
    3321              $C$DW$218       .dwtag  DW_TAG_member
    3322                      .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$242)
    3323                      .dwattr $C$DW$218, DW_AT_name("PERCLKDIVSEL")
    3324                      .dwattr $C$DW$218, DW_AT_TI_symbol_name("_PERCLKDIVSEL")
    3325                      .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
TMS320C2000 Assembler PC v15.12.1 Sun Feb 26 22:57:13 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   65

    3326                      .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
    3327              
    3328              $C$DW$219       .dwtag  DW_TAG_member
    3329                      .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$307)
    3330                      .dwattr $C$DW$219, DW_AT_name("XCLKOUTDIVSEL")
    3331                      .dwattr $C$DW$219, DW_AT_TI_symbol_name("_XCLKOUTDIVSEL")
    3332                      .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    3333                      .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    3334              
    3335              $C$DW$220       .dwtag  DW_TAG_member
    3336                      .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$21)
    3337                      .dwattr $C$DW$220, DW_AT_name("rsvd4")
    3338                      .dwattr $C$DW$220, DW_AT_TI_symbol_name("_rsvd4")
    3339                      .dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    3340                      .dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
    3341              
    3342              $C$DW$221       .dwtag  DW_TAG_member
    3343                      .dwattr $C$DW$221, DW_AT_type(*$C$DW$T$200)
    3344                      .dwattr $C$DW$221, DW_AT_name("LOSPCP")
    3345                      .dwattr $C$DW$221, DW_AT_TI_symbol_name("_LOSPCP")
    3346                      .dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    3347                      .dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
    3348              
    3349              $C$DW$222       .dwtag  DW_TAG_member
    3350                      .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$206)
    3351                      .dwattr $C$DW$222, DW_AT_name("MCDCR")
    3352                      .dwattr $C$DW$222, DW_AT_TI_symbol_name("_MCDCR")
    3353                      .dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    3354                      .dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
    3355              
    3356              $C$DW$223       .dwtag  DW_TAG_member
    3357                      .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$305)
    3358                      .dwattr $C$DW$223, DW_AT_name("X1CNT")
    3359                      .dwattr $C$DW$223, DW_AT_TI_symbol_name("_X1CNT")
    3360                      .dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    3361                      .dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
    3362              
    3363                      .dwendtag $C$DW$T$54
    3364              
    3365              $C$DW$224       .dwtag  DW_TAG_TI_far_type
    3366                      .dwattr $C$DW$224, DW_AT_type(*$C$DW$T$54)
    3367              
    3368              $C$DW$T$346     .dwtag  DW_TAG_volatile_type
    3369                      .dwattr $C$DW$T$346, DW_AT_type(*$C$DW$224)
    3370              
    3371              
    3372              $C$DW$T$55      .dwtag  DW_TAG_structure_type
    3373                      .dwattr $C$DW$T$55, DW_AT_name("CPU2RESCTL_BITS")
    3374                      .dwattr $C$DW$T$55, DW_AT_byte_size(0x02)
    3375              $C$DW$225       .dwtag  DW_TAG_member
    3376                      .dwattr $C$DW$225, DW_AT_type(*$C$DW$T$19)
    3377                      .dwattr $C$DW$225, DW_AT_name("RESET")
    3378                      .dwattr $C$DW$225, DW_AT_TI_symbol_name("_RESET")
    3379                      .dwattr $C$DW$225, DW_AT_bit_offset(0x0f)
    3380                      .dwattr $C$DW$225, DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v15.12.1 Sun Feb 26 22:57:13 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   66

    3381                      .dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
