TMS320C2000 Assembler PC v15.12.1 Tue Jul 04 11:13:55 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
IDDK_PM_Servo_F2837x.asm                                             PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                   PC v15.12.1.LTS *
       3              ;* Date/Time created: Tue Jul 04 11:13:54 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --cla_support=cla0 --float_support=fpu32 --hll_source=on --mem_model:cod
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../IDDK_PM_Servo_F2837x.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v15.12.1.LTS Copyright (c) 1996-201
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Keith\Documents\GitHub\ElectricSkateboard\Software\IDDK_PM
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
IDDK_PM_Servo_F2837x.asm                                             PAGE  156

    7122                      .dwpsn  file "../IDDK_PM_Servo_F2837x.c",line 2607,column 4,is_stmt,isa 0
    7123 000009dd 2B07-         MOV       @_ptr1,#0             ; [CPU_] |2607| 
    7124 000009de       $C$L35:    
    7125 000009de FE82          SUBB      SP,#2                 ; [CPU_U] 
    7126                      .dwcfi  cfa_offset, -2
    7127              $C$DW$360       .dwtag  DW_TAG_TI_branch
    7128                      .dwattr $C$DW$360, DW_AT_low_pc(0x00)
    7129                      .dwattr $C$DW$360, DW_AT_TI_return
    7130              
    7131 000009df 0006          LRETR     ; [CPU_] 
    7132                      ; return occurs ; [] 
    7133                      .dwattr $C$DW$355, DW_AT_TI_end_file("../IDDK_PM_Servo_F2837x.c")
    7134                      .dwattr $C$DW$355, DW_AT_TI_end_line(0xa32)
    7135                      .dwattr $C$DW$355, DW_AT_TI_end_column(0x01)
    7136                      .dwendentry
    7137                      .dwendtag $C$DW$355
    7138              
    7139              ;**************************************************************
    7140              ;* UNDEFINED EXTERNAL REFERENCES                              *
    7141              ;**************************************************************
    7142                      .global _baseParamsInit
    7143                      .global _derivParamsCal
    7144                      .global _init_resolver_Float
    7145                      .global _ResolverISR
    7146                      .global _InitPieCtrl
    7147                      .global _InitEPwm11Gpio
    7148                      .global _InitSysCtrl
    7149                      .global _InitPieVectTable
    7150                      .global _InitFlash
    7151                      .global _InitEPwm2Gpio
    7152                      .global _InitEPwm1Gpio
    7153                      .global _InitEPwm4Gpio
    7154                      .global _InitEPwm3Gpio
    7155                      .global _InitEPwm5Gpio
    7156                      .global _Sdfm_configureComparator
    7157                      .global _Sdfm_configureInputCtrl
    7158                      .global _Sdfm_enableMFE
    7159                      .global _Sdfm_configureData_filter
    7160                      .global _Sdfm_configureExternalreset
    7161                      .global _GPIO_SetupPinOptions
    7162                      .global _GPIO_SetupPinMux
    7163                      .global _DLOG_4CH_F_init
    7164                      .global _F28x_usDelay
    7165                      .global _DLOG_4CH_F_FUNC
    7166                      .global _RamfuncsLoadSize
    7167                      .global _RamfuncsLoadStart
    7168                      .global _RamfuncsRunStart
    7169                      .global _SyncSocRegs
    7170                      .global _CpuTimer0Regs
    7171                      .global _CpuTimer1Regs
    7172                      .global _DacaRegs
    7173                      .global _CpuTimer2Regs
    7174                      .global _DacbRegs
    7175                      .global _AdcdResultRegs
    7176                      .global _AdcaResultRegs
TMS320C2000 Assembler PC v15.12.1 Tue Jul 04 11:13:55 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
IDDK_PM_Servo_F2837x.asm                                             PAGE  157

    7177                      .global _AdcbResultRegs
    7178                      .global _AdccResultRegs
    7179                      .global _PieCtrlRegs
    7180                      .global _Cmpss3Regs
    7181                      .global _Cmpss6Regs
    7182                      .global _Cmpss2Regs
    7183                      .global _Cmpss1Regs
    7184                      .global _EQep2Regs
    7185                      .global _EQep1Regs
    7186                      .global _GpioDataRegs
    7187                      .global _EPwmXbarRegs
    7188                      .global _AdcaRegs
    7189                      .global _AdcbRegs
    7190                      .global _AdccRegs
    7191                      .global _Sdfm1Regs
    7192                      .global _AdcdRegs
    7193                      .global _Sdfm2Regs
    7194                      .global _CpuSysRegs
    7195                      .global _EPwm6Regs
    7196                      .global _EPwm7Regs
    7197                      .global _EPwm2Regs
    7198                      .global _EPwm4Regs
    7199                      .global _EPwm3Regs
    7200                      .global _EPwm5Regs
    7201                      .global _EPwm12Regs
    7202                      .global _EPwm1Regs
    7203                      .global _EPwm11Regs
    7204                      .global _EPwm9Regs
    7205                      .global _EPwm10Regs
    7206                      .global _EPwm8Regs
    7207                      .global _PieVectTable
    7208                      .global _memcpy
    7209              
    7210              ;***************************************************************
    7211              ;* TYPE INFORMATION                                            *
    7212              ;***************************************************************
    7213              
    7214              $C$DW$T$22      .dwtag  DW_TAG_structure_type
    7215                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x1a)
    7216              $C$DW$361       .dwtag  DW_TAG_member
    7217                      .dwattr $C$DW$361, DW_AT_type(*$C$DW$T$20)
    7218                      .dwattr $C$DW$361, DW_AT_name("input_ptr1")
    7219                      .dwattr $C$DW$361, DW_AT_TI_symbol_name("_input_ptr1")
    7220                      .dwattr $C$DW$361, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7221                      .dwattr $C$DW$361, DW_AT_accessibility(DW_ACCESS_public)
    7222              
    7223              $C$DW$362       .dwtag  DW_TAG_member
    7224                      .dwattr $C$DW$362, DW_AT_type(*$C$DW$T$20)
    7225                      .dwattr $C$DW$362, DW_AT_name("input_ptr2")
    7226                      .dwattr $C$DW$362, DW_AT_TI_symbol_name("_input_ptr2")
    7227                      .dwattr $C$DW$362, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7228                      .dwattr $C$DW$362, DW_AT_accessibility(DW_ACCESS_public)
    7229              
    7230              $C$DW$363       .dwtag  DW_TAG_member
    7231                      .dwattr $C$DW$363, DW_AT_type(*$C$DW$T$20)
TMS320C2000 Assembler PC v15.12.1 Tue Jul 04 11:13:55 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
IDDK_PM_Servo_F2837x.asm                                             PAGE  158

    7232                      .dwattr $C$DW$363, DW_AT_name("input_ptr3")
    7233                      .dwattr $C$DW$363, DW_AT_TI_symbol_name("_input_ptr3")
    7234                      .dwattr $C$DW$363, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7235                      .dwattr $C$DW$363, DW_AT_accessibility(DW_ACCESS_public)
    7236              
    7237              $C$DW$364       .dwtag  DW_TAG_member
    7238                      .dwattr $C$DW$364, DW_AT_type(*$C$DW$T$20)
    7239                      .dwattr $C$DW$364, DW_AT_name("input_ptr4")
    7240                      .dwattr $C$DW$364, DW_AT_TI_symbol_name("_input_ptr4")
    7241                      .dwattr $C$DW$364, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7242                      .dwattr $C$DW$364, DW_AT_accessibility(DW_ACCESS_public)
    7243              
    7244              $C$DW$365       .dwtag  DW_TAG_member
    7245                      .dwattr $C$DW$365, DW_AT_type(*$C$DW$T$20)
    7246                      .dwattr $C$DW$365, DW_AT_name("output_ptr1")
    7247                      .dwattr $C$DW$365, DW_AT_TI_symbol_name("_output_ptr1")
    7248                      .dwattr $C$DW$365, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7249                      .dwattr $C$DW$365, DW_AT_accessibility(DW_ACCESS_public)
    7250              
    7251              $C$DW$366       .dwtag  DW_TAG_member
    7252                      .dwattr $C$DW$366, DW_AT_type(*$C$DW$T$20)
    7253                      .dwattr $C$DW$366, DW_AT_name("output_ptr2")
    7254                      .dwattr $C$DW$366, DW_AT_TI_symbol_name("_output_ptr2")
    7255                      .dwattr $C$DW$366, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7256                      .dwattr $C$DW$366, DW_AT_accessibility(DW_ACCESS_public)
    7257              
    7258              $C$DW$367       .dwtag  DW_TAG_member
    7259                      .dwattr $C$DW$367, DW_AT_type(*$C$DW$T$20)
    7260                      .dwattr $C$DW$367, DW_AT_name("output_ptr3")
    7261                      .dwattr $C$DW$367, DW_AT_TI_symbol_name("_output_ptr3")
    7262                      .dwattr $C$DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7263                      .dwattr $C$DW$367, DW_AT_accessibility(DW_ACCESS_public)
    7264              
    7265              $C$DW$368       .dwtag  DW_TAG_member
    7266                      .dwattr $C$DW$368, DW_AT_type(*$C$DW$T$20)
    7267                      .dwattr $C$DW$368, DW_AT_name("output_ptr4")
    7268                      .dwattr $C$DW$368, DW_AT_TI_symbol_name("_output_ptr4")
    7269                      .dwattr $C$DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    7270                      .dwattr $C$DW$368, DW_AT_accessibility(DW_ACCESS_public)
    7271              
    7272              $C$DW$369       .dwtag  DW_TAG_member
    7273                      .dwattr $C$DW$369, DW_AT_type(*$C$DW$T$19)
    7274                      .dwattr $C$DW$369, DW_AT_name("prev_value")
    7275                      .dwattr $C$DW$369, DW_AT_TI_symbol_name("_prev_value")
    7276                      .dwattr $C$DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    7277                      .dwattr $C$DW$369, DW_AT_accessibility(DW_ACCESS_public)
    7278              
    7279              $C$DW$370       .dwtag  DW_TAG_member
    7280                      .dwattr $C$DW$370, DW_AT_type(*$C$DW$T$19)
    7281                      .dwattr $C$DW$370, DW_AT_name("trig_value")
    7282                      .dwattr $C$DW$370, DW_AT_TI_symbol_name("_trig_value")
    7283                      .dwattr $C$DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    7284                      .dwattr $C$DW$370, DW_AT_accessibility(DW_ACCESS_public)
    7285              
    7286              $C$DW$371       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v15.12.1 Tue Jul 04 11:13:55 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
IDDK_PM_Servo_F2837x.asm                                             PAGE  159

    7287                      .dwattr $C$DW$371, DW_AT_type(*$C$DW$T$21)
    7288                      .dwattr $C$DW$371, DW_AT_name("status")
    7289                      .dwattr $C$DW$371, DW_AT_TI_symbol_name("_status")
    7290                      .dwattr $C$DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    7291                      .dwattr $C$DW$371, DW_AT_accessibility(DW_ACCESS_public)
    7292              
    7293              $C$DW$372       .dwtag  DW_TAG_member
    7294                      .dwattr $C$DW$372, DW_AT_type(*$C$DW$T$21)
    7295                      .dwattr $C$DW$372, DW_AT_name("pre_scalar")
    7296                      .dwattr $C$DW$372, DW_AT_TI_symbol_name("_pre_scalar")
    7297                      .dwattr $C$DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    7298                      .dwattr $C$DW$372, DW_AT_accessibility(DW_ACCESS_public)
    7299              
    7300              $C$DW$373       .dwtag  DW_TAG_member
    7301                      .dwattr $C$DW$373, DW_AT_type(*$C$DW$T$21)
    7302                      .dwattr $C$DW$373, DW_AT_name("skip_count")
    7303                      .dwattr $C$DW$373, DW_AT_TI_symbol_name("_skip_count")
    7304                      .dwattr $C$DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    7305                      .dwattr $C$DW$373, DW_AT_accessibility(DW_ACCESS_public)
    7306              
    7307              $C$DW$374       .dwtag  DW_TAG_member
    7308                      .dwattr $C$DW$374, DW_AT_type(*$C$DW$T$21)
    7309                      .dwattr $C$DW$374, DW_AT_name("size")
    7310                      .dwattr $C$DW$374, DW_AT_TI_symbol_name("_size")
    7311                      .dwattr $C$DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    7312                      .dwattr $C$DW$374, DW_AT_accessibility(DW_ACCESS_public)
    7313              
    7314              $C$DW$375       .dwtag  DW_TAG_member
    7315                      .dwattr $C$DW$375, DW_AT_type(*$C$DW$T$21)
    7316                      .dwattr $C$DW$375, DW_AT_name("count")
    7317                      .dwattr $C$DW$375, DW_AT_TI_symbol_name("_count")
    7318                      .dwattr $C$DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    7319                      .dwattr $C$DW$375, DW_AT_accessibility(DW_ACCESS_public)
    7320              
    7321                      .dwendtag $C$DW$T$22
    7322              
    7323              $C$DW$T$674     .dwtag  DW_TAG_typedef
    7324                      .dwattr $C$DW$T$674, DW_AT_name("DLOG_4CH_F")
    7325                      .dwattr $C$DW$T$674, DW_AT_type(*$C$DW$T$22)
    7326                      .dwattr $C$DW$T$674, DW_AT_language(DW_LANG_C)
    7327              
    7328              $C$DW$T$675     .dwtag  DW_TAG_pointer_type
    7329                      .dwattr $C$DW$T$675, DW_AT_type(*$C$DW$T$674)
    7330                      .dwattr $C$DW$T$675, DW_AT_address_class(0x20)
    7331              
    7332              
    7333              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    7334                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x06)
    7335              $C$DW$376       .dwtag  DW_TAG_member
    7336                      .dwattr $C$DW$376, DW_AT_type(*$C$DW$T$16)
    7337                      .dwattr $C$DW$376, DW_AT_name("As")
    7338                      .dwattr $C$DW$376, DW_AT_TI_symbol_name("_As")
    7339                      .dwattr $C$DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7340                      .dwattr $C$DW$376, DW_AT_accessibility(DW_ACCESS_public)
    7341              
TMS320C2000 Assembler PC v15.12.1 Tue Jul 04 11:13:55 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
IDDK_PM_Servo_F2837x.asm                                             PAGE  160

    7342              $C$DW$377       .dwtag  DW_TAG_member
    7343                      .dwattr $C$DW$377, DW_AT_type(*$C$DW$T$16)
    7344                      .dwattr $C$DW$377, DW_AT_name("Bs")
    7345                      .dwattr $C$DW$377, DW_AT_TI_symbol_name("_Bs")
    7346                      .dwattr $C$DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7347                      .dwattr $C$DW$377, DW_AT_accessibility(DW_ACCESS_public)
    7348              
    7349              $C$DW$378       .dwtag  DW_TAG_member
    7350                      .dwattr $C$DW$378, DW_AT_type(*$C$DW$T$16)
    7351                      .dwattr $C$DW$378, DW_AT_name("Cs")
    7352                      .dwattr $C$DW$378, DW_AT_TI_symbol_name("_Cs")
    7353                      .dwattr $C$DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7354                      .dwattr $C$DW$378, DW_AT_accessibility(DW_ACCESS_public)
    7355              
    7356                      .dwendtag $C$DW$T$23
    7357              
    7358              $C$DW$T$677     .dwtag  DW_TAG_typedef
    7359                      .dwattr $C$DW$T$677, DW_AT_name("CURRENT_SENSOR")
    7360                      .dwattr $C$DW$T$677, DW_AT_type(*$C$DW$T$23)
    7361                      .dwattr $C$DW$T$677, DW_AT_language(DW_LANG_C)
    7362              
    7363              
    7364              $C$DW$T$678     .dwtag  DW_TAG_array_type
    7365                      .dwattr $C$DW$T$678, DW_AT_type(*$C$DW$T$677)
    7366                      .dwattr $C$DW$T$678, DW_AT_language(DW_LANG_C)
    7367                      .dwattr $C$DW$T$678, DW_AT_byte_size(0x12)
    7368              $C$DW$379       .dwtag  DW_TAG_subrange_type
    7369                      .dwattr $C$DW$379, DW_AT_upper_bound(0x02)
    7370              
    7371                      .dwendtag $C$DW$T$678
    7372              
    7373              
    7374              $C$DW$T$25      .dwtag  DW_TAG_structure_type
    7375                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x0a)
    7376              $C$DW$380       .dwtag  DW_TAG_member
    7377                      .dwattr $C$DW$380, DW_AT_type(*$C$DW$T$24)
    7378                      .dwattr $C$DW$380, DW_AT_name("As")
    7379                      .dwattr $C$DW$380, DW_AT_TI_symbol_name("_As")
    7380                      .dwattr $C$DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7381                      .dwattr $C$DW$380, DW_AT_accessibility(DW_ACCESS_public)
    7382              
    7383              $C$DW$381       .dwtag  DW_TAG_member
    7384                      .dwattr $C$DW$381, DW_AT_type(*$C$DW$T$24)
    7385                      .dwattr $C$DW$381, DW_AT_name("Bs")
    7386                      .dwattr $C$DW$381, DW_AT_TI_symbol_name("_Bs")
    7387                      .dwattr $C$DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7388                      .dwattr $C$DW$381, DW_AT_accessibility(DW_ACCESS_public)
    7389              
    7390              $C$DW$382       .dwtag  DW_TAG_member
    7391                      .dwattr $C$DW$382, DW_AT_type(*$C$DW$T$24)
    7392                      .dwattr $C$DW$382, DW_AT_name("Cs")
    7393                      .dwattr $C$DW$382, DW_AT_TI_symbol_name("_Cs")
    7394                      .dwattr $C$DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7395                      .dwattr $C$DW$382, DW_AT_accessibility(DW_ACCESS_public)
    7396              
TMS320C2000 Assembler PC v15.12.1 Tue Jul 04 11:13:55 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
IDDK_PM_Servo_F2837x.asm                                             PAGE  161

    7397              $C$DW$383       .dwtag  DW_TAG_member
    7398                      .dwattr $C$DW$383, DW_AT_type(*$C$DW$T$24)
    7399                      .dwattr $C$DW$383, DW_AT_name("Alpha")
    7400                      .dwattr $C$DW$383, DW_AT_TI_symbol_name("_Alpha")
    7401                      .dwattr $C$DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7402                      .dwattr $C$DW$383, DW_AT_accessibility(DW_ACCESS_public)
    7403              
    7404              $C$DW$384       .dwtag  DW_TAG_member
    7405                      .dwattr $C$DW$384, DW_AT_type(*$C$DW$T$24)
    7406                      .dwattr $C$DW$384, DW_AT_name("Beta")
    7407                      .dwattr $C$DW$384, DW_AT_TI_symbol_name("_Beta")
    7408                      .dwattr $C$DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7409                      .dwattr $C$DW$384, DW_AT_accessibility(DW_ACCESS_public)
    7410              
    7411                      .dwendtag $C$DW$T$25
    7412              
    7413              $C$DW$T$681     .dwtag  DW_TAG_typedef
    7414                      .dwattr $C$DW$T$681, DW_AT_name("CLARKE")
    7415                      .dwattr $C$DW$T$681, DW_AT_type(*$C$DW$T$25)
    7416                      .dwattr $C$DW$T$681, DW_AT_language(DW_LANG_C)
    7417              
    7418              
    7419              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    7420                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x0e)
    7421              $C$DW$385       .dwtag  DW_TAG_member
    7422                      .dwattr $C$DW$385, DW_AT_type(*$C$DW$T$24)
    7423                      .dwattr $C$DW$385, DW_AT_name("Alpha")
    7424                      .dwattr $C$DW$385, DW_AT_TI_symbol_name("_Alpha")
    7425                      .dwattr $C$DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7426                      .dwattr $C$DW$385, DW_AT_accessibility(DW_ACCESS_public)
    7427              
    7428              $C$DW$386       .dwtag  DW_TAG_member
    7429                      .dwattr $C$DW$386, DW_AT_type(*$C$DW$T$24)
    7430                      .dwattr $C$DW$386, DW_AT_name("Beta")
    7431                      .dwattr $C$DW$386, DW_AT_TI_symbol_name("_Beta")
    7432                      .dwattr $C$DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7433                      .dwattr $C$DW$386, DW_AT_accessibility(DW_ACCESS_public)
    7434              
    7435              $C$DW$387       .dwtag  DW_TAG_member
    7436                      .dwattr $C$DW$387, DW_AT_type(*$C$DW$T$24)
    7437                      .dwattr $C$DW$387, DW_AT_name("Angle")
    7438                      .dwattr $C$DW$387, DW_AT_TI_symbol_name("_Angle")
    7439                      .dwattr $C$DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7440                      .dwattr $C$DW$387, DW_AT_accessibility(DW_ACCESS_public)
    7441              
    7442              $C$DW$388       .dwtag  DW_TAG_member
    7443                      .dwattr $C$DW$388, DW_AT_type(*$C$DW$T$24)
    7444                      .dwattr $C$DW$388, DW_AT_name("Ds")
    7445                      .dwattr $C$DW$388, DW_AT_TI_symbol_name("_Ds")
    7446                      .dwattr $C$DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7447                      .dwattr $C$DW$388, DW_AT_accessibility(DW_ACCESS_public)
    7448              
    7449              $C$DW$389       .dwtag  DW_TAG_member
    7450                      .dwattr $C$DW$389, DW_AT_type(*$C$DW$T$24)
    7451                      .dwattr $C$DW$389, DW_AT_name("Qs")
TMS320C2000 Assembler PC v15.12.1 Tue Jul 04 11:13:55 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
IDDK_PM_Servo_F2837x.asm                                             PAGE  162

    7452                      .dwattr $C$DW$389, DW_AT_TI_symbol_name("_Qs")
    7453                      .dwattr $C$DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7454                      .dwattr $C$DW$389, DW_AT_accessibility(DW_ACCESS_public)
    7455              
    7456              $C$DW$390       .dwtag  DW_TAG_member
    7457                      .dwattr $C$DW$390, DW_AT_type(*$C$DW$T$24)
    7458                      .dwattr $C$DW$390, DW_AT_name("Sine")
    7459                      .dwattr $C$DW$390, DW_AT_TI_symbol_name("_Sine")
    7460                      .dwattr $C$DW$390, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7461                      .dwattr $C$DW$390, DW_AT_accessibility(DW_ACCESS_public)
    7462              
    7463              $C$DW$391       .dwtag  DW_TAG_member
    7464                      .dwattr $C$DW$391, DW_AT_type(*$C$DW$T$24)
    7465                      .dwattr $C$DW$391, DW_AT_name("Cosine")
    7466                      .dwattr $C$DW$391, DW_AT_TI_symbol_name("_Cosine")
    7467                      .dwattr $C$DW$391, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7468                      .dwattr $C$DW$391, DW_AT_accessibility(DW_ACCESS_public)
    7469              
    7470                      .dwendtag $C$DW$T$26
    7471              
    7472              $C$DW$T$682     .dwtag  DW_TAG_typedef
    7473                      .dwattr $C$DW$T$682, DW_AT_name("PARK")
    7474                      .dwattr $C$DW$T$682, DW_AT_type(*$C$DW$T$26)
    7475                      .dwattr $C$DW$T$682, DW_AT_language(DW_LANG_C)
    7476              
    7477              
    7478              $C$DW$T$27      .dwtag  DW_TAG_structure_type
    7479                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x0e)
    7480              $C$DW$392       .dwtag  DW_TAG_member
    7481                      .dwattr $C$DW$392, DW_AT_type(*$C$DW$T$24)
    7482                      .dwattr $C$DW$392, DW_AT_name("Alpha")
    7483                      .dwattr $C$DW$392, DW_AT_TI_symbol_name("_Alpha")
    7484                      .dwattr $C$DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7485                      .dwattr $C$DW$392, DW_AT_accessibility(DW_ACCESS_public)
    7486              
    7487              $C$DW$393       .dwtag  DW_TAG_member
    7488                      .dwattr $C$DW$393, DW_AT_type(*$C$DW$T$24)
    7489                      .dwattr $C$DW$393, DW_AT_name("Beta")
    7490                      .dwattr $C$DW$393, DW_AT_TI_symbol_name("_Beta")
    7491                      .dwattr $C$DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7492                      .dwattr $C$DW$393, DW_AT_accessibility(DW_ACCESS_public)
    7493              
    7494              $C$DW$394       .dwtag  DW_TAG_member
    7495                      .dwattr $C$DW$394, DW_AT_type(*$C$DW$T$24)
    7496                      .dwattr $C$DW$394, DW_AT_name("Angle")
    7497                      .dwattr $C$DW$394, DW_AT_TI_symbol_name("_Angle")
    7498                      .dwattr $C$DW$394, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7499                      .dwattr $C$DW$394, DW_AT_accessibility(DW_ACCESS_public)
    7500              
    7501              $C$DW$395       .dwtag  DW_TAG_member
    7502                      .dwattr $C$DW$395, DW_AT_type(*$C$DW$T$24)
    7503                      .dwattr $C$DW$395, DW_AT_name("Ds")
    7504                      .dwattr $C$DW$395, DW_AT_TI_symbol_name("_Ds")
    7505                      .dwattr $C$DW$395, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7506                      .dwattr $C$DW$395, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.1 Tue Jul 04 11:13:55 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
IDDK_PM_Servo_F2837x.asm                                             PAGE  163

    7507              
    7508              $C$DW$396       .dwtag  DW_TAG_member
    7509                      .dwattr $C$DW$396, DW_AT_type(*$C$DW$T$24)
    7510                      .dwattr $C$DW$396, DW_AT_name("Qs")
    7511                      .dwattr $C$DW$396, DW_AT_TI_symbol_name("_Qs")
    7512                      .dwattr $C$DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7513                      .dwattr $C$DW$396, DW_AT_accessibility(DW_ACCESS_public)
    7514              
    7515              $C$DW$397       .dwtag  DW_TAG_member
    7516                      .dwattr $C$DW$397, DW_AT_type(*$C$DW$T$24)
    7517                      .dwattr $C$DW$397, DW_AT_name("Sine")
    7518                      .dwattr $C$DW$397, DW_AT_TI_symbol_name("_Sine")
    7519                      .dwattr $C$DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7520                      .dwattr $C$DW$397, DW_AT_accessibility(DW_ACCESS_public)
    7521              
    7522              $C$DW$398       .dwtag  DW_TAG_member
    7523                      .dwattr $C$DW$398, DW_AT_type(*$C$DW$T$24)
    7524                      .dwattr $C$DW$398, DW_AT_name("Cosine")
    7525                      .dwattr $C$DW$398, DW_AT_TI_symbol_name("_Cosine")
    7526                      .dwattr $C$DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7527                      .dwattr $C$DW$398, DW_AT_accessibility(DW_ACCESS_public)
    7528              
    7529                      .dwendtag $C$DW$T$27
    7530              
    7531              $C$DW$T$683     .dwtag  DW_TAG_typedef
    7532                      .dwattr $C$DW$T$683, DW_AT_name("IPARK")
    7533                      .dwattr $C$DW$T$683, DW_AT_type(*$C$DW$T$27)
    7534                      .dwattr $C$DW$T$683, DW_AT_language(DW_LANG_C)
    7535              
    7536              
    7537              $C$DW$T$28      .dwtag  DW_TAG_structure_type
    7538                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x20)
    7539              $C$DW$399       .dwtag  DW_TAG_member
    7540                      .dwattr $C$DW$399, DW_AT_type(*$C$DW$T$24)
    7541                      .dwattr $C$DW$399, DW_AT_name("Ref")
    7542                      .dwattr $C$DW$399, DW_AT_TI_symbol_name("_Ref")
    7543                      .dwattr $C$DW$399, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7544                      .dwattr $C$DW$399, DW_AT_accessibility(DW_ACCESS_public)
    7545              
    7546              $C$DW$400       .dwtag  DW_TAG_member
    7547                      .dwattr $C$DW$400, DW_AT_type(*$C$DW$T$24)
    7548                      .dwattr $C$DW$400, DW_AT_name("Fdb")
    7549                      .dwattr $C$DW$400, DW_AT_TI_symbol_name("_Fdb")
    7550                      .dwattr $C$DW$400, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7551                      .dwattr $C$DW$400, DW_AT_accessibility(DW_ACCESS_public)
    7552              
    7553              $C$DW$401       .dwtag  DW_TAG_member
    7554                      .dwattr $C$DW$401, DW_AT_type(*$C$DW$T$24)
    7555                      .dwattr $C$DW$401, DW_AT_name("Err")
    7556                      .dwattr $C$DW$401, DW_AT_TI_symbol_name("_Err")
    7557                      .dwattr $C$DW$401, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7558                      .dwattr $C$DW$401, DW_AT_accessibility(DW_ACCESS_public)
    7559              
    7560              $C$DW$402       .dwtag  DW_TAG_member
    7561                      .dwattr $C$DW$402, DW_AT_type(*$C$DW$T$24)
TMS320C2000 Assembler PC v15.12.1 Tue Jul 04 11:13:55 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
IDDK_PM_Servo_F2837x.asm                                             PAGE  164

    7562                      .dwattr $C$DW$402, DW_AT_name("Kp")
    7563                      .dwattr $C$DW$402, DW_AT_TI_symbol_name("_Kp")
    7564                      .dwattr $C$DW$402, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7565                      .dwattr $C$DW$402, DW_AT_accessibility(DW_ACCESS_public)
    7566              
    7567              $C$DW$403       .dwtag  DW_TAG_member
    7568                      .dwattr $C$DW$403, DW_AT_type(*$C$DW$T$24)
    7569                      .dwattr $C$DW$403, DW_AT_name("Up")
    7570                      .dwattr $C$DW$403, DW_AT_TI_symbol_name("_Up")
    7571                      .dwattr $C$DW$403, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7572                      .dwattr $C$DW$403, DW_AT_accessibility(DW_ACCESS_public)
    7573              
    7574              $C$DW$404       .dwtag  DW_TAG_member
    7575                      .dwattr $C$DW$404, DW_AT_type(*$C$DW$T$24)
    7576                      .dwattr $C$DW$404, DW_AT_name("Ui")
    7577                      .dwattr $C$DW$404, DW_AT_TI_symbol_name("_Ui")
    7578                      .dwattr $C$DW$404, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7579                      .dwattr $C$DW$404, DW_AT_accessibility(DW_ACCESS_public)
    7580              
    7581              $C$DW$405       .dwtag  DW_TAG_member
    7582                      .dwattr $C$DW$405, DW_AT_type(*$C$DW$T$24)
    7583                      .dwattr $C$DW$405, DW_AT_name("Ud")
    7584                      .dwattr $C$DW$405, DW_AT_TI_symbol_name("_Ud")
    7585                      .dwattr $C$DW$405, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7586                      .dwattr $C$DW$405, DW_AT_accessibility(DW_ACCESS_public)
    7587              
    7588              $C$DW$406       .dwtag  DW_TAG_member
    7589                      .dwattr $C$DW$406, DW_AT_type(*$C$DW$T$24)
    7590                      .dwattr $C$DW$406, DW_AT_name("OutPreSat")
    7591                      .dwattr $C$DW$406, DW_AT_TI_symbol_name("_OutPreSat")
    7592                      .dwattr $C$DW$406, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    7593                      .dwattr $C$DW$406, DW_AT_accessibility(DW_ACCESS_public)
    7594              
    7595              $C$DW$407       .dwtag  DW_TAG_member
    7596                      .dwattr $C$DW$407, DW_AT_type(*$C$DW$T$24)
    7597                      .dwattr $C$DW$407, DW_AT_name("OutMax")
    7598                      .dwattr $C$DW$407, DW_AT_TI_symbol_name("_OutMax")
    7599                      .dwattr $C$DW$407, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    7600                      .dwattr $C$DW$407, DW_AT_accessibility(DW_ACCESS_public)
    7601              
    7602              $C$DW$408       .dwtag  DW_TAG_member
    7603                      .dwattr $C$DW$408, DW_AT_type(*$C$DW$T$24)
    7604                      .dwattr $C$DW$408, DW_AT_name("OutMin")
    7605                      .dwattr $C$DW$408, DW_AT_TI_symbol_name("_OutMin")
    7606                      .dwattr $C$DW$408, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    7607                      .dwattr $C$DW$408, DW_AT_accessibility(DW_ACCESS_public)
    7608              
    7609              $C$DW$409       .dwtag  DW_TAG_member
    7610                      .dwattr $C$DW$409, DW_AT_type(*$C$DW$T$24)
    7611                      .dwattr $C$DW$409, DW_AT_name("Out")
    7612                      .dwattr $C$DW$409, DW_AT_TI_symbol_name("_Out")
    7613                      .dwattr $C$DW$409, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    7614                      .dwattr $C$DW$409, DW_AT_accessibility(DW_ACCESS_public)
    7615              
    7616              $C$DW$410       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v15.12.1 Tue Jul 04 11:13:55 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
IDDK_PM_Servo_F2837x.asm                                             PAGE  165

    7617                      .dwattr $C$DW$410, DW_AT_type(*$C$DW$T$24)
    7618                      .dwattr $C$DW$410, DW_AT_name("SatErr")
    7619                      .dwattr $C$DW$410, DW_AT_TI_symbol_name("_SatErr")
    7620                      .dwattr $C$DW$410, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    7621                      .dwattr $C$DW$410, DW_AT_accessibility(DW_ACCESS_public)
    7622              
    7623              $C$DW$411       .dwtag  DW_TAG_member
    7624                      .dwattr $C$DW$411, DW_AT_type(*$C$DW$T$24)
    7625                      .dwattr $C$DW$411, DW_AT_name("Ki")
    7626                      .dwattr $C$DW$411, DW_AT_TI_symbol_name("_Ki")
    7627                      .dwattr $C$DW$411, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    7628                      .dwattr $C$DW$411, DW_AT_accessibility(DW_ACCESS_public)
    7629              
    7630              $C$DW$412       .dwtag  DW_TAG_member
    7631                      .dwattr $C$DW$412, DW_AT_type(*$C$DW$T$24)
    7632                      .dwattr $C$DW$412, DW_AT_name("Kc")
    7633                      .dwattr $C$DW$412, DW_AT_TI_symbol_name("_Kc")
    7634                      .dwattr $C$DW$412, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    7635                      .dwattr $C$DW$412, DW_AT_accessibility(DW_ACCESS_public)
    7636              
    7637              $C$DW$413       .dwtag  DW_TAG_member
    7638                      .dwattr $C$DW$413, DW_AT_type(*$C$DW$T$24)
    7639                      .dwattr $C$DW$413, DW_AT_name("Kd")
    7640                      .dwattr $C$DW$413, DW_AT_TI_symbol_name("_Kd")
    7641                      .dwattr $C$DW$413, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    7642                      .dwattr $C$DW$413, DW_AT_accessibility(DW_ACCESS_public)
    7643              
    7644              $C$DW$414       .dwtag  DW_TAG_member
    7645                      .dwattr $C$DW$414, DW_AT_type(*$C$DW$T$24)
    7646                      .dwattr $C$DW$414, DW_AT_name("Up1")
    7647                      .dwattr $C$DW$414, DW_AT_TI_symbol_name("_Up1")
    7648                      .dwattr $C$DW$414, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    7649                      .dwattr $C$DW$414, DW_AT_accessibility(DW_ACCESS_public)
    7650              
    7651                      .dwendtag $C$DW$T$28
    7652              
    7653              $C$DW$T$684     .dwtag  DW_TAG_typedef
    7654                      .dwattr $C$DW$T$684, DW_AT_name("PIDREG3")
    7655                      .dwattr $C$DW$T$684, DW_AT_type(*$C$DW$T$28)
    7656                      .dwattr $C$DW$T$684, DW_AT_language(DW_LANG_C)
    7657              
    7658              
    7659              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    7660                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x18)
    7661              $C$DW$415       .dwtag  DW_TAG_member
    7662                      .dwattr $C$DW$415, DW_AT_type(*$C$DW$T$24)
    7663                      .dwattr $C$DW$415, DW_AT_name("Ref")
    7664                      .dwattr $C$DW$415, DW_AT_TI_symbol_name("_Ref")
    7665                      .dwattr $C$DW$415, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7666                      .dwattr $C$DW$415, DW_AT_accessibility(DW_ACCESS_public)
    7667              
    7668              $C$DW$416       .dwtag  DW_TAG_member
    7669                      .dwattr $C$DW$416, DW_AT_type(*$C$DW$T$24)
    7670                      .dwattr $C$DW$416, DW_AT_name("Fbk")
    7671                      .dwattr $C$DW$416, DW_AT_TI_symbol_name("_Fbk")
TMS320C2000 Assembler PC v15.12.1 Tue Jul 04 11:13:55 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
IDDK_PM_Servo_F2837x.asm                                             PAGE  166

    7672                      .dwattr $C$DW$416, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7673                      .dwattr $C$DW$416, DW_AT_accessibility(DW_ACCESS_public)
    7674              
    7675              $C$DW$417       .dwtag  DW_TAG_member
    7676                      .dwattr $C$DW$417, DW_AT_type(*$C$DW$T$24)
    7677                      .dwattr $C$DW$417, DW_AT_name("Out")
    7678                      .dwattr $C$DW$417, DW_AT_TI_symbol_name("_Out")
    7679                      .dwattr $C$DW$417, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7680                      .dwattr $C$DW$417, DW_AT_accessibility(DW_ACCESS_public)
    7681              
    7682              $C$DW$418       .dwtag  DW_TAG_member
    7683                      .dwattr $C$DW$418, DW_AT_type(*$C$DW$T$24)
    7684                      .dwattr $C$DW$418, DW_AT_name("Kp")
    7685                      .dwattr $C$DW$418, DW_AT_TI_symbol_name("_Kp")
    7686                      .dwattr $C$DW$418, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7687                      .dwattr $C$DW$418, DW_AT_accessibility(DW_ACCESS_public)
    7688              
    7689              $C$DW$419       .dwtag  DW_TAG_member
    7690                      .dwattr $C$DW$419, DW_AT_type(*$C$DW$T$24)
    7691                      .dwattr $C$DW$419, DW_AT_name("Ki")
    7692                      .dwattr $C$DW$419, DW_AT_TI_symbol_name("_Ki")
    7693                      .dwattr $C$DW$419, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7694                      .dwattr $C$DW$419, DW_AT_accessibility(DW_ACCESS_public)
    7695              
    7696              $C$DW$420       .dwtag  DW_TAG_member
    7697                      .dwattr $C$DW$420, DW_AT_type(*$C$DW$T$24)
    7698                      .dwattr $C$DW$420, DW_AT_name("Umax")
    7699                      .dwattr $C$DW$420, DW_AT_TI_symbol_name("_Umax")
    7700                      .dwattr $C$DW$420, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7701                      .dwattr $C$DW$420, DW_AT_accessibility(DW_ACCESS_public)
    7702              
    7703              $C$DW$421       .dwtag  DW_TAG_member
    7704                      .dwattr $C$DW$421, DW_AT_type(*$C$DW$T$24)
    7705                      .dwattr $C$DW$421, DW_AT_name("Umin")
    7706                      .dwattr $C$DW$421, DW_AT_TI_symbol_name("_Umin")
    7707                      .dwattr $C$DW$421, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7708                      .dwattr $C$DW$421, DW_AT_accessibility(DW_ACCESS_public)
    7709              
    7710              $C$DW$422       .dwtag  DW_TAG_member
    7711                      .dwattr $C$DW$422, DW_AT_type(*$C$DW$T$24)
    7712                      .dwattr $C$DW$422, DW_AT_name("up")
    7713                      .dwattr $C$DW$422, DW_AT_TI_symbol_name("_up")
    7714                      .dwattr $C$DW$422, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    7715                      .dwattr $C$DW$422, DW_AT_accessibility(DW_ACCESS_public)
    7716              
    7717              $C$DW$423       .dwtag  DW_TAG_member
    7718                      .dwattr $C$DW$423, DW_AT_type(*$C$DW$T$24)
    7719                      .dwattr $C$DW$423, DW_AT_name("ui")
    7720                      .dwattr $C$DW$423, DW_AT_TI_symbol_name("_ui")
    7721                      .dwattr $C$DW$423, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    7722                      .dwattr $C$DW$423, DW_AT_accessibility(DW_ACCESS_public)
    7723              
    7724              $C$DW$424       .dwtag  DW_TAG_member
    7725                      .dwattr $C$DW$424, DW_AT_type(*$C$DW$T$24)
    7726                      .dwattr $C$DW$424, DW_AT_name("v1")
TMS320C2000 Assembler PC v15.12.1 Tue Jul 04 11:13:55 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
IDDK_PM_Servo_F2837x.asm                                             PAGE  167

    7727                      .dwattr $C$DW$424, DW_AT_TI_symbol_name("_v1")
    7728                      .dwattr $C$DW$424, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    7729                      .dwattr $C$DW$424, DW_AT_accessibility(DW_ACCESS_public)
    7730              
    7731              $C$DW$425       .dwtag  DW_TAG_member
    7732                      .dwattr $C$DW$425, DW_AT_type(*$C$DW$T$24)
    7733                      .dwattr $C$DW$425, DW_AT_name("i1")
    7734                      .dwattr $C$DW$425, DW_AT_TI_symbol_name("_i1")
    7735                      .dwattr $C$DW$425, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    7736                      .dwattr $C$DW$425, DW_AT_accessibility(DW_ACCESS_public)
    7737              
    7738              $C$DW$426       .dwtag  DW_TAG_member
    7739                      .dwattr $C$DW$426, DW_AT_type(*$C$DW$T$24)
    7740                      .dwattr $C$DW$426, DW_AT_name("w1")
    7741                      .dwattr $C$DW$426, DW_AT_TI_symbol_name("_w1")
    7742                      .dwattr $C$DW$426, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    7743                      .dwattr $C$DW$426, DW_AT_accessibility(DW_ACCESS_public)
    7744              
    7745                      .dwendtag $C$DW$T$29
    7746              
    7747              $C$DW$T$685     .dwtag  DW_TAG_typedef
    7748                      .dwattr $C$DW$T$685, DW_AT_name("PI_CONTROLLER")
    7749                      .dwattr $C$DW$T$685, DW_AT_type(*$C$DW$T$29)
    7750                      .dwattr $C$DW$T$685, DW_AT_language(DW_LANG_C)
    7751              
    7752              
    7753              $C$DW$T$30      .dwtag  DW_TAG_structure_type
    7754                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x0a)
    7755              $C$DW$427       .dwtag  DW_TAG_member
    7756                      .dwattr $C$DW$427, DW_AT_type(*$C$DW$T$24)
    7757                      .dwattr $C$DW$427, DW_AT_name("Ref")
    7758                      .dwattr $C$DW$427, DW_AT_TI_symbol_name("_Ref")
    7759                      .dwattr $C$DW$427, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7760                      .dwattr $C$DW$427, DW_AT_accessibility(DW_ACCESS_public)
    7761              
    7762              $C$DW$428       .dwtag  DW_TAG_member
    7763                      .dwattr $C$DW$428, DW_AT_type(*$C$DW$T$24)
    7764                      .dwattr $C$DW$428, DW_AT_name("Fbk")
    7765                      .dwattr $C$DW$428, DW_AT_TI_symbol_name("_Fbk")
    7766                      .dwattr $C$DW$428, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7767                      .dwattr $C$DW$428, DW_AT_accessibility(DW_ACCESS_public)
    7768              
    7769              $C$DW$429       .dwtag  DW_TAG_member
    7770                      .dwattr $C$DW$429, DW_AT_type(*$C$DW$T$24)
    7771                      .dwattr $C$DW$429, DW_AT_name("Out")
    7772                      .dwattr $C$DW$429, DW_AT_TI_symbol_name("_Out")
    7773                      .dwattr $C$DW$429, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7774                      .dwattr $C$DW$429, DW_AT_accessibility(DW_ACCESS_public)
    7775              
    7776              $C$DW$430       .dwtag  DW_TAG_member
    7777                      .dwattr $C$DW$430, DW_AT_type(*$C$DW$T$24)
    7778                      .dwattr $C$DW$430, DW_AT_name("c1")
    7779                      .dwattr $C$DW$430, DW_AT_TI_symbol_name("_c1")
    7780                      .dwattr $C$DW$430, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7781                      .dwattr $C$DW$430, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.1 Tue Jul 04 11:13:55 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
IDDK_PM_Servo_F2837x.asm                                             PAGE  168

    7782              
    7783              $C$DW$431       .dwtag  DW_TAG_member
    7784                      .dwattr $C$DW$431, DW_AT_type(*$C$DW$T$24)
    7785                      .dwattr $C$DW$431, DW_AT_name("c2")
    7786                      .dwattr $C$DW$431, DW_AT_TI_symbol_name("_c2")
    7787                      .dwattr $C$DW$431, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7788                      .dwattr $C$DW$431, DW_AT_accessibility(DW_ACCESS_public)
    7789              
    7790                      .dwendtag $C$DW$T$30
    7791              
    7792              $C$DW$T$33      .dwtag  DW_TAG_typedef
    7793                      .dwattr $C$DW$T$33, DW_AT_name("PID_TERMINALS")
    7794                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$30)
    7795                      .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    7796              
    7797              
    7798              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    7799                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x0e)
    7800              $C$DW$432       .dwtag  DW_TAG_member
    7801                      .dwattr $C$DW$432, DW_AT_type(*$C$DW$T$24)
    7802                      .dwattr $C$DW$432, DW_AT_name("Kr")
    7803                      .dwattr $C$DW$432, DW_AT_TI_symbol_name("_Kr")
    7804                      .dwattr $C$DW$432, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7805                      .dwattr $C$DW$432, DW_AT_accessibility(DW_ACCESS_public)
    7806              
    7807              $C$DW$433       .dwtag  DW_TAG_member
    7808                      .dwattr $C$DW$433, DW_AT_type(*$C$DW$T$24)
    7809                      .dwattr $C$DW$433, DW_AT_name("Kp")
    7810                      .dwattr $C$DW$433, DW_AT_TI_symbol_name("_Kp")
    7811                      .dwattr $C$DW$433, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7812                      .dwattr $C$DW$433, DW_AT_accessibility(DW_ACCESS_public)
    7813              
    7814              $C$DW$434       .dwtag  DW_TAG_member
    7815                      .dwattr $C$DW$434, DW_AT_type(*$C$DW$T$24)
    7816                      .dwattr $C$DW$434, DW_AT_name("Ki")
    7817                      .dwattr $C$DW$434, DW_AT_TI_symbol_name("_Ki")
    7818                      .dwattr $C$DW$434, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7819                      .dwattr $C$DW$434, DW_AT_accessibility(DW_ACCESS_public)
    7820              
    7821              $C$DW$435       .dwtag  DW_TAG_member
    7822                      .dwattr $C$DW$435, DW_AT_type(*$C$DW$T$24)
    7823                      .dwattr $C$DW$435, DW_AT_name("Kd")
    7824                      .dwattr $C$DW$435, DW_AT_TI_symbol_name("_Kd")
    7825                      .dwattr $C$DW$435, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7826                      .dwattr $C$DW$435, DW_AT_accessibility(DW_ACCESS_public)
    7827              
    7828              $C$DW$436       .dwtag  DW_TAG_member
    7829                      .dwattr $C$DW$436, DW_AT_type(*$C$DW$T$24)
    7830                      .dwattr $C$DW$436, DW_AT_name("Km")
    7831                      .dwattr $C$DW$436, DW_AT_TI_symbol_name("_Km")
    7832                      .dwattr $C$DW$436, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7833                      .dwattr $C$DW$436, DW_AT_accessibility(DW_ACCESS_public)
    7834              
    7835              $C$DW$437       .dwtag  DW_TAG_member
    7836                      .dwattr $C$DW$437, DW_AT_type(*$C$DW$T$24)
TMS320C2000 Assembler PC v15.12.1 Tue Jul 04 11:13:55 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
IDDK_PM_Servo_F2837x.asm                                             PAGE  169

    7837                      .dwattr $C$DW$437, DW_AT_name("Umax")
    7838                      .dwattr $C$DW$437, DW_AT_TI_symbol_name("_Umax")
    7839                      .dwattr $C$DW$437, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7840                      .dwattr $C$DW$437, DW_AT_accessibility(DW_ACCESS_public)
    7841              
    7842              $C$DW$438       .dwtag  DW_TAG_member
    7843                      .dwattr $C$DW$438, DW_AT_type(*$C$DW$T$24)
    7844                      .dwattr $C$DW$438, DW_AT_name("Umin")
    7845                      .dwattr $C$DW$438, DW_AT_TI_symbol_name("_Umin")
    7846                      .dwattr $C$DW$438, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7847                      .dwattr $C$DW$438, DW_AT_accessibility(DW_ACCESS_public)
    7848              
    7849                      .dwendtag $C$DW$T$31
    7850              
    7851              $C$DW$T$34      .dwtag  DW_TAG_typedef
    7852                      .dwattr $C$DW$T$34, DW_AT_name("PID_PARAMETERS")
    7853                      .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$31)
    7854                      .dwattr $C$DW$T$34, DW_AT_language(DW_LANG_C)
    7855              
    7856              
    7857              $C$DW$T$32      .dwtag  DW_TAG_structure_type
    7858                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x10)
    7859              $C$DW$439       .dwtag  DW_TAG_member
    7860                      .dwattr $C$DW$439, DW_AT_type(*$C$DW$T$24)
    7861                      .dwattr $C$DW$439, DW_AT_name("up")
    7862                      .dwattr $C$DW$439, DW_AT_TI_symbol_name("_up")
    7863                      .dwattr $C$DW$439, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7864                      .dwattr $C$DW$439, DW_AT_accessibility(DW_ACCESS_public)
    7865              
    7866              $C$DW$440       .dwtag  DW_TAG_member
    7867                      .dwattr $C$DW$440, DW_AT_type(*$C$DW$T$24)
    7868                      .dwattr $C$DW$440, DW_AT_name("ui")
    7869                      .dwattr $C$DW$440, DW_AT_TI_symbol_name("_ui")
    7870                      .dwattr $C$DW$440, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7871                      .dwattr $C$DW$440, DW_AT_accessibility(DW_ACCESS_public)
    7872              
    7873              $C$DW$441       .dwtag  DW_TAG_member
    7874                      .dwattr $C$DW$441, DW_AT_type(*$C$DW$T$24)
    7875                      .dwattr $C$DW$441, DW_AT_name("ud")
    7876                      .dwattr $C$DW$441, DW_AT_TI_symbol_name("_ud")
    7877                      .dwattr $C$DW$441, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7878                      .dwattr $C$DW$441, DW_AT_accessibility(DW_ACCESS_public)
    7879              
    7880              $C$DW$442       .dwtag  DW_TAG_member
    7881                      .dwattr $C$DW$442, DW_AT_type(*$C$DW$T$24)
    7882                      .dwattr $C$DW$442, DW_AT_name("v1")
    7883                      .dwattr $C$DW$442, DW_AT_TI_symbol_name("_v1")
    7884                      .dwattr $C$DW$442, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7885                      .dwattr $C$DW$442, DW_AT_accessibility(DW_ACCESS_public)
    7886              
    7887              $C$DW$443       .dwtag  DW_TAG_member
    7888                      .dwattr $C$DW$443, DW_AT_type(*$C$DW$T$24)
    7889                      .dwattr $C$DW$443, DW_AT_name("i1")
    7890                      .dwattr $C$DW$443, DW_AT_TI_symbol_name("_i1")
    7891                      .dwattr $C$DW$443, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
TMS320C2000 Assembler PC v15.12.1 Tue Jul 04 11:13:55 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
IDDK_PM_Servo_F2837x.asm                                             PAGE  170

    7892                      .dwattr $C$DW$443, DW_AT_accessibility(DW_ACCESS_public)
    7893              
    7894              $C$DW$444       .dwtag  DW_TAG_member
    7895                      .dwattr $C$DW$444, DW_AT_type(*$C$DW$T$24)
    7896                      .dwattr $C$DW$444, DW_AT_name("d1")
    7897                      .dwattr $C$DW$444, DW_AT_TI_symbol_name("_d1")
    7898                      .dwattr $C$DW$444, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7899                      .dwattr $C$DW$444, DW_AT_accessibility(DW_ACCESS_public)
    7900              
    7901              $C$DW$445       .dwtag  DW_TAG_member
    7902                      .dwattr $C$DW$445, DW_AT_type(*$C$DW$T$24)
    7903                      .dwattr $C$DW$445, DW_AT_name("d2")
    7904                      .dwattr $C$DW$445, DW_AT_TI_symbol_name("_d2")
    7905                      .dwattr $C$DW$445, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7906                      .dwattr $C$DW$445, DW_AT_accessibility(DW_ACCESS_public)
    7907              
    7908              $C$DW$446       .dwtag  DW_TAG_member
    7909                      .dwattr $C$DW$446, DW_AT_type(*$C$DW$T$24)
    7910                      .dwattr $C$DW$446, DW_AT_name("w1")
    7911                      .dwattr $C$DW$446, DW_AT_TI_symbol_name("_w1")
    7912                      .dwattr $C$DW$446, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    7913                      .dwattr $C$DW$446, DW_AT_accessibility(DW_ACCESS_public)
    7914              
    7915                      .dwendtag $C$DW$T$32
    7916              
    7917              $C$DW$T$35      .dwtag  DW_TAG_typedef
    7918                      .dwattr $C$DW$T$35, DW_AT_name("PID_DATA")
    7919                      .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$32)
    7920                      .dwattr $C$DW$T$35, DW_AT_language(DW_LANG_C)
    7921              
    7922              
    7923              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    7924                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x28)
    7925              $C$DW$447       .dwtag  DW_TAG_member
    7926                      .dwattr $C$DW$447, DW_AT_type(*$C$DW$T$33)
    7927                      .dwattr $C$DW$447, DW_AT_name("term")
    7928                      .dwattr $C$DW$447, DW_AT_TI_symbol_name("_term")
    7929                      .dwattr $C$DW$447, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7930                      .dwattr $C$DW$447, DW_AT_accessibility(DW_ACCESS_public)
    7931              
    7932              $C$DW$448       .dwtag  DW_TAG_member
    7933                      .dwattr $C$DW$448, DW_AT_type(*$C$DW$T$34)
    7934                      .dwattr $C$DW$448, DW_AT_name("param")
    7935                      .dwattr $C$DW$448, DW_AT_TI_symbol_name("_param")
    7936                      .dwattr $C$DW$448, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7937                      .dwattr $C$DW$448, DW_AT_accessibility(DW_ACCESS_public)
    7938              
    7939              $C$DW$449       .dwtag  DW_TAG_member
    7940                      .dwattr $C$DW$449, DW_AT_type(*$C$DW$T$35)
    7941                      .dwattr $C$DW$449, DW_AT_name("data")
    7942                      .dwattr $C$DW$449, DW_AT_TI_symbol_name("_data")
    7943                      .dwattr $C$DW$449, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    7944                      .dwattr $C$DW$449, DW_AT_accessibility(DW_ACCESS_public)
    7945              
    7946                      .dwendtag $C$DW$T$36
TMS320C2000 Assembler PC v15.12.1 Tue Jul 04 11:13:55 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
IDDK_PM_Servo_F2837x.asm                                             PAGE  171

    7947              
    7948              $C$DW$T$686     .dwtag  DW_TAG_typedef
    7949                      .dwattr $C$DW$T$686, DW_AT_name("PID_CONTROLLER")
    7950                      .dwattr $C$DW$T$686, DW_AT_type(*$C$DW$T$36)
    7951                      .dwattr $C$DW$T$686, DW_AT_language(DW_LANG_C)
    7952              
    7953              
    7954              $C$DW$T$38      .dwtag  DW_TAG_structure_type
    7955                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x12)
    7956              $C$DW$450       .dwtag  DW_TAG_member
    7957                      .dwattr $C$DW$450, DW_AT_type(*$C$DW$T$24)
    7958                      .dwattr $C$DW$450, DW_AT_name("Ualpha")
    7959                      .dwattr $C$DW$450, DW_AT_TI_symbol_name("_Ualpha")
    7960                      .dwattr $C$DW$450, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7961                      .dwattr $C$DW$450, DW_AT_accessibility(DW_ACCESS_public)
    7962              
    7963              $C$DW$451       .dwtag  DW_TAG_member
    7964                      .dwattr $C$DW$451, DW_AT_type(*$C$DW$T$24)
    7965                      .dwattr $C$DW$451, DW_AT_name("Ubeta")
    7966                      .dwattr $C$DW$451, DW_AT_TI_symbol_name("_Ubeta")
    7967                      .dwattr $C$DW$451, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7968                      .dwattr $C$DW$451, DW_AT_accessibility(DW_ACCESS_public)
    7969              
    7970              $C$DW$452       .dwtag  DW_TAG_member
    7971                      .dwattr $C$DW$452, DW_AT_type(*$C$DW$T$24)
    7972                      .dwattr $C$DW$452, DW_AT_name("Ta")
    7973                      .dwattr $C$DW$452, DW_AT_TI_symbol_name("_Ta")
    7974                      .dwattr $C$DW$452, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7975                      .dwattr $C$DW$452, DW_AT_accessibility(DW_ACCESS_public)
    7976              
    7977              $C$DW$453       .dwtag  DW_TAG_member
    7978                      .dwattr $C$DW$453, DW_AT_type(*$C$DW$T$24)
    7979                      .dwattr $C$DW$453, DW_AT_name("Tb")
    7980                      .dwattr $C$DW$453, DW_AT_TI_symbol_name("_Tb")
    7981                      .dwattr $C$DW$453, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7982                      .dwattr $C$DW$453, DW_AT_accessibility(DW_ACCESS_public)
    7983              
    7984              $C$DW$454       .dwtag  DW_TAG_member
    7985                      .dwattr $C$DW$454, DW_AT_type(*$C$DW$T$24)
    7986                      .dwattr $C$DW$454, DW_AT_name("Tc")
    7987                      .dwattr $C$DW$454, DW_AT_TI_symbol_name("_Tc")
    7988                      .dwattr $C$DW$454, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7989                      .dwattr $C$DW$454, DW_AT_accessibility(DW_ACCESS_public)
    7990              
    7991              $C$DW$455       .dwtag  DW_TAG_member
    7992                      .dwattr $C$DW$455, DW_AT_type(*$C$DW$T$24)
    7993                      .dwattr $C$DW$455, DW_AT_name("tmp1")
    7994                      .dwattr $C$DW$455, DW_AT_TI_symbol_name("_tmp1")
    7995                      .dwattr $C$DW$455, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7996                      .dwattr $C$DW$455, DW_AT_accessibility(DW_ACCESS_public)
    7997              
    7998              $C$DW$456       .dwtag  DW_TAG_member
    7999                      .dwattr $C$DW$456, DW_AT_type(*$C$DW$T$24)
    8000                      .dwattr $C$DW$456, DW_AT_name("tmp2")
    8001                      .dwattr $C$DW$456, DW_AT_TI_symbol_name("_tmp2")
TMS320C2000 Assembler PC v15.12.1 Tue Jul 04 11:13:55 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
IDDK_PM_Servo_F2837x.asm                                             PAGE  172

    8002                      .dwattr $C$DW$456, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    8003                      .dwattr $C$DW$456, DW_AT_accessibility(DW_ACCESS_public)
    8004              
    8005              $C$DW$457       .dwtag  DW_TAG_member
    8006                      .dwattr $C$DW$457, DW_AT_type(*$C$DW$T$24)
    8007                      .dwattr $C$DW$457, DW_AT_name("tmp3")
    8008                      .dwattr $C$DW$457, DW_AT_TI_symbol_name("_tmp3")
    8009                      .dwattr $C$DW$457, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    8010                      .dwattr $C$DW$457, DW_AT_accessibility(DW_ACCESS_public)
    8011              
    8012              $C$DW$458       .dwtag  DW_TAG_member
    8013                      .dwattr $C$DW$458, DW_AT_type(*$C$DW$T$37)
    8014                      .dwattr $C$DW$458, DW_AT_name("VecSector")
    8015                      .dwattr $C$DW$458, DW_AT_TI_symbol_name("_VecSector")
    8016                      .dwattr $C$DW$458, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    8017                      .dwattr $C$DW$458, DW_AT_accessibility(DW_ACCESS_public)
    8018              
    8019                      .dwendtag $C$DW$T$38
    8020              
    8021              $C$DW$T$687     .dwtag  DW_TAG_typedef
    8022                      .dwattr $C$DW$T$687, DW_AT_name("SVGEN")
    8023                      .dwattr $C$DW$T$687, DW_AT_type(*$C$DW$T$38)
    8024                      .dwattr $C$DW$T$687, DW_AT_language(DW_LANG_C)
    8025              
    8026              
    8027              $C$DW$T$40      .dwtag  DW_TAG_structure_type
    8028                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x10)
    8029              $C$DW$459       .dwtag  DW_TAG_member
    8030                      .dwattr $C$DW$459, DW_AT_type(*$C$DW$T$24)
    8031                      .dwattr $C$DW$459, DW_AT_name("TargetValue")
    8032                      .dwattr $C$DW$459, DW_AT_TI_symbol_name("_TargetValue")
    8033                      .dwattr $C$DW$459, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8034                      .dwattr $C$DW$459, DW_AT_accessibility(DW_ACCESS_public)
    8035              
    8036              $C$DW$460       .dwtag  DW_TAG_member
    8037                      .dwattr $C$DW$460, DW_AT_type(*$C$DW$T$39)
    8038                      .dwattr $C$DW$460, DW_AT_name("RampDelayMax")
    8039                      .dwattr $C$DW$460, DW_AT_TI_symbol_name("_RampDelayMax")
    8040                      .dwattr $C$DW$460, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8041                      .dwattr $C$DW$460, DW_AT_accessibility(DW_ACCESS_public)
    8042              
    8043              $C$DW$461       .dwtag  DW_TAG_member
    8044                      .dwattr $C$DW$461, DW_AT_type(*$C$DW$T$24)
    8045                      .dwattr $C$DW$461, DW_AT_name("RampLowLimit")
    8046                      .dwattr $C$DW$461, DW_AT_TI_symbol_name("_RampLowLimit")
    8047                      .dwattr $C$DW$461, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8048                      .dwattr $C$DW$461, DW_AT_accessibility(DW_ACCESS_public)
    8049              
    8050              $C$DW$462       .dwtag  DW_TAG_member
    8051                      .dwattr $C$DW$462, DW_AT_type(*$C$DW$T$24)
    8052                      .dwattr $C$DW$462, DW_AT_name("RampHighLimit")
    8053                      .dwattr $C$DW$462, DW_AT_TI_symbol_name("_RampHighLimit")
    8054                      .dwattr $C$DW$462, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    8055                      .dwattr $C$DW$462, DW_AT_accessibility(DW_ACCESS_public)
    8056              
TMS320C2000 Assembler PC v15.12.1 Tue Jul 04 11:13:55 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
IDDK_PM_Servo_F2837x.asm                                             PAGE  173

    8057              $C$DW$463       .dwtag  DW_TAG_member
    8058                      .dwattr $C$DW$463, DW_AT_type(*$C$DW$T$39)
    8059                      .dwattr $C$DW$463, DW_AT_name("RampDelayCount")
    8060                      .dwattr $C$DW$463, DW_AT_TI_symbol_name("_RampDelayCount")
    8061                      .dwattr $C$DW$463, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8062                      .dwattr $C$DW$463, DW_AT_accessibility(DW_ACCESS_public)
    8063              
    8064              $C$DW$464       .dwtag  DW_TAG_member
    8065                      .dwattr $C$DW$464, DW_AT_type(*$C$DW$T$24)
    8066                      .dwattr $C$DW$464, DW_AT_name("SetpointValue")
    8067                      .dwattr $C$DW$464, DW_AT_TI_symbol_name("_SetpointValue")
    8068                      .dwattr $C$DW$464, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    8069                      .dwattr $C$DW$464, DW_AT_accessibility(DW_ACCESS_public)
    8070              
    8071              $C$DW$465       .dwtag  DW_TAG_member
    8072                      .dwattr $C$DW$465, DW_AT_type(*$C$DW$T$39)
    8073                      .dwattr $C$DW$465, DW_AT_name("EqualFlag")
    8074                      .dwattr $C$DW$465, DW_AT_TI_symbol_name("_EqualFlag")
    8075                      .dwattr $C$DW$465, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    8076                      .dwattr $C$DW$465, DW_AT_accessibility(DW_ACCESS_public)
    8077              
    8078              $C$DW$466       .dwtag  DW_TAG_member
    8079                      .dwattr $C$DW$466, DW_AT_type(*$C$DW$T$24)
    8080                      .dwattr $C$DW$466, DW_AT_name("Tmp")
    8081                      .dwattr $C$DW$466, DW_AT_TI_symbol_name("_Tmp")
    8082                      .dwattr $C$DW$466, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    8083                      .dwattr $C$DW$466, DW_AT_accessibility(DW_ACCESS_public)
    8084              
    8085                      .dwendtag $C$DW$T$40
    8086              
    8087              $C$DW$T$688     .dwtag  DW_TAG_typedef
    8088                      .dwattr $C$DW$T$688, DW_AT_name("RMPCNTL")
    8089                      .dwattr $C$DW$T$688, DW_AT_type(*$C$DW$T$40)
    8090                      .dwattr $C$DW$T$688, DW_AT_language(DW_LANG_C)
    8091              
    8092              
    8093              $C$DW$T$41      .dwtag  DW_TAG_structure_type
    8094                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x0c)
    8095              $C$DW$467       .dwtag  DW_TAG_member
    8096                      .dwattr $C$DW$467, DW_AT_type(*$C$DW$T$24)
    8097                      .dwattr $C$DW$467, DW_AT_name("Freq")
    8098                      .dwattr $C$DW$467, DW_AT_TI_symbol_name("_Freq")
    8099                      .dwattr $C$DW$467, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8100                      .dwattr $C$DW$467, DW_AT_accessibility(DW_ACCESS_public)
    8101              
    8102              $C$DW$468       .dwtag  DW_TAG_member
    8103                      .dwattr $C$DW$468, DW_AT_type(*$C$DW$T$24)
    8104                      .dwattr $C$DW$468, DW_AT_name("StepAngleMax")
    8105                      .dwattr $C$DW$468, DW_AT_TI_symbol_name("_StepAngleMax")
    8106                      .dwattr $C$DW$468, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8107                      .dwattr $C$DW$468, DW_AT_accessibility(DW_ACCESS_public)
    8108              
    8109              $C$DW$469       .dwtag  DW_TAG_member
    8110                      .dwattr $C$DW$469, DW_AT_type(*$C$DW$T$24)
    8111                      .dwattr $C$DW$469, DW_AT_name("Angle")
TMS320C2000 Assembler PC v15.12.1 Tue Jul 04 11:13:55 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
IDDK_PM_Servo_F2837x.asm                                             PAGE  174

    8112                      .dwattr $C$DW$469, DW_AT_TI_symbol_name("_Angle")
    8113                      .dwattr $C$DW$469, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8114                      .dwattr $C$DW$469, DW_AT_accessibility(DW_ACCESS_public)
    8115              
    8116              $C$DW$470       .dwtag  DW_TAG_member
    8117                      .dwattr $C$DW$470, DW_AT_type(*$C$DW$T$24)
    8118                      .dwattr $C$DW$470, DW_AT_name("Gain")
    8119                      .dwattr $C$DW$470, DW_AT_TI_symbol_name("_Gain")
    8120                      .dwattr $C$DW$470, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    8121                      .dwattr $C$DW$470, DW_AT_accessibility(DW_ACCESS_public)
    8122              
    8123              $C$DW$471       .dwtag  DW_TAG_member
    8124                      .dwattr $C$DW$471, DW_AT_type(*$C$DW$T$24)
    8125                      .dwattr $C$DW$471, DW_AT_name("Out")
    8126                      .dwattr $C$DW$471, DW_AT_TI_symbol_name("_Out")
    8127                      .dwattr $C$DW$471, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8128                      .dwattr $C$DW$471, DW_AT_accessibility(DW_ACCESS_public)
    8129              
    8130              $C$DW$472       .dwtag  DW_TAG_member
    8131                      .dwattr $C$DW$472, DW_AT_type(*$C$DW$T$24)
    8132                      .dwattr $C$DW$472, DW_AT_name("Offset")
    8133                      .dwattr $C$DW$472, DW_AT_TI_symbol_name("_Offset")
    8134                      .dwattr $C$DW$472, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    8135                      .dwattr $C$DW$472, DW_AT_accessibility(DW_ACCESS_public)
    8136              
    8137                      .dwendtag $C$DW$T$41
    8138              
    8139              $C$DW$T$689     .dwtag  DW_TAG_typedef
    8140                      .dwattr $C$DW$T$689, DW_AT_name("RAMPGEN")
    8141                      .dwattr $C$DW$T$689, DW_AT_type(*$C$DW$T$41)
    8142                      .dwattr $C$DW$T$689, DW_AT_language(DW_LANG_C)
    8143              
    8144              
    8145              $C$DW$T$42      .dwtag  DW_TAG_structure_type
    8146                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x16)
    8147              $C$DW$473       .dwtag  DW_TAG_member
    8148                      .dwattr $C$DW$473, DW_AT_type(*$C$DW$T$24)
    8149                      .dwattr $C$DW$473, DW_AT_name("DcBusVolt")
    8150                      .dwattr $C$DW$473, DW_AT_TI_symbol_name("_DcBusVolt")
    8151                      .dwattr $C$DW$473, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8152                      .dwattr $C$DW$473, DW_AT_accessibility(DW_ACCESS_public)
    8153              
    8154              $C$DW$474       .dwtag  DW_TAG_member
    8155                      .dwattr $C$DW$474, DW_AT_type(*$C$DW$T$24)
    8156                      .dwattr $C$DW$474, DW_AT_name("MfuncV1")
    8157                      .dwattr $C$DW$474, DW_AT_TI_symbol_name("_MfuncV1")
    8158                      .dwattr $C$DW$474, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8159                      .dwattr $C$DW$474, DW_AT_accessibility(DW_ACCESS_public)
    8160              
    8161              $C$DW$475       .dwtag  DW_TAG_member
    8162                      .dwattr $C$DW$475, DW_AT_type(*$C$DW$T$24)
    8163                      .dwattr $C$DW$475, DW_AT_name("MfuncV2")
    8164                      .dwattr $C$DW$475, DW_AT_TI_symbol_name("_MfuncV2")
    8165                      .dwattr $C$DW$475, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8166                      .dwattr $C$DW$475, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.1 Tue Jul 04 11:13:55 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
IDDK_PM_Servo_F2837x.asm                                             PAGE  175

    8167              
    8168              $C$DW$476       .dwtag  DW_TAG_member
    8169                      .dwattr $C$DW$476, DW_AT_type(*$C$DW$T$24)
    8170                      .dwattr $C$DW$476, DW_AT_name("MfuncV3")
    8171                      .dwattr $C$DW$476, DW_AT_TI_symbol_name("_MfuncV3")
    8172                      .dwattr $C$DW$476, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    8173                      .dwattr $C$DW$476, DW_AT_accessibility(DW_ACCESS_public)
    8174              
    8175              $C$DW$477       .dwtag  DW_TAG_member
    8176                      .dwattr $C$DW$477, DW_AT_type(*$C$DW$T$37)
    8177                      .dwattr $C$DW$477, DW_AT_name("OutOfPhase")
    8178                      .dwattr $C$DW$477, DW_AT_TI_symbol_name("_OutOfPhase")
    8179                      .dwattr $C$DW$477, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8180                      .dwattr $C$DW$477, DW_AT_accessibility(DW_ACCESS_public)
    8181              
    8182              $C$DW$478       .dwtag  DW_TAG_member
    8183                      .dwattr $C$DW$478, DW_AT_type(*$C$DW$T$24)
    8184                      .dwattr $C$DW$478, DW_AT_name("VphaseA")
    8185                      .dwattr $C$DW$478, DW_AT_TI_symbol_name("_VphaseA")
    8186                      .dwattr $C$DW$478, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    8187                      .dwattr $C$DW$478, DW_AT_accessibility(DW_ACCESS_public)
    8188              
    8189              $C$DW$479       .dwtag  DW_TAG_member
    8190                      .dwattr $C$DW$479, DW_AT_type(*$C$DW$T$24)
    8191                      .dwattr $C$DW$479, DW_AT_name("VphaseB")
    8192                      .dwattr $C$DW$479, DW_AT_TI_symbol_name("_VphaseB")
    8193                      .dwattr $C$DW$479, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    8194                      .dwattr $C$DW$479, DW_AT_accessibility(DW_ACCESS_public)
    8195              
    8196              $C$DW$480       .dwtag  DW_TAG_member
    8197                      .dwattr $C$DW$480, DW_AT_type(*$C$DW$T$24)
    8198                      .dwattr $C$DW$480, DW_AT_name("VphaseC")
    8199                      .dwattr $C$DW$480, DW_AT_TI_symbol_name("_VphaseC")
    8200                      .dwattr $C$DW$480, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    8201                      .dwattr $C$DW$480, DW_AT_accessibility(DW_ACCESS_public)
    8202              
    8203              $C$DW$481       .dwtag  DW_TAG_member
    8204                      .dwattr $C$DW$481, DW_AT_type(*$C$DW$T$24)
    8205                      .dwattr $C$DW$481, DW_AT_name("Valpha")
    8206                      .dwattr $C$DW$481, DW_AT_TI_symbol_name("_Valpha")
    8207                      .dwattr $C$DW$481, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    8208                      .dwattr $C$DW$481, DW_AT_accessibility(DW_ACCESS_public)
    8209              
    8210              $C$DW$482       .dwtag  DW_TAG_member
    8211                      .dwattr $C$DW$482, DW_AT_type(*$C$DW$T$24)
    8212                      .dwattr $C$DW$482, DW_AT_name("Vbeta")
    8213                      .dwattr $C$DW$482, DW_AT_TI_symbol_name("_Vbeta")
    8214                      .dwattr $C$DW$482, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    8215                      .dwattr $C$DW$482, DW_AT_accessibility(DW_ACCESS_public)
    8216              
    8217              $C$DW$483       .dwtag  DW_TAG_member
    8218                      .dwattr $C$DW$483, DW_AT_type(*$C$DW$T$24)
    8219                      .dwattr $C$DW$483, DW_AT_name("temp")
    8220                      .dwattr $C$DW$483, DW_AT_TI_symbol_name("_temp")
    8221                      .dwattr $C$DW$483, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
TMS320C2000 Assembler PC v15.12.1 Tue Jul 04 11:13:55 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
IDDK_PM_Servo_F2837x.asm                                             PAGE  176

    8222                      .dwattr $C$DW$483, DW_AT_accessibility(DW_ACCESS_public)
    8223              
    8224                      .dwendtag $C$DW$T$42
    8225              
    8226              $C$DW$T$690     .dwtag  DW_TAG_typedef
    8227                      .dwattr $C$DW$T$690, DW_AT_name("PHASEVOLTAGE")
    8228                      .dwattr $C$DW$T$690, DW_AT_type(*$C$DW$T$42)
    8229                      .dwattr $C$DW$T$690, DW_AT_language(DW_LANG_C)
    8230              
    8231              
    8232              $C$DW$T$45      .dwtag  DW_TAG_structure_type
    8233                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x14)
    8234              $C$DW$484       .dwtag  DW_TAG_member
    8235                      .dwattr $C$DW$484, DW_AT_type(*$C$DW$T$24)
    8236                      .dwattr $C$DW$484, DW_AT_name("ElecTheta")
    8237                      .dwattr $C$DW$484, DW_AT_TI_symbol_name("_ElecTheta")
    8238                      .dwattr $C$DW$484, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8239                      .dwattr $C$DW$484, DW_AT_accessibility(DW_ACCESS_public)
    8240              
    8241              $C$DW$485       .dwtag  DW_TAG_member
    8242                      .dwattr $C$DW$485, DW_AT_type(*$C$DW$T$39)
    8243                      .dwattr $C$DW$485, DW_AT_name("DirectionQep")
    8244                      .dwattr $C$DW$485, DW_AT_TI_symbol_name("_DirectionQep")
    8245                      .dwattr $C$DW$485, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8246                      .dwattr $C$DW$485, DW_AT_accessibility(DW_ACCESS_public)
    8247              
    8248              $C$DW$486       .dwtag  DW_TAG_member
    8249                      .dwattr $C$DW$486, DW_AT_type(*$C$DW$T$24)
    8250                      .dwattr $C$DW$486, DW_AT_name("OldElecTheta")
    8251                      .dwattr $C$DW$486, DW_AT_TI_symbol_name("_OldElecTheta")
    8252                      .dwattr $C$DW$486, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8253                      .dwattr $C$DW$486, DW_AT_accessibility(DW_ACCESS_public)
    8254              
    8255              $C$DW$487       .dwtag  DW_TAG_member
    8256                      .dwattr $C$DW$487, DW_AT_type(*$C$DW$T$24)
    8257                      .dwattr $C$DW$487, DW_AT_name("Speed")
    8258                      .dwattr $C$DW$487, DW_AT_TI_symbol_name("_Speed")
    8259                      .dwattr $C$DW$487, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    8260                      .dwattr $C$DW$487, DW_AT_accessibility(DW_ACCESS_public)
    8261              
    8262              $C$DW$488       .dwtag  DW_TAG_member
    8263                      .dwattr $C$DW$488, DW_AT_type(*$C$DW$T$39)
    8264                      .dwattr $C$DW$488, DW_AT_name("BaseRpm")
    8265                      .dwattr $C$DW$488, DW_AT_TI_symbol_name("_BaseRpm")
    8266                      .dwattr $C$DW$488, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8267                      .dwattr $C$DW$488, DW_AT_accessibility(DW_ACCESS_public)
    8268              
    8269              $C$DW$489       .dwtag  DW_TAG_member
    8270                      .dwattr $C$DW$489, DW_AT_type(*$C$DW$T$43)
    8271                      .dwattr $C$DW$489, DW_AT_name("K1")
    8272                      .dwattr $C$DW$489, DW_AT_TI_symbol_name("_K1")
    8273                      .dwattr $C$DW$489, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    8274                      .dwattr $C$DW$489, DW_AT_accessibility(DW_ACCESS_public)
    8275              
    8276              $C$DW$490       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v15.12.1 Tue Jul 04 11:13:55 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
IDDK_PM_Servo_F2837x.asm                                             PAGE  177

    8277                      .dwattr $C$DW$490, DW_AT_type(*$C$DW$T$24)
    8278                      .dwattr $C$DW$490, DW_AT_name("K2")
    8279                      .dwattr $C$DW$490, DW_AT_TI_symbol_name("_K2")
    8280                      .dwattr $C$DW$490, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    8281                      .dwattr $C$DW$490, DW_AT_accessibility(DW_ACCESS_public)
    8282              
    8283              $C$DW$491       .dwtag  DW_TAG_member
    8284                      .dwattr $C$DW$491, DW_AT_type(*$C$DW$T$24)
    8285                      .dwattr $C$DW$491, DW_AT_name("K3")
    8286                      .dwattr $C$DW$491, DW_AT_TI_symbol_name("_K3")
    8287                      .dwattr $C$DW$491, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    8288                      .dwattr $C$DW$491, DW_AT_accessibility(DW_ACCESS_public)
    8289              
    8290              $C$DW$492       .dwtag  DW_TAG_member
    8291                      .dwattr $C$DW$492, DW_AT_type(*$C$DW$T$44)
    8292                      .dwattr $C$DW$492, DW_AT_name("SpeedRpm")
    8293                      .dwattr $C$DW$492, DW_AT_TI_symbol_name("_SpeedRpm")
    8294                      .dwattr $C$DW$492, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    8295                      .dwattr $C$DW$492, DW_AT_accessibility(DW_ACCESS_public)
    8296              
    8297              $C$DW$493       .dwtag  DW_TAG_member
    8298                      .dwattr $C$DW$493, DW_AT_type(*$C$DW$T$24)
    8299                      .dwattr $C$DW$493, DW_AT_name("Tmp")
    8300                      .dwattr $C$DW$493, DW_AT_TI_symbol_name("_Tmp")
    8301                      .dwattr $C$DW$493, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    8302                      .dwattr $C$DW$493, DW_AT_accessibility(DW_ACCESS_public)
    8303              
    8304                      .dwendtag $C$DW$T$45
    8305              
    8306              $C$DW$T$691     .dwtag  DW_TAG_typedef
    8307                      .dwattr $C$DW$T$691, DW_AT_name("SPEED_MEAS_QEP")
    8308                      .dwattr $C$DW$T$691, DW_AT_type(*$C$DW$T$45)
    8309                      .dwattr $C$DW$T$691, DW_AT_language(DW_LANG_C)
    8310              
    8311              
    8312              $C$DW$T$46      .dwtag  DW_TAG_structure_type
    8313                      .dwattr $C$DW$T$46, DW_AT_byte_size(0x12)
    8314              $C$DW$494       .dwtag  DW_TAG_member
    8315                      .dwattr $C$DW$494, DW_AT_type(*$C$DW$T$19)
    8316                      .dwattr $C$DW$494, DW_AT_name("ElecTheta")
    8317                      .dwattr $C$DW$494, DW_AT_TI_symbol_name("_ElecTheta")
    8318                      .dwattr $C$DW$494, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8319                      .dwattr $C$DW$494, DW_AT_accessibility(DW_ACCESS_public)
    8320              
    8321              $C$DW$495       .dwtag  DW_TAG_member
    8322                      .dwattr $C$DW$495, DW_AT_type(*$C$DW$T$19)
    8323                      .dwattr $C$DW$495, DW_AT_name("MechTheta")
    8324                      .dwattr $C$DW$495, DW_AT_TI_symbol_name("_MechTheta")
    8325                      .dwattr $C$DW$495, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8326                      .dwattr $C$DW$495, DW_AT_accessibility(DW_ACCESS_public)
    8327              
    8328              $C$DW$496       .dwtag  DW_TAG_member
    8329                      .dwattr $C$DW$496, DW_AT_type(*$C$DW$T$37)
    8330                      .dwattr $C$DW$496, DW_AT_name("DirectionQep")
    8331                      .dwattr $C$DW$496, DW_AT_TI_symbol_name("_DirectionQep")
TMS320C2000 Assembler PC v15.12.1 Tue Jul 04 11:13:55 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
IDDK_PM_Servo_F2837x.asm                                             PAGE  178

    8332                      .dwattr $C$DW$496, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8333                      .dwattr $C$DW$496, DW_AT_accessibility(DW_ACCESS_public)
    8334              
    8335              $C$DW$497       .dwtag  DW_TAG_member
    8336                      .dwattr $C$DW$497, DW_AT_type(*$C$DW$T$37)
    8337                      .dwattr $C$DW$497, DW_AT_name("QepPeriod")
    8338                      .dwattr $C$DW$497, DW_AT_TI_symbol_name("_QepPeriod")
    8339                      .dwattr $C$DW$497, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    8340                      .dwattr $C$DW$497, DW_AT_accessibility(DW_ACCESS_public)
    8341              
    8342              $C$DW$498       .dwtag  DW_TAG_member
    8343                      .dwattr $C$DW$498, DW_AT_type(*$C$DW$T$39)
    8344                      .dwattr $C$DW$498, DW_AT_name("QepCountIndex")
    8345                      .dwattr $C$DW$498, DW_AT_TI_symbol_name("_QepCountIndex")
    8346                      .dwattr $C$DW$498, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    8347                      .dwattr $C$DW$498, DW_AT_accessibility(DW_ACCESS_public)
    8348              
    8349              $C$DW$499       .dwtag  DW_TAG_member
    8350                      .dwattr $C$DW$499, DW_AT_type(*$C$DW$T$44)
    8351                      .dwattr $C$DW$499, DW_AT_name("RawTheta")
    8352                      .dwattr $C$DW$499, DW_AT_TI_symbol_name("_RawTheta")
    8353                      .dwattr $C$DW$499, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8354                      .dwattr $C$DW$499, DW_AT_accessibility(DW_ACCESS_public)
    8355              
    8356              $C$DW$500       .dwtag  DW_TAG_member
    8357                      .dwattr $C$DW$500, DW_AT_type(*$C$DW$T$19)
    8358                      .dwattr $C$DW$500, DW_AT_name("MechScaler")
    8359                      .dwattr $C$DW$500, DW_AT_TI_symbol_name("_MechScaler")
    8360                      .dwattr $C$DW$500, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    8361                      .dwattr $C$DW$500, DW_AT_accessibility(DW_ACCESS_public)
    8362              
    8363              $C$DW$501       .dwtag  DW_TAG_member
    8364                      .dwattr $C$DW$501, DW_AT_type(*$C$DW$T$37)
    8365                      .dwattr $C$DW$501, DW_AT_name("LineEncoder")
    8366                      .dwattr $C$DW$501, DW_AT_TI_symbol_name("_LineEncoder")
    8367                      .dwattr $C$DW$501, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    8368                      .dwattr $C$DW$501, DW_AT_accessibility(DW_ACCESS_public)
    8369              
    8370              $C$DW$502       .dwtag  DW_TAG_member
    8371                      .dwattr $C$DW$502, DW_AT_type(*$C$DW$T$37)
    8372                      .dwattr $C$DW$502, DW_AT_name("PolePairs")
    8373                      .dwattr $C$DW$502, DW_AT_TI_symbol_name("_PolePairs")
    8374                      .dwattr $C$DW$502, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    8375                      .dwattr $C$DW$502, DW_AT_accessibility(DW_ACCESS_public)
    8376              
    8377              $C$DW$503       .dwtag  DW_TAG_member
    8378                      .dwattr $C$DW$503, DW_AT_type(*$C$DW$T$44)
    8379                      .dwattr $C$DW$503, DW_AT_name("CalibratedAngle")
    8380                      .dwattr $C$DW$503, DW_AT_TI_symbol_name("_CalibratedAngle")
    8381                      .dwattr $C$DW$503, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    8382                      .dwattr $C$DW$503, DW_AT_accessibility(DW_ACCESS_public)
    8383              
    8384              $C$DW$504       .dwtag  DW_TAG_member
    8385                      .dwattr $C$DW$504, DW_AT_type(*$C$DW$T$37)
    8386                      .dwattr $C$DW$504, DW_AT_name("IndexSyncFlag")
TMS320C2000 Assembler PC v15.12.1 Tue Jul 04 11:13:55 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
IDDK_PM_Servo_F2837x.asm                                             PAGE  179

    8387                      .dwattr $C$DW$504, DW_AT_TI_symbol_name("_IndexSyncFlag")
    8388                      .dwattr $C$DW$504, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    8389                      .dwattr $C$DW$504, DW_AT_accessibility(DW_ACCESS_public)
    8390              
    8391                      .dwendtag $C$DW$T$46
    8392              
    8393              $C$DW$T$692     .dwtag  DW_TAG_typedef
    8394                      .dwattr $C$DW$T$692, DW_AT_name("QEP")
    8395                      .dwattr $C$DW$T$692, DW_AT_type(*$C$DW$T$46)
    8396                      .dwattr $C$DW$T$692, DW_AT_language(DW_LANG_C)
    8397              
    8398              
    8399              $C$DW$T$47      .dwtag  DW_TAG_structure_type
    8400                      .dwattr $C$DW$T$47, DW_AT_byte_size(0x10)
    8401              $C$DW$505       .dwtag  DW_TAG_member
    8402                      .dwattr $C$DW$505, DW_AT_type(*$C$DW$T$24)
    8403                      .dwattr $C$DW$505, DW_AT_name("ElecTheta")
    8404                      .dwattr $C$DW$505, DW_AT_TI_symbol_name("_ElecTheta")
    8405                      .dwattr $C$DW$505, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8406                      .dwattr $C$DW$505, DW_AT_accessibility(DW_ACCESS_public)
    8407              
    8408              $C$DW$506       .dwtag  DW_TAG_member
    8409                      .dwattr $C$DW$506, DW_AT_type(*$C$DW$T$24)
    8410                      .dwattr $C$DW$506, DW_AT_name("MechTheta")
    8411                      .dwattr $C$DW$506, DW_AT_TI_symbol_name("_MechTheta")
    8412                      .dwattr $C$DW$506, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8413                      .dwattr $C$DW$506, DW_AT_accessibility(DW_ACCESS_public)
    8414              
    8415              $C$DW$507       .dwtag  DW_TAG_member
    8416                      .dwattr $C$DW$507, DW_AT_type(*$C$DW$T$24)
    8417                      .dwattr $C$DW$507, DW_AT_name("RawTheta")
    8418                      .dwattr $C$DW$507, DW_AT_TI_symbol_name("_RawTheta")
    8419                      .dwattr $C$DW$507, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8420                      .dwattr $C$DW$507, DW_AT_accessibility(DW_ACCESS_public)
    8421              
    8422              $C$DW$508       .dwtag  DW_TAG_member
    8423                      .dwattr $C$DW$508, DW_AT_type(*$C$DW$T$24)
    8424                      .dwattr $C$DW$508, DW_AT_name("Speed")
    8425                      .dwattr $C$DW$508, DW_AT_TI_symbol_name("_Speed")
    8426                      .dwattr $C$DW$508, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    8427                      .dwattr $C$DW$508, DW_AT_accessibility(DW_ACCESS_public)
    8428              
    8429              $C$DW$509       .dwtag  DW_TAG_member
    8430                      .dwattr $C$DW$509, DW_AT_type(*$C$DW$T$24)
    8431                      .dwattr $C$DW$509, DW_AT_name("InitTheta")
    8432                      .dwattr $C$DW$509, DW_AT_TI_symbol_name("_InitTheta")
    8433                      .dwattr $C$DW$509, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8434                      .dwattr $C$DW$509, DW_AT_accessibility(DW_ACCESS_public)
    8435              
    8436              $C$DW$510       .dwtag  DW_TAG_member
    8437                      .dwattr $C$DW$510, DW_AT_type(*$C$DW$T$24)
    8438                      .dwattr $C$DW$510, DW_AT_name("MechScaler")
    8439                      .dwattr $C$DW$510, DW_AT_TI_symbol_name("_MechScaler")
    8440                      .dwattr $C$DW$510, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    8441                      .dwattr $C$DW$510, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.1 Tue Jul 04 11:13:55 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
IDDK_PM_Servo_F2837x.asm                                             PAGE  180

    8442              
    8443              $C$DW$511       .dwtag  DW_TAG_member
    8444                      .dwattr $C$DW$511, DW_AT_type(*$C$DW$T$24)
    8445                      .dwattr $C$DW$511, DW_AT_name("StepsPerTurn")
    8446                      .dwattr $C$DW$511, DW_AT_TI_symbol_name("_StepsPerTurn")
    8447                      .dwattr $C$DW$511, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    8448                      .dwattr $C$DW$511, DW_AT_accessibility(DW_ACCESS_public)
    8449              
    8450              $C$DW$512       .dwtag  DW_TAG_member
    8451                      .dwattr $C$DW$512, DW_AT_type(*$C$DW$T$37)
    8452                      .dwattr $C$DW$512, DW_AT_name("PolePairs")
    8453                      .dwattr $C$DW$512, DW_AT_TI_symbol_name("_PolePairs")
    8454                      .dwattr $C$DW$512, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    8455                      .dwattr $C$DW$512, DW_AT_accessibility(DW_ACCESS_public)
    8456              
    8457                      .dwendtag $C$DW$T$47
    8458              
    8459              $C$DW$T$694     .dwtag  DW_TAG_typedef
    8460                      .dwattr $C$DW$T$694, DW_AT_name("RESOLVER")
    8461                      .dwattr $C$DW$T$694, DW_AT_type(*$C$DW$T$47)
    8462                      .dwattr $C$DW$T$694, DW_AT_language(DW_LANG_C)
    8463              
    8464              $C$DW$513       .dwtag  DW_TAG_TI_far_type
    8465                      .dwattr $C$DW$513, DW_AT_type(*$C$DW$T$694)
    8466              
    8467              $C$DW$T$695     .dwtag  DW_TAG_volatile_type
    8468                      .dwattr $C$DW$T$695, DW_AT_type(*$C$DW$513)
    8469              
    8470              
    8471              $C$DW$T$48      .dwtag  DW_TAG_structure_type
    8472                      .dwattr $C$DW$T$48, DW_AT_byte_size(0x10)
    8473              $C$DW$514       .dwtag  DW_TAG_member
    8474                      .dwattr $C$DW$514, DW_AT_type(*$C$DW$T$24)
    8475                      .dwattr $C$DW$514, DW_AT_name("ElecTheta")
    8476                      .dwattr $C$DW$514, DW_AT_TI_symbol_name("_ElecTheta")
    8477                      .dwattr $C$DW$514, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8478                      .dwattr $C$DW$514, DW_AT_accessibility(DW_ACCESS_public)
    8479              
    8480              $C$DW$515       .dwtag  DW_TAG_member
    8481                      .dwattr $C$DW$515, DW_AT_type(*$C$DW$T$24)
    8482                      .dwattr $C$DW$515, DW_AT_name("MechTheta")
    8483                      .dwattr $C$DW$515, DW_AT_TI_symbol_name("_MechTheta")
    8484                      .dwattr $C$DW$515, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8485                      .dwattr $C$DW$515, DW_AT_accessibility(DW_ACCESS_public)
    8486              
    8487              $C$DW$516       .dwtag  DW_TAG_member
    8488                      .dwattr $C$DW$516, DW_AT_type(*$C$DW$T$24)
    8489                      .dwattr $C$DW$516, DW_AT_name("RawTheta")
    8490                      .dwattr $C$DW$516, DW_AT_TI_symbol_name("_RawTheta")
    8491                      .dwattr $C$DW$516, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8492                      .dwattr $C$DW$516, DW_AT_accessibility(DW_ACCESS_public)
    8493              
