TMS320C2000 Assembler PC v15.12.1 Wed Jul 12 17:46:37 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
IDDK_PM_Servo_F2837x.asm                                             PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                   PC v15.12.1.LTS *
       3              ;* Date/Time created: Wed Jul 12 17:46:36 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --cla_support=cla0 --float_support=fpu32 --hll_source=on --mem_model:cod
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../IDDK_PM_Servo_F2837x.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v15.12.1.LTS Copyright (c) 1996-201
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Keith\Documents\GitHub\ElectricSkateboard\Software\IDDK_PM
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *

    6963 000009de       $C$L32:    
    6964 000009de FE82          SUBB      SP,#2                 ; [CPU_U] 
    6965                      .dwcfi  cfa_offset, -2
    6966              $C$DW$362       .dwtag  DW_TAG_TI_branch
    6967                      .dwattr $C$DW$362, DW_AT_low_pc(0x00)
    6968                      .dwattr $C$DW$362, DW_AT_TI_return
    6969              
    6970 000009df 0006          LRETR     ; [CPU_] 
    6971                      ; return occurs ; [] 
    6972                      .dwattr $C$DW$357, DW_AT_TI_end_file("../IDDK_PM_Servo_F2837x.c")
    6973                      .dwattr $C$DW$357, DW_AT_TI_end_line(0xa32)
    6974                      .dwattr $C$DW$357, DW_AT_TI_end_column(0x01)
    6975                      .dwendentry
    6976                      .dwendtag $C$DW$357
    6977              
    6978              ;**************************************************************
    6979              ;* UNDEFINED EXTERNAL REFERENCES                              *
    6980              ;**************************************************************
    6981                      .global _ResolverISR
    6982                      .global _baseParamsInit
    6983                      .global _Sdfm_configureExternalreset
    6984                      .global _init_resolver_Float
    6985                      .global _derivParamsCal
    6986                      .global _InitPieCtrl
    6987                      .global _InitEPwm11Gpio
TMS320C2000 Assembler PC v15.12.1 Wed Jul 12 17:46:37 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
IDDK_PM_Servo_F2837x.asm                                             PAGE  152

    6988                      .global _InitSysCtrl
    6989                      .global _InitPieVectTable
    6990                      .global _InitFlash
    6991                      .global _InitEPwm2Gpio
    6992                      .global _InitEPwm1Gpio
    6993                      .global _InitEPwm4Gpio
    6994                      .global _InitEPwm3Gpio
    6995                      .global _InitEPwm5Gpio
    6996                      .global _Sdfm_configureComparator
    6997                      .global _Sdfm_configureInputCtrl
    6998                      .global _Sdfm_enableMFE
    6999                      .global _Sdfm_configureData_filter
    7000                      .global _GPIO_SetupPinOptions
    7001                      .global _GPIO_SetupPinMux
    7002                      .global _DLOG_4CH_F_init
    7003                      .global _F28x_usDelay
    7004                      .global _DLOG_4CH_F_FUNC
    7005                      .global _RamfuncsRunStart
    7006                      .global _RamfuncsLoadStart
    7007                      .global _RamfuncsLoadSize
    7008                      .global _SyncSocRegs
    7009                      .global _CpuTimer2Regs
    7010                      .global _DacaRegs
    7011                      .global _CpuTimer0Regs
    7012                      .global _CpuTimer1Regs
    7013                      .global _DacbRegs
    7014                      .global _rslvrIn
    7015                      .global _AdccResultRegs
    7016                      .global _AdcdResultRegs
    7017                      .global _AdcaResultRegs
    7018                      .global _AdcbResultRegs
    7019                      .global _PieCtrlRegs
    7020                      .global _Cmpss3Regs
    7021                      .global _Cmpss6Regs
    7022                      .global _Cmpss1Regs
    7023                      .global _Cmpss2Regs
    7024                      .global _EQep1Regs
    7025                      .global _EQep2Regs
    7026                      .global _rslvrOut
    7027                      .global _GpioDataRegs
    7028                      .global _EPwmXbarRegs
    7029                      .global _Sdfm2Regs
    7030                      .global _Sdfm1Regs
    7031                      .global _AdcdRegs
    7032                      .global _AdcbRegs
    7033                      .global _AdcaRegs
    7034                      .global _AdccRegs
    7035                      .global _CpuSysRegs
    7036                      .global _EPwm5Regs
    7037                      .global _EPwm4Regs
    7038                      .global _EPwm7Regs
    7039                      .global _EPwm2Regs
    7040                      .global _EPwm1Regs
    7041                      .global _EPwm6Regs
    7042                      .global _EPwm10Regs
TMS320C2000 Assembler PC v15.12.1 Wed Jul 12 17:46:37 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
IDDK_PM_Servo_F2837x.asm                                             PAGE  153

    7043                      .global _EPwm9Regs
    7044                      .global _EPwm11Regs
    7045                      .global _EPwm8Regs
    7046                      .global _EPwm12Regs
    7047                      .global _EPwm3Regs
    7048                      .global _PieVectTable
    7049                      .global _memcpy
    7050              
    7051              ;***************************************************************
    7052              ;* TYPE INFORMATION                                            *
    7053              ;***************************************************************
    7054              
    7055              $C$DW$T$22      .dwtag  DW_TAG_structure_type
    7056                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x1a)
    7057              $C$DW$363       .dwtag  DW_TAG_member
    7058                      .dwattr $C$DW$363, DW_AT_type(*$C$DW$T$20)
    7059                      .dwattr $C$DW$363, DW_AT_name("input_ptr1")
    7060                      .dwattr $C$DW$363, DW_AT_TI_symbol_name("_input_ptr1")
    7061                      .dwattr $C$DW$363, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7062                      .dwattr $C$DW$363, DW_AT_accessibility(DW_ACCESS_public)
    7063              
    7064              $C$DW$364       .dwtag  DW_TAG_member
    7065                      .dwattr $C$DW$364, DW_AT_type(*$C$DW$T$20)
    7066                      .dwattr $C$DW$364, DW_AT_name("input_ptr2")
    7067                      .dwattr $C$DW$364, DW_AT_TI_symbol_name("_input_ptr2")
    7068                      .dwattr $C$DW$364, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7069                      .dwattr $C$DW$364, DW_AT_accessibility(DW_ACCESS_public)
    7070              
    7071              $C$DW$365       .dwtag  DW_TAG_member
    7072                      .dwattr $C$DW$365, DW_AT_type(*$C$DW$T$20)
    7073                      .dwattr $C$DW$365, DW_AT_name("input_ptr3")
    7074                      .dwattr $C$DW$365, DW_AT_TI_symbol_name("_input_ptr3")
    7075                      .dwattr $C$DW$365, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7076                      .dwattr $C$DW$365, DW_AT_accessibility(DW_ACCESS_public)
    7077              
    7078              $C$DW$366       .dwtag  DW_TAG_member
    7079                      .dwattr $C$DW$366, DW_AT_type(*$C$DW$T$20)
    7080                      .dwattr $C$DW$366, DW_AT_name("input_ptr4")
    7081                      .dwattr $C$DW$366, DW_AT_TI_symbol_name("_input_ptr4")
    7082                      .dwattr $C$DW$366, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7083                      .dwattr $C$DW$366, DW_AT_accessibility(DW_ACCESS_public)
    7084              
    7085              $C$DW$367       .dwtag  DW_TAG_member
    7086                      .dwattr $C$DW$367, DW_AT_type(*$C$DW$T$20)
    7087                      .dwattr $C$DW$367, DW_AT_name("output_ptr1")
    7088                      .dwattr $C$DW$367, DW_AT_TI_symbol_name("_output_ptr1")
    7089                      .dwattr $C$DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7090                      .dwattr $C$DW$367, DW_AT_accessibility(DW_ACCESS_public)
    7091              
    7092              $C$DW$368       .dwtag  DW_TAG_member
    7093                      .dwattr $C$DW$368, DW_AT_type(*$C$DW$T$20)
    7094                      .dwattr $C$DW$368, DW_AT_name("output_ptr2")
    7095                      .dwattr $C$DW$368, DW_AT_TI_symbol_name("_output_ptr2")
    7096                      .dwattr $C$DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7097                      .dwattr $C$DW$368, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.1 Wed Jul 12 17:46:37 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
IDDK_PM_Servo_F2837x.asm                                             PAGE  154

    7098              
    7099              $C$DW$369       .dwtag  DW_TAG_member
    7100                      .dwattr $C$DW$369, DW_AT_type(*$C$DW$T$20)
    7101                      .dwattr $C$DW$369, DW_AT_name("output_ptr3")
    7102                      .dwattr $C$DW$369, DW_AT_TI_symbol_name("_output_ptr3")
    7103                      .dwattr $C$DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7104                      .dwattr $C$DW$369, DW_AT_accessibility(DW_ACCESS_public)
    7105              
    7106              $C$DW$370       .dwtag  DW_TAG_member
    7107                      .dwattr $C$DW$370, DW_AT_type(*$C$DW$T$20)
    7108                      .dwattr $C$DW$370, DW_AT_name("output_ptr4")
    7109                      .dwattr $C$DW$370, DW_AT_TI_symbol_name("_output_ptr4")
    7110                      .dwattr $C$DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    7111                      .dwattr $C$DW$370, DW_AT_accessibility(DW_ACCESS_public)
    7112              
    7113              $C$DW$371       .dwtag  DW_TAG_member
    7114                      .dwattr $C$DW$371, DW_AT_type(*$C$DW$T$19)
    7115                      .dwattr $C$DW$371, DW_AT_name("prev_value")
    7116                      .dwattr $C$DW$371, DW_AT_TI_symbol_name("_prev_value")
    7117                      .dwattr $C$DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    7118                      .dwattr $C$DW$371, DW_AT_accessibility(DW_ACCESS_public)
    7119              
    7120              $C$DW$372       .dwtag  DW_TAG_member
    7121                      .dwattr $C$DW$372, DW_AT_type(*$C$DW$T$19)
    7122                      .dwattr $C$DW$372, DW_AT_name("trig_value")
    7123                      .dwattr $C$DW$372, DW_AT_TI_symbol_name("_trig_value")
    7124                      .dwattr $C$DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    7125                      .dwattr $C$DW$372, DW_AT_accessibility(DW_ACCESS_public)
    7126              
    7127              $C$DW$373       .dwtag  DW_TAG_member
    7128                      .dwattr $C$DW$373, DW_AT_type(*$C$DW$T$21)
    7129                      .dwattr $C$DW$373, DW_AT_name("status")
    7130                      .dwattr $C$DW$373, DW_AT_TI_symbol_name("_status")
    7131                      .dwattr $C$DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    7132                      .dwattr $C$DW$373, DW_AT_accessibility(DW_ACCESS_public)
    7133              
    7134              $C$DW$374       .dwtag  DW_TAG_member
    7135                      .dwattr $C$DW$374, DW_AT_type(*$C$DW$T$21)
    7136                      .dwattr $C$DW$374, DW_AT_name("pre_scalar")
    7137                      .dwattr $C$DW$374, DW_AT_TI_symbol_name("_pre_scalar")
    7138                      .dwattr $C$DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    7139                      .dwattr $C$DW$374, DW_AT_accessibility(DW_ACCESS_public)
    7140              
    7141              $C$DW$375       .dwtag  DW_TAG_member
    7142                      .dwattr $C$DW$375, DW_AT_type(*$C$DW$T$21)
    7143                      .dwattr $C$DW$375, DW_AT_name("skip_count")
    7144                      .dwattr $C$DW$375, DW_AT_TI_symbol_name("_skip_count")
    7145                      .dwattr $C$DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    7146                      .dwattr $C$DW$375, DW_AT_accessibility(DW_ACCESS_public)
    7147              
    7148              $C$DW$376       .dwtag  DW_TAG_member
    7149                      .dwattr $C$DW$376, DW_AT_type(*$C$DW$T$21)
    7150                      .dwattr $C$DW$376, DW_AT_name("size")
    7151                      .dwattr $C$DW$376, DW_AT_TI_symbol_name("_size")
    7152                      .dwattr $C$DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
TMS320C2000 Assembler PC v15.12.1 Wed Jul 12 17:46:37 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
IDDK_PM_Servo_F2837x.asm                                             PAGE  155

    7153                      .dwattr $C$DW$376, DW_AT_accessibility(DW_ACCESS_public)
    7154              
    7155              $C$DW$377       .dwtag  DW_TAG_member
    7156                      .dwattr $C$DW$377, DW_AT_type(*$C$DW$T$21)
    7157                      .dwattr $C$DW$377, DW_AT_name("count")
    7158                      .dwattr $C$DW$377, DW_AT_TI_symbol_name("_count")
    7159                      .dwattr $C$DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    7160                      .dwattr $C$DW$377, DW_AT_accessibility(DW_ACCESS_public)
    7161              
    7162                      .dwendtag $C$DW$T$22
    7163              
    7164              $C$DW$T$676     .dwtag  DW_TAG_typedef
    7165                      .dwattr $C$DW$T$676, DW_AT_name("DLOG_4CH_F")
    7166                      .dwattr $C$DW$T$676, DW_AT_type(*$C$DW$T$22)
    7167                      .dwattr $C$DW$T$676, DW_AT_language(DW_LANG_C)
    7168              
    7169              $C$DW$T$677     .dwtag  DW_TAG_pointer_type
    7170                      .dwattr $C$DW$T$677, DW_AT_type(*$C$DW$T$676)
    7171                      .dwattr $C$DW$T$677, DW_AT_address_class(0x20)
    7172              
    7173              
    7174              $C$DW$T$24      .dwtag  DW_TAG_structure_type
    7175                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x14)
    7176              $C$DW$378       .dwtag  DW_TAG_member
    7177                      .dwattr $C$DW$378, DW_AT_type(*$C$DW$T$23)
    7178                      .dwattr $C$DW$378, DW_AT_name("firLag")
    7179                      .dwattr $C$DW$378, DW_AT_TI_symbol_name("_firLag")
    7180                      .dwattr $C$DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7181                      .dwattr $C$DW$378, DW_AT_accessibility(DW_ACCESS_public)
    7182              
    7183              $C$DW$379       .dwtag  DW_TAG_member
    7184                      .dwattr $C$DW$379, DW_AT_type(*$C$DW$T$23)
    7185                      .dwattr $C$DW$379, DW_AT_name("FIR32")
    7186                      .dwattr $C$DW$379, DW_AT_TI_symbol_name("_FIR32")
    7187                      .dwattr $C$DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7188                      .dwattr $C$DW$379, DW_AT_accessibility(DW_ACCESS_public)
    7189              
    7190              $C$DW$380       .dwtag  DW_TAG_member
    7191                      .dwattr $C$DW$380, DW_AT_type(*$C$DW$T$23)
    7192                      .dwattr $C$DW$380, DW_AT_name("TUNING")
    7193                      .dwattr $C$DW$380, DW_AT_TI_symbol_name("_TUNING")
    7194                      .dwattr $C$DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7195                      .dwattr $C$DW$380, DW_AT_accessibility(DW_ACCESS_public)
    7196              
    7197              $C$DW$381       .dwtag  DW_TAG_member
    7198                      .dwattr $C$DW$381, DW_AT_type(*$C$DW$T$23)
    7199                      .dwattr $C$DW$381, DW_AT_name("TABLE_LENGTH")
    7200                      .dwattr $C$DW$381, DW_AT_TI_symbol_name("_TABLE_LENGTH")
    7201                      .dwattr $C$DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    7202                      .dwattr $C$DW$381, DW_AT_accessibility(DW_ACCESS_public)
    7203              
    7204              $C$DW$382       .dwtag  DW_TAG_member
    7205                      .dwattr $C$DW$382, DW_AT_type(*$C$DW$T$16)
    7206                      .dwattr $C$DW$382, DW_AT_name("offsetS")
    7207                      .dwattr $C$DW$382, DW_AT_TI_symbol_name("_offsetS")
TMS320C2000 Assembler PC v15.12.1 Wed Jul 12 17:46:37 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
IDDK_PM_Servo_F2837x.asm                                             PAGE  156

    7208                      .dwattr $C$DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7209                      .dwattr $C$DW$382, DW_AT_accessibility(DW_ACCESS_public)
    7210              
    7211              $C$DW$383       .dwtag  DW_TAG_member
    7212                      .dwattr $C$DW$383, DW_AT_type(*$C$DW$T$16)
    7213                      .dwattr $C$DW$383, DW_AT_name("offsetC")
    7214                      .dwattr $C$DW$383, DW_AT_TI_symbol_name("_offsetC")
    7215                      .dwattr $C$DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7216                      .dwattr $C$DW$383, DW_AT_accessibility(DW_ACCESS_public)
    7217              
    7218              $C$DW$384       .dwtag  DW_TAG_member
    7219                      .dwattr $C$DW$384, DW_AT_type(*$C$DW$T$16)
    7220                      .dwattr $C$DW$384, DW_AT_name("testAngle")
    7221                      .dwattr $C$DW$384, DW_AT_TI_symbol_name("_testAngle")
    7222                      .dwattr $C$DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7223                      .dwattr $C$DW$384, DW_AT_accessibility(DW_ACCESS_public)
    7224              
    7225              $C$DW$385       .dwtag  DW_TAG_member
    7226                      .dwattr $C$DW$385, DW_AT_type(*$C$DW$T$16)
    7227                      .dwattr $C$DW$385, DW_AT_name("SAMPLING_TIME")
    7228                      .dwattr $C$DW$385, DW_AT_TI_symbol_name("_SAMPLING_TIME")
    7229                      .dwattr $C$DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7230                      .dwattr $C$DW$385, DW_AT_accessibility(DW_ACCESS_public)
    7231              
    7232              $C$DW$386       .dwtag  DW_TAG_member
    7233                      .dwattr $C$DW$386, DW_AT_type(*$C$DW$T$16)
    7234                      .dwattr $C$DW$386, DW_AT_name("errorWfT")
    7235                      .dwattr $C$DW$386, DW_AT_TI_symbol_name("_errorWfT")
    7236                      .dwattr $C$DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7237                      .dwattr $C$DW$386, DW_AT_accessibility(DW_ACCESS_public)
    7238              
    7239              $C$DW$387       .dwtag  DW_TAG_member
    7240                      .dwattr $C$DW$387, DW_AT_type(*$C$DW$T$16)
    7241                      .dwattr $C$DW$387, DW_AT_name("picon_K0")
    7242                      .dwattr $C$DW$387, DW_AT_TI_symbol_name("_picon_K0")
    7243                      .dwattr $C$DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    7244                      .dwattr $C$DW$387, DW_AT_accessibility(DW_ACCESS_public)
    7245              
    7246              $C$DW$388       .dwtag  DW_TAG_member
    7247                      .dwattr $C$DW$388, DW_AT_type(*$C$DW$T$16)
    7248                      .dwattr $C$DW$388, DW_AT_name("picon_K1")
    7249                      .dwattr $C$DW$388, DW_AT_TI_symbol_name("_picon_K1")
    7250                      .dwattr $C$DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    7251                      .dwattr $C$DW$388, DW_AT_accessibility(DW_ACCESS_public)
    7252              
    7253              $C$DW$389       .dwtag  DW_TAG_member
    7254                      .dwattr $C$DW$389, DW_AT_type(*$C$DW$T$16)
    7255                      .dwattr $C$DW$389, DW_AT_name("rpsMax")
    7256                      .dwattr $C$DW$389, DW_AT_TI_symbol_name("_rpsMax")
    7257                      .dwattr $C$DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    7258                      .dwattr $C$DW$389, DW_AT_accessibility(DW_ACCESS_public)
    7259              
    7260                      .dwendtag $C$DW$T$24
    7261              
    7262              $C$DW$T$679     .dwtag  DW_TAG_typedef
TMS320C2000 Assembler PC v15.12.1 Wed Jul 12 17:46:37 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
IDDK_PM_Servo_F2837x.asm                                             PAGE  157

    7263                      .dwattr $C$DW$T$679, DW_AT_name("RESOLVER_INPUT")
    7264                      .dwattr $C$DW$T$679, DW_AT_type(*$C$DW$T$24)
    7265                      .dwattr $C$DW$T$679, DW_AT_language(DW_LANG_C)
    7266              
    7267              
    7268              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    7269                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x22)
    7270              $C$DW$390       .dwtag  DW_TAG_member
    7271                      .dwattr $C$DW$390, DW_AT_type(*$C$DW$T$16)
    7272                      .dwattr $C$DW$390, DW_AT_name("angleRaw")
    7273                      .dwattr $C$DW$390, DW_AT_TI_symbol_name("_angleRaw")
    7274                      .dwattr $C$DW$390, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7275                      .dwattr $C$DW$390, DW_AT_accessibility(DW_ACCESS_public)
    7276              
    7277              $C$DW$391       .dwtag  DW_TAG_member
    7278                      .dwattr $C$DW$391, DW_AT_type(*$C$DW$T$16)
    7279                      .dwattr $C$DW$391, DW_AT_name("angleObs")
    7280                      .dwattr $C$DW$391, DW_AT_TI_symbol_name("_angleObs")
    7281                      .dwattr $C$DW$391, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7282                      .dwattr $C$DW$391, DW_AT_accessibility(DW_ACCESS_public)
    7283              
    7284              $C$DW$392       .dwtag  DW_TAG_member
    7285                      .dwattr $C$DW$392, DW_AT_type(*$C$DW$T$16)
    7286                      .dwattr $C$DW$392, DW_AT_name("angleOut")
    7287                      .dwattr $C$DW$392, DW_AT_TI_symbol_name("_angleOut")
    7288                      .dwattr $C$DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7289                      .dwattr $C$DW$392, DW_AT_accessibility(DW_ACCESS_public)
    7290              
    7291              $C$DW$393       .dwtag  DW_TAG_member
    7292                      .dwattr $C$DW$393, DW_AT_type(*$C$DW$T$16)
    7293                      .dwattr $C$DW$393, DW_AT_name("rpsObs")
    7294                      .dwattr $C$DW$393, DW_AT_TI_symbol_name("_rpsObs")
    7295                      .dwattr $C$DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7296                      .dwattr $C$DW$393, DW_AT_accessibility(DW_ACCESS_public)
    7297              
    7298              $C$DW$394       .dwtag  DW_TAG_member
    7299                      .dwattr $C$DW$394, DW_AT_type(*$C$DW$T$16)
    7300                      .dwattr $C$DW$394, DW_AT_name("errorNew")
    7301                      .dwattr $C$DW$394, DW_AT_TI_symbol_name("_errorNew")
    7302                      .dwattr $C$DW$394, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7303                      .dwattr $C$DW$394, DW_AT_accessibility(DW_ACCESS_public)
    7304              
    7305              $C$DW$395       .dwtag  DW_TAG_member
    7306                      .dwattr $C$DW$395, DW_AT_type(*$C$DW$T$16)
    7307                      .dwattr $C$DW$395, DW_AT_name("resMag")
    7308                      .dwattr $C$DW$395, DW_AT_TI_symbol_name("_resMag")
    7309                      .dwattr $C$DW$395, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7310                      .dwattr $C$DW$395, DW_AT_accessibility(DW_ACCESS_public)
    7311              
    7312              $C$DW$396       .dwtag  DW_TAG_member
    7313                      .dwattr $C$DW$396, DW_AT_type(*$C$DW$T$16)
    7314                      .dwattr $C$DW$396, DW_AT_name("sinFIRout")
    7315                      .dwattr $C$DW$396, DW_AT_TI_symbol_name("_sinFIRout")
    7316                      .dwattr $C$DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7317                      .dwattr $C$DW$396, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.1 Wed Jul 12 17:46:37 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
IDDK_PM_Servo_F2837x.asm                                             PAGE  158

    7318              
    7319              $C$DW$397       .dwtag  DW_TAG_member
    7320                      .dwattr $C$DW$397, DW_AT_type(*$C$DW$T$16)
    7321                      .dwattr $C$DW$397, DW_AT_name("cosFIRout")
    7322                      .dwattr $C$DW$397, DW_AT_TI_symbol_name("_cosFIRout")
    7323                      .dwattr $C$DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    7324                      .dwattr $C$DW$397, DW_AT_accessibility(DW_ACCESS_public)
    7325              
    7326              $C$DW$398       .dwtag  DW_TAG_member
    7327                      .dwattr $C$DW$398, DW_AT_type(*$C$DW$T$25)
    7328                      .dwattr $C$DW$398, DW_AT_name("angleRaw20")
    7329                      .dwattr $C$DW$398, DW_AT_TI_symbol_name("_angleRaw20")
    7330                      .dwattr $C$DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    7331                      .dwattr $C$DW$398, DW_AT_accessibility(DW_ACCESS_public)
    7332              
    7333              $C$DW$399       .dwtag  DW_TAG_member
    7334                      .dwattr $C$DW$399, DW_AT_type(*$C$DW$T$25)
    7335                      .dwattr $C$DW$399, DW_AT_name("angleObs20")
    7336                      .dwattr $C$DW$399, DW_AT_TI_symbol_name("_angleObs20")
    7337                      .dwattr $C$DW$399, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    7338                      .dwattr $C$DW$399, DW_AT_accessibility(DW_ACCESS_public)
    7339              
    7340              $C$DW$400       .dwtag  DW_TAG_member
    7341                      .dwattr $C$DW$400, DW_AT_type(*$C$DW$T$25)
    7342                      .dwattr $C$DW$400, DW_AT_name("angleOut20")
    7343                      .dwattr $C$DW$400, DW_AT_TI_symbol_name("_angleOut20")
    7344                      .dwattr $C$DW$400, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    7345                      .dwattr $C$DW$400, DW_AT_accessibility(DW_ACCESS_public)
    7346              
    7347              $C$DW$401       .dwtag  DW_TAG_member
    7348                      .dwattr $C$DW$401, DW_AT_type(*$C$DW$T$25)
    7349                      .dwattr $C$DW$401, DW_AT_name("rpsObs20")
    7350                      .dwattr $C$DW$401, DW_AT_TI_symbol_name("_rpsObs20")
    7351                      .dwattr $C$DW$401, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    7352                      .dwattr $C$DW$401, DW_AT_accessibility(DW_ACCESS_public)
    7353              
    7354              $C$DW$402       .dwtag  DW_TAG_member
    7355                      .dwattr $C$DW$402, DW_AT_type(*$C$DW$T$25)
    7356                      .dwattr $C$DW$402, DW_AT_name("errorNew20")
    7357                      .dwattr $C$DW$402, DW_AT_TI_symbol_name("_errorNew20")
    7358                      .dwattr $C$DW$402, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    7359                      .dwattr $C$DW$402, DW_AT_accessibility(DW_ACCESS_public)
    7360              
    7361              $C$DW$403       .dwtag  DW_TAG_member
    7362                      .dwattr $C$DW$403, DW_AT_type(*$C$DW$T$25)
    7363                      .dwattr $C$DW$403, DW_AT_name("resMag20")
    7364                      .dwattr $C$DW$403, DW_AT_TI_symbol_name("_resMag20")
    7365                      .dwattr $C$DW$403, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    7366                      .dwattr $C$DW$403, DW_AT_accessibility(DW_ACCESS_public)
    7367              
    7368              $C$DW$404       .dwtag  DW_TAG_member
    7369                      .dwattr $C$DW$404, DW_AT_type(*$C$DW$T$16)
    7370                      .dwattr $C$DW$404, DW_AT_name("sin_input")
    7371                      .dwattr $C$DW$404, DW_AT_TI_symbol_name("_sin_input")
    7372                      .dwattr $C$DW$404, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
TMS320C2000 Assembler PC v15.12.1 Wed Jul 12 17:46:37 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
IDDK_PM_Servo_F2837x.asm                                             PAGE  159

    7373                      .dwattr $C$DW$404, DW_AT_accessibility(DW_ACCESS_public)
    7374              
    7375              $C$DW$405       .dwtag  DW_TAG_member
    7376                      .dwattr $C$DW$405, DW_AT_type(*$C$DW$T$16)
    7377                      .dwattr $C$DW$405, DW_AT_name("cos_input")
    7378                      .dwattr $C$DW$405, DW_AT_TI_symbol_name("_cos_input")
    7379                      .dwattr $C$DW$405, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    7380                      .dwattr $C$DW$405, DW_AT_accessibility(DW_ACCESS_public)
    7381              
    7382              $C$DW$406       .dwtag  DW_TAG_member
    7383                      .dwattr $C$DW$406, DW_AT_type(*$C$DW$T$23)
    7384                      .dwattr $C$DW$406, DW_AT_name("sineIndex")
    7385                      .dwattr $C$DW$406, DW_AT_TI_symbol_name("_sineIndex")
    7386                      .dwattr $C$DW$406, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    7387                      .dwattr $C$DW$406, DW_AT_accessibility(DW_ACCESS_public)
    7388              
    7389                      .dwendtag $C$DW$T$26
    7390              
    7391              $C$DW$T$680     .dwtag  DW_TAG_typedef
    7392                      .dwattr $C$DW$T$680, DW_AT_name("RESOLVER_OUTPUT")
    7393                      .dwattr $C$DW$T$680, DW_AT_type(*$C$DW$T$26)
    7394                      .dwattr $C$DW$T$680, DW_AT_language(DW_LANG_C)
    7395              
    7396              
    7397              $C$DW$T$27      .dwtag  DW_TAG_structure_type
    7398                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x06)
    7399              $C$DW$407       .dwtag  DW_TAG_member
    7400                      .dwattr $C$DW$407, DW_AT_type(*$C$DW$T$16)
    7401                      .dwattr $C$DW$407, DW_AT_name("As")
    7402                      .dwattr $C$DW$407, DW_AT_TI_symbol_name("_As")
    7403                      .dwattr $C$DW$407, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7404                      .dwattr $C$DW$407, DW_AT_accessibility(DW_ACCESS_public)
    7405              
    7406              $C$DW$408       .dwtag  DW_TAG_member
    7407                      .dwattr $C$DW$408, DW_AT_type(*$C$DW$T$16)
    7408                      .dwattr $C$DW$408, DW_AT_name("Bs")
    7409                      .dwattr $C$DW$408, DW_AT_TI_symbol_name("_Bs")
    7410                      .dwattr $C$DW$408, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7411                      .dwattr $C$DW$408, DW_AT_accessibility(DW_ACCESS_public)
    7412              
    7413              $C$DW$409       .dwtag  DW_TAG_member
    7414                      .dwattr $C$DW$409, DW_AT_type(*$C$DW$T$16)
    7415                      .dwattr $C$DW$409, DW_AT_name("Cs")
    7416                      .dwattr $C$DW$409, DW_AT_TI_symbol_name("_Cs")
    7417                      .dwattr $C$DW$409, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7418                      .dwattr $C$DW$409, DW_AT_accessibility(DW_ACCESS_public)
    7419              
    7420                      .dwendtag $C$DW$T$27
    7421              
    7422              $C$DW$T$681     .dwtag  DW_TAG_typedef
    7423                      .dwattr $C$DW$T$681, DW_AT_name("CURRENT_SENSOR")
    7424                      .dwattr $C$DW$T$681, DW_AT_type(*$C$DW$T$27)
    7425                      .dwattr $C$DW$T$681, DW_AT_language(DW_LANG_C)
    7426              
    7427              
TMS320C2000 Assembler PC v15.12.1 Wed Jul 12 17:46:37 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
IDDK_PM_Servo_F2837x.asm                                             PAGE  160

    7428              $C$DW$T$682     .dwtag  DW_TAG_array_type
    7429                      .dwattr $C$DW$T$682, DW_AT_type(*$C$DW$T$681)
    7430                      .dwattr $C$DW$T$682, DW_AT_language(DW_LANG_C)
    7431                      .dwattr $C$DW$T$682, DW_AT_byte_size(0x12)
    7432              $C$DW$410       .dwtag  DW_TAG_subrange_type
    7433                      .dwattr $C$DW$410, DW_AT_upper_bound(0x02)
    7434              
    7435                      .dwendtag $C$DW$T$682
    7436              
    7437              
    7438              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    7439                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x0a)
    7440              $C$DW$411       .dwtag  DW_TAG_member
    7441                      .dwattr $C$DW$411, DW_AT_type(*$C$DW$T$28)
    7442                      .dwattr $C$DW$411, DW_AT_name("As")
    7443                      .dwattr $C$DW$411, DW_AT_TI_symbol_name("_As")
    7444                      .dwattr $C$DW$411, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7445                      .dwattr $C$DW$411, DW_AT_accessibility(DW_ACCESS_public)
    7446              
    7447              $C$DW$412       .dwtag  DW_TAG_member
    7448                      .dwattr $C$DW$412, DW_AT_type(*$C$DW$T$28)
    7449                      .dwattr $C$DW$412, DW_AT_name("Bs")
    7450                      .dwattr $C$DW$412, DW_AT_TI_symbol_name("_Bs")
    7451                      .dwattr $C$DW$412, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7452                      .dwattr $C$DW$412, DW_AT_accessibility(DW_ACCESS_public)
    7453              
    7454              $C$DW$413       .dwtag  DW_TAG_member
    7455                      .dwattr $C$DW$413, DW_AT_type(*$C$DW$T$28)
    7456                      .dwattr $C$DW$413, DW_AT_name("Cs")
    7457                      .dwattr $C$DW$413, DW_AT_TI_symbol_name("_Cs")
    7458                      .dwattr $C$DW$413, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7459                      .dwattr $C$DW$413, DW_AT_accessibility(DW_ACCESS_public)
    7460              
    7461              $C$DW$414       .dwtag  DW_TAG_member
    7462                      .dwattr $C$DW$414, DW_AT_type(*$C$DW$T$28)
    7463                      .dwattr $C$DW$414, DW_AT_name("Alpha")
    7464                      .dwattr $C$DW$414, DW_AT_TI_symbol_name("_Alpha")
    7465                      .dwattr $C$DW$414, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7466                      .dwattr $C$DW$414, DW_AT_accessibility(DW_ACCESS_public)
    7467              
    7468              $C$DW$415       .dwtag  DW_TAG_member
    7469                      .dwattr $C$DW$415, DW_AT_type(*$C$DW$T$28)
    7470                      .dwattr $C$DW$415, DW_AT_name("Beta")
    7471                      .dwattr $C$DW$415, DW_AT_TI_symbol_name("_Beta")
    7472                      .dwattr $C$DW$415, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7473                      .dwattr $C$DW$415, DW_AT_accessibility(DW_ACCESS_public)
    7474              
    7475                      .dwendtag $C$DW$T$29
    7476              
    7477              $C$DW$T$683     .dwtag  DW_TAG_typedef
    7478                      .dwattr $C$DW$T$683, DW_AT_name("CLARKE")
    7479                      .dwattr $C$DW$T$683, DW_AT_type(*$C$DW$T$29)
    7480                      .dwattr $C$DW$T$683, DW_AT_language(DW_LANG_C)
    7481              
    7482              
TMS320C2000 Assembler PC v15.12.1 Wed Jul 12 17:46:37 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
IDDK_PM_Servo_F2837x.asm                                             PAGE  161

    7483              $C$DW$T$30      .dwtag  DW_TAG_structure_type
    7484                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x0e)
    7485              $C$DW$416       .dwtag  DW_TAG_member
    7486                      .dwattr $C$DW$416, DW_AT_type(*$C$DW$T$28)
    7487                      .dwattr $C$DW$416, DW_AT_name("Alpha")
    7488                      .dwattr $C$DW$416, DW_AT_TI_symbol_name("_Alpha")
    7489                      .dwattr $C$DW$416, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7490                      .dwattr $C$DW$416, DW_AT_accessibility(DW_ACCESS_public)
    7491              
    7492              $C$DW$417       .dwtag  DW_TAG_member
    7493                      .dwattr $C$DW$417, DW_AT_type(*$C$DW$T$28)
    7494                      .dwattr $C$DW$417, DW_AT_name("Beta")
    7495                      .dwattr $C$DW$417, DW_AT_TI_symbol_name("_Beta")
    7496                      .dwattr $C$DW$417, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7497                      .dwattr $C$DW$417, DW_AT_accessibility(DW_ACCESS_public)
    7498              
    7499              $C$DW$418       .dwtag  DW_TAG_member
    7500                      .dwattr $C$DW$418, DW_AT_type(*$C$DW$T$28)
    7501                      .dwattr $C$DW$418, DW_AT_name("Angle")
    7502                      .dwattr $C$DW$418, DW_AT_TI_symbol_name("_Angle")
    7503                      .dwattr $C$DW$418, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7504                      .dwattr $C$DW$418, DW_AT_accessibility(DW_ACCESS_public)
    7505              
    7506              $C$DW$419       .dwtag  DW_TAG_member
    7507                      .dwattr $C$DW$419, DW_AT_type(*$C$DW$T$28)
    7508                      .dwattr $C$DW$419, DW_AT_name("Ds")
    7509                      .dwattr $C$DW$419, DW_AT_TI_symbol_name("_Ds")
    7510                      .dwattr $C$DW$419, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7511                      .dwattr $C$DW$419, DW_AT_accessibility(DW_ACCESS_public)
    7512              
    7513              $C$DW$420       .dwtag  DW_TAG_member
    7514                      .dwattr $C$DW$420, DW_AT_type(*$C$DW$T$28)
    7515                      .dwattr $C$DW$420, DW_AT_name("Qs")
    7516                      .dwattr $C$DW$420, DW_AT_TI_symbol_name("_Qs")
    7517                      .dwattr $C$DW$420, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7518                      .dwattr $C$DW$420, DW_AT_accessibility(DW_ACCESS_public)
    7519              
    7520              $C$DW$421       .dwtag  DW_TAG_member
    7521                      .dwattr $C$DW$421, DW_AT_type(*$C$DW$T$28)
    7522                      .dwattr $C$DW$421, DW_AT_name("Sine")
    7523                      .dwattr $C$DW$421, DW_AT_TI_symbol_name("_Sine")
    7524                      .dwattr $C$DW$421, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7525                      .dwattr $C$DW$421, DW_AT_accessibility(DW_ACCESS_public)
    7526              
    7527              $C$DW$422       .dwtag  DW_TAG_member
    7528                      .dwattr $C$DW$422, DW_AT_type(*$C$DW$T$28)
    7529                      .dwattr $C$DW$422, DW_AT_name("Cosine")
    7530                      .dwattr $C$DW$422, DW_AT_TI_symbol_name("_Cosine")
    7531                      .dwattr $C$DW$422, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7532                      .dwattr $C$DW$422, DW_AT_accessibility(DW_ACCESS_public)
    7533              
    7534                      .dwendtag $C$DW$T$30
    7535              
    7536              $C$DW$T$684     .dwtag  DW_TAG_typedef
    7537                      .dwattr $C$DW$T$684, DW_AT_name("PARK")
TMS320C2000 Assembler PC v15.12.1 Wed Jul 12 17:46:37 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
IDDK_PM_Servo_F2837x.asm                                             PAGE  162

    7538                      .dwattr $C$DW$T$684, DW_AT_type(*$C$DW$T$30)
    7539                      .dwattr $C$DW$T$684, DW_AT_language(DW_LANG_C)
    7540              
    7541              
    7542              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    7543                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x0e)
    7544              $C$DW$423       .dwtag  DW_TAG_member
    7545                      .dwattr $C$DW$423, DW_AT_type(*$C$DW$T$28)
    7546                      .dwattr $C$DW$423, DW_AT_name("Alpha")
    7547                      .dwattr $C$DW$423, DW_AT_TI_symbol_name("_Alpha")
    7548                      .dwattr $C$DW$423, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7549                      .dwattr $C$DW$423, DW_AT_accessibility(DW_ACCESS_public)
    7550              
    7551              $C$DW$424       .dwtag  DW_TAG_member
    7552                      .dwattr $C$DW$424, DW_AT_type(*$C$DW$T$28)
    7553                      .dwattr $C$DW$424, DW_AT_name("Beta")
    7554                      .dwattr $C$DW$424, DW_AT_TI_symbol_name("_Beta")
    7555                      .dwattr $C$DW$424, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7556                      .dwattr $C$DW$424, DW_AT_accessibility(DW_ACCESS_public)
    7557              
    7558              $C$DW$425       .dwtag  DW_TAG_member
    7559                      .dwattr $C$DW$425, DW_AT_type(*$C$DW$T$28)
    7560                      .dwattr $C$DW$425, DW_AT_name("Angle")
    7561                      .dwattr $C$DW$425, DW_AT_TI_symbol_name("_Angle")
    7562                      .dwattr $C$DW$425, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7563                      .dwattr $C$DW$425, DW_AT_accessibility(DW_ACCESS_public)
    7564              
    7565              $C$DW$426       .dwtag  DW_TAG_member
    7566                      .dwattr $C$DW$426, DW_AT_type(*$C$DW$T$28)
    7567                      .dwattr $C$DW$426, DW_AT_name("Ds")
    7568                      .dwattr $C$DW$426, DW_AT_TI_symbol_name("_Ds")
    7569                      .dwattr $C$DW$426, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7570                      .dwattr $C$DW$426, DW_AT_accessibility(DW_ACCESS_public)
    7571              
    7572              $C$DW$427       .dwtag  DW_TAG_member
    7573                      .dwattr $C$DW$427, DW_AT_type(*$C$DW$T$28)
    7574                      .dwattr $C$DW$427, DW_AT_name("Qs")
    7575                      .dwattr $C$DW$427, DW_AT_TI_symbol_name("_Qs")
    7576                      .dwattr $C$DW$427, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7577                      .dwattr $C$DW$427, DW_AT_accessibility(DW_ACCESS_public)
    7578              
    7579              $C$DW$428       .dwtag  DW_TAG_member
    7580                      .dwattr $C$DW$428, DW_AT_type(*$C$DW$T$28)
    7581                      .dwattr $C$DW$428, DW_AT_name("Sine")
    7582                      .dwattr $C$DW$428, DW_AT_TI_symbol_name("_Sine")
    7583                      .dwattr $C$DW$428, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7584                      .dwattr $C$DW$428, DW_AT_accessibility(DW_ACCESS_public)
    7585              
    7586              $C$DW$429       .dwtag  DW_TAG_member
    7587                      .dwattr $C$DW$429, DW_AT_type(*$C$DW$T$28)
    7588                      .dwattr $C$DW$429, DW_AT_name("Cosine")
    7589                      .dwattr $C$DW$429, DW_AT_TI_symbol_name("_Cosine")
    7590                      .dwattr $C$DW$429, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7591                      .dwattr $C$DW$429, DW_AT_accessibility(DW_ACCESS_public)
    7592              
TMS320C2000 Assembler PC v15.12.1 Wed Jul 12 17:46:37 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
IDDK_PM_Servo_F2837x.asm                                             PAGE  163

    7593                      .dwendtag $C$DW$T$31
    7594              
    7595              $C$DW$T$685     .dwtag  DW_TAG_typedef
    7596                      .dwattr $C$DW$T$685, DW_AT_name("IPARK")
    7597                      .dwattr $C$DW$T$685, DW_AT_type(*$C$DW$T$31)
    7598                      .dwattr $C$DW$T$685, DW_AT_language(DW_LANG_C)
    7599              
    7600              
    7601              $C$DW$T$32      .dwtag  DW_TAG_structure_type
    7602                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x20)
    7603              $C$DW$430       .dwtag  DW_TAG_member
    7604                      .dwattr $C$DW$430, DW_AT_type(*$C$DW$T$28)
    7605                      .dwattr $C$DW$430, DW_AT_name("Ref")
    7606                      .dwattr $C$DW$430, DW_AT_TI_symbol_name("_Ref")
    7607                      .dwattr $C$DW$430, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7608                      .dwattr $C$DW$430, DW_AT_accessibility(DW_ACCESS_public)
    7609              
    7610              $C$DW$431       .dwtag  DW_TAG_member
    7611                      .dwattr $C$DW$431, DW_AT_type(*$C$DW$T$28)
    7612                      .dwattr $C$DW$431, DW_AT_name("Fdb")
    7613                      .dwattr $C$DW$431, DW_AT_TI_symbol_name("_Fdb")
    7614                      .dwattr $C$DW$431, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7615                      .dwattr $C$DW$431, DW_AT_accessibility(DW_ACCESS_public)
    7616              
    7617              $C$DW$432       .dwtag  DW_TAG_member
    7618                      .dwattr $C$DW$432, DW_AT_type(*$C$DW$T$28)
    7619                      .dwattr $C$DW$432, DW_AT_name("Err")
    7620                      .dwattr $C$DW$432, DW_AT_TI_symbol_name("_Err")
    7621                      .dwattr $C$DW$432, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7622                      .dwattr $C$DW$432, DW_AT_accessibility(DW_ACCESS_public)
    7623              
    7624              $C$DW$433       .dwtag  DW_TAG_member
    7625                      .dwattr $C$DW$433, DW_AT_type(*$C$DW$T$28)
    7626                      .dwattr $C$DW$433, DW_AT_name("Kp")
    7627                      .dwattr $C$DW$433, DW_AT_TI_symbol_name("_Kp")
    7628                      .dwattr $C$DW$433, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7629                      .dwattr $C$DW$433, DW_AT_accessibility(DW_ACCESS_public)
    7630              
    7631              $C$DW$434       .dwtag  DW_TAG_member
    7632                      .dwattr $C$DW$434, DW_AT_type(*$C$DW$T$28)
    7633                      .dwattr $C$DW$434, DW_AT_name("Up")
    7634                      .dwattr $C$DW$434, DW_AT_TI_symbol_name("_Up")
    7635                      .dwattr $C$DW$434, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7636                      .dwattr $C$DW$434, DW_AT_accessibility(DW_ACCESS_public)
    7637              
    7638              $C$DW$435       .dwtag  DW_TAG_member
    7639                      .dwattr $C$DW$435, DW_AT_type(*$C$DW$T$28)
    7640                      .dwattr $C$DW$435, DW_AT_name("Ui")
    7641                      .dwattr $C$DW$435, DW_AT_TI_symbol_name("_Ui")
    7642                      .dwattr $C$DW$435, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7643                      .dwattr $C$DW$435, DW_AT_accessibility(DW_ACCESS_public)
    7644              
    7645              $C$DW$436       .dwtag  DW_TAG_member
    7646                      .dwattr $C$DW$436, DW_AT_type(*$C$DW$T$28)
    7647                      .dwattr $C$DW$436, DW_AT_name("Ud")
TMS320C2000 Assembler PC v15.12.1 Wed Jul 12 17:46:37 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
IDDK_PM_Servo_F2837x.asm                                             PAGE  164

    7648                      .dwattr $C$DW$436, DW_AT_TI_symbol_name("_Ud")
    7649                      .dwattr $C$DW$436, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7650                      .dwattr $C$DW$436, DW_AT_accessibility(DW_ACCESS_public)
    7651              
    7652              $C$DW$437       .dwtag  DW_TAG_member
    7653                      .dwattr $C$DW$437, DW_AT_type(*$C$DW$T$28)
    7654                      .dwattr $C$DW$437, DW_AT_name("OutPreSat")
    7655                      .dwattr $C$DW$437, DW_AT_TI_symbol_name("_OutPreSat")
    7656                      .dwattr $C$DW$437, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    7657                      .dwattr $C$DW$437, DW_AT_accessibility(DW_ACCESS_public)
    7658              
    7659              $C$DW$438       .dwtag  DW_TAG_member
    7660                      .dwattr $C$DW$438, DW_AT_type(*$C$DW$T$28)
    7661                      .dwattr $C$DW$438, DW_AT_name("OutMax")
    7662                      .dwattr $C$DW$438, DW_AT_TI_symbol_name("_OutMax")
    7663                      .dwattr $C$DW$438, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    7664                      .dwattr $C$DW$438, DW_AT_accessibility(DW_ACCESS_public)
    7665              
    7666              $C$DW$439       .dwtag  DW_TAG_member
    7667                      .dwattr $C$DW$439, DW_AT_type(*$C$DW$T$28)
    7668                      .dwattr $C$DW$439, DW_AT_name("OutMin")
    7669                      .dwattr $C$DW$439, DW_AT_TI_symbol_name("_OutMin")
    7670                      .dwattr $C$DW$439, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    7671                      .dwattr $C$DW$439, DW_AT_accessibility(DW_ACCESS_public)
    7672              
    7673              $C$DW$440       .dwtag  DW_TAG_member
    7674                      .dwattr $C$DW$440, DW_AT_type(*$C$DW$T$28)
    7675                      .dwattr $C$DW$440, DW_AT_name("Out")
    7676                      .dwattr $C$DW$440, DW_AT_TI_symbol_name("_Out")
    7677                      .dwattr $C$DW$440, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    7678                      .dwattr $C$DW$440, DW_AT_accessibility(DW_ACCESS_public)
    7679              
    7680              $C$DW$441       .dwtag  DW_TAG_member
    7681                      .dwattr $C$DW$441, DW_AT_type(*$C$DW$T$28)
    7682                      .dwattr $C$DW$441, DW_AT_name("SatErr")
    7683                      .dwattr $C$DW$441, DW_AT_TI_symbol_name("_SatErr")
    7684                      .dwattr $C$DW$441, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    7685                      .dwattr $C$DW$441, DW_AT_accessibility(DW_ACCESS_public)
    7686              
    7687              $C$DW$442       .dwtag  DW_TAG_member
    7688                      .dwattr $C$DW$442, DW_AT_type(*$C$DW$T$28)
    7689                      .dwattr $C$DW$442, DW_AT_name("Ki")
    7690                      .dwattr $C$DW$442, DW_AT_TI_symbol_name("_Ki")
    7691                      .dwattr $C$DW$442, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    7692                      .dwattr $C$DW$442, DW_AT_accessibility(DW_ACCESS_public)
    7693              
    7694              $C$DW$443       .dwtag  DW_TAG_member
    7695                      .dwattr $C$DW$443, DW_AT_type(*$C$DW$T$28)
    7696                      .dwattr $C$DW$443, DW_AT_name("Kc")
    7697                      .dwattr $C$DW$443, DW_AT_TI_symbol_name("_Kc")
    7698                      .dwattr $C$DW$443, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    7699                      .dwattr $C$DW$443, DW_AT_accessibility(DW_ACCESS_public)
    7700              
    7701              $C$DW$444       .dwtag  DW_TAG_member
    7702                      .dwattr $C$DW$444, DW_AT_type(*$C$DW$T$28)
TMS320C2000 Assembler PC v15.12.1 Wed Jul 12 17:46:37 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
IDDK_PM_Servo_F2837x.asm                                             PAGE  165

    7703                      .dwattr $C$DW$444, DW_AT_name("Kd")
    7704                      .dwattr $C$DW$444, DW_AT_TI_symbol_name("_Kd")
    7705                      .dwattr $C$DW$444, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    7706                      .dwattr $C$DW$444, DW_AT_accessibility(DW_ACCESS_public)
    7707              
    7708              $C$DW$445       .dwtag  DW_TAG_member
    7709                      .dwattr $C$DW$445, DW_AT_type(*$C$DW$T$28)
    7710                      .dwattr $C$DW$445, DW_AT_name("Up1")
    7711                      .dwattr $C$DW$445, DW_AT_TI_symbol_name("_Up1")
    7712                      .dwattr $C$DW$445, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    7713                      .dwattr $C$DW$445, DW_AT_accessibility(DW_ACCESS_public)
    7714              
    7715                      .dwendtag $C$DW$T$32
    7716              
    7717              $C$DW$T$686     .dwtag  DW_TAG_typedef
    7718                      .dwattr $C$DW$T$686, DW_AT_name("PIDREG3")
    7719                      .dwattr $C$DW$T$686, DW_AT_type(*$C$DW$T$32)
    7720                      .dwattr $C$DW$T$686, DW_AT_language(DW_LANG_C)
    7721              
    7722              
    7723              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    7724                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x18)
    7725              $C$DW$446       .dwtag  DW_TAG_member
    7726                      .dwattr $C$DW$446, DW_AT_type(*$C$DW$T$28)
    7727                      .dwattr $C$DW$446, DW_AT_name("Ref")
    7728                      .dwattr $C$DW$446, DW_AT_TI_symbol_name("_Ref")
    7729                      .dwattr $C$DW$446, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7730                      .dwattr $C$DW$446, DW_AT_accessibility(DW_ACCESS_public)
    7731              
    7732              $C$DW$447       .dwtag  DW_TAG_member
    7733                      .dwattr $C$DW$447, DW_AT_type(*$C$DW$T$28)
    7734                      .dwattr $C$DW$447, DW_AT_name("Fbk")
    7735                      .dwattr $C$DW$447, DW_AT_TI_symbol_name("_Fbk")
    7736                      .dwattr $C$DW$447, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7737                      .dwattr $C$DW$447, DW_AT_accessibility(DW_ACCESS_public)
    7738              
    7739              $C$DW$448       .dwtag  DW_TAG_member
    7740                      .dwattr $C$DW$448, DW_AT_type(*$C$DW$T$28)
    7741                      .dwattr $C$DW$448, DW_AT_name("Out")
    7742                      .dwattr $C$DW$448, DW_AT_TI_symbol_name("_Out")
    7743                      .dwattr $C$DW$448, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7744                      .dwattr $C$DW$448, DW_AT_accessibility(DW_ACCESS_public)
    7745              
    7746              $C$DW$449       .dwtag  DW_TAG_member
    7747                      .dwattr $C$DW$449, DW_AT_type(*$C$DW$T$28)
    7748                      .dwattr $C$DW$449, DW_AT_name("Kp")
    7749                      .dwattr $C$DW$449, DW_AT_TI_symbol_name("_Kp")
    7750                      .dwattr $C$DW$449, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7751                      .dwattr $C$DW$449, DW_AT_accessibility(DW_ACCESS_public)
    7752              
    7753              $C$DW$450       .dwtag  DW_TAG_member
    7754                      .dwattr $C$DW$450, DW_AT_type(*$C$DW$T$28)
    7755                      .dwattr $C$DW$450, DW_AT_name("Ki")
    7756                      .dwattr $C$DW$450, DW_AT_TI_symbol_name("_Ki")
    7757                      .dwattr $C$DW$450, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
TMS320C2000 Assembler PC v15.12.1 Wed Jul 12 17:46:37 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
IDDK_PM_Servo_F2837x.asm                                             PAGE  166

    7758                      .dwattr $C$DW$450, DW_AT_accessibility(DW_ACCESS_public)
    7759              
    7760              $C$DW$451       .dwtag  DW_TAG_member
    7761                      .dwattr $C$DW$451, DW_AT_type(*$C$DW$T$28)
    7762                      .dwattr $C$DW$451, DW_AT_name("Umax")
    7763                      .dwattr $C$DW$451, DW_AT_TI_symbol_name("_Umax")
    7764                      .dwattr $C$DW$451, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7765                      .dwattr $C$DW$451, DW_AT_accessibility(DW_ACCESS_public)
    7766              
    7767              $C$DW$452       .dwtag  DW_TAG_member
    7768                      .dwattr $C$DW$452, DW_AT_type(*$C$DW$T$28)
    7769                      .dwattr $C$DW$452, DW_AT_name("Umin")
    7770                      .dwattr $C$DW$452, DW_AT_TI_symbol_name("_Umin")
    7771                      .dwattr $C$DW$452, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7772                      .dwattr $C$DW$452, DW_AT_accessibility(DW_ACCESS_public)
    7773              
    7774              $C$DW$453       .dwtag  DW_TAG_member
    7775                      .dwattr $C$DW$453, DW_AT_type(*$C$DW$T$28)
    7776                      .dwattr $C$DW$453, DW_AT_name("up")
    7777                      .dwattr $C$DW$453, DW_AT_TI_symbol_name("_up")
    7778                      .dwattr $C$DW$453, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    7779                      .dwattr $C$DW$453, DW_AT_accessibility(DW_ACCESS_public)
    7780              
    7781              $C$DW$454       .dwtag  DW_TAG_member
    7782                      .dwattr $C$DW$454, DW_AT_type(*$C$DW$T$28)
    7783                      .dwattr $C$DW$454, DW_AT_name("ui")
    7784                      .dwattr $C$DW$454, DW_AT_TI_symbol_name("_ui")
    7785                      .dwattr $C$DW$454, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    7786                      .dwattr $C$DW$454, DW_AT_accessibility(DW_ACCESS_public)
    7787              
    7788              $C$DW$455       .dwtag  DW_TAG_member
    7789                      .dwattr $C$DW$455, DW_AT_type(*$C$DW$T$28)
    7790                      .dwattr $C$DW$455, DW_AT_name("v1")
    7791                      .dwattr $C$DW$455, DW_AT_TI_symbol_name("_v1")
    7792                      .dwattr $C$DW$455, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    7793                      .dwattr $C$DW$455, DW_AT_accessibility(DW_ACCESS_public)
    7794              
    7795              $C$DW$456       .dwtag  DW_TAG_member
    7796                      .dwattr $C$DW$456, DW_AT_type(*$C$DW$T$28)
    7797                      .dwattr $C$DW$456, DW_AT_name("i1")
    7798                      .dwattr $C$DW$456, DW_AT_TI_symbol_name("_i1")
    7799                      .dwattr $C$DW$456, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    7800                      .dwattr $C$DW$456, DW_AT_accessibility(DW_ACCESS_public)
    7801              
    7802              $C$DW$457       .dwtag  DW_TAG_member
    7803                      .dwattr $C$DW$457, DW_AT_type(*$C$DW$T$28)
    7804                      .dwattr $C$DW$457, DW_AT_name("w1")
    7805                      .dwattr $C$DW$457, DW_AT_TI_symbol_name("_w1")
    7806                      .dwattr $C$DW$457, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    7807                      .dwattr $C$DW$457, DW_AT_accessibility(DW_ACCESS_public)
    7808              
    7809                      .dwendtag $C$DW$T$33
    7810              
    7811              $C$DW$T$687     .dwtag  DW_TAG_typedef
    7812                      .dwattr $C$DW$T$687, DW_AT_name("PI_CONTROLLER")
TMS320C2000 Assembler PC v15.12.1 Wed Jul 12 17:46:37 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
IDDK_PM_Servo_F2837x.asm                                             PAGE  167

    7813                      .dwattr $C$DW$T$687, DW_AT_type(*$C$DW$T$33)
    7814                      .dwattr $C$DW$T$687, DW_AT_language(DW_LANG_C)
    7815              
    7816              
    7817              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    7818                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x0a)
    7819              $C$DW$458       .dwtag  DW_TAG_member
    7820                      .dwattr $C$DW$458, DW_AT_type(*$C$DW$T$28)
    7821                      .dwattr $C$DW$458, DW_AT_name("Ref")
    7822                      .dwattr $C$DW$458, DW_AT_TI_symbol_name("_Ref")
    7823                      .dwattr $C$DW$458, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7824                      .dwattr $C$DW$458, DW_AT_accessibility(DW_ACCESS_public)
    7825              
    7826              $C$DW$459       .dwtag  DW_TAG_member
    7827                      .dwattr $C$DW$459, DW_AT_type(*$C$DW$T$28)
    7828                      .dwattr $C$DW$459, DW_AT_name("Fbk")
    7829                      .dwattr $C$DW$459, DW_AT_TI_symbol_name("_Fbk")
    7830                      .dwattr $C$DW$459, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7831                      .dwattr $C$DW$459, DW_AT_accessibility(DW_ACCESS_public)
    7832              
    7833              $C$DW$460       .dwtag  DW_TAG_member
    7834                      .dwattr $C$DW$460, DW_AT_type(*$C$DW$T$28)
    7835                      .dwattr $C$DW$460, DW_AT_name("Out")
    7836                      .dwattr $C$DW$460, DW_AT_TI_symbol_name("_Out")
    7837                      .dwattr $C$DW$460, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7838                      .dwattr $C$DW$460, DW_AT_accessibility(DW_ACCESS_public)
    7839              
    7840              $C$DW$461       .dwtag  DW_TAG_member
    7841                      .dwattr $C$DW$461, DW_AT_type(*$C$DW$T$28)
    7842                      .dwattr $C$DW$461, DW_AT_name("c1")
    7843                      .dwattr $C$DW$461, DW_AT_TI_symbol_name("_c1")
    7844                      .dwattr $C$DW$461, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7845                      .dwattr $C$DW$461, DW_AT_accessibility(DW_ACCESS_public)
    7846              
    7847              $C$DW$462       .dwtag  DW_TAG_member
    7848                      .dwattr $C$DW$462, DW_AT_type(*$C$DW$T$28)
    7849                      .dwattr $C$DW$462, DW_AT_name("c2")
    7850                      .dwattr $C$DW$462, DW_AT_TI_symbol_name("_c2")
    7851                      .dwattr $C$DW$462, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7852                      .dwattr $C$DW$462, DW_AT_accessibility(DW_ACCESS_public)
    7853              
    7854                      .dwendtag $C$DW$T$34
    7855              
    7856              $C$DW$T$37      .dwtag  DW_TAG_typedef
    7857                      .dwattr $C$DW$T$37, DW_AT_name("PID_TERMINALS")
    7858                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$34)
    7859                      .dwattr $C$DW$T$37, DW_AT_language(DW_LANG_C)
    7860              
    7861              
    7862              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    7863                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x0e)
    7864              $C$DW$463       .dwtag  DW_TAG_member
    7865                      .dwattr $C$DW$463, DW_AT_type(*$C$DW$T$28)
    7866                      .dwattr $C$DW$463, DW_AT_name("Kr")
    7867                      .dwattr $C$DW$463, DW_AT_TI_symbol_name("_Kr")
TMS320C2000 Assembler PC v15.12.1 Wed Jul 12 17:46:37 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
IDDK_PM_Servo_F2837x.asm                                             PAGE  168

    7868                      .dwattr $C$DW$463, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7869                      .dwattr $C$DW$463, DW_AT_accessibility(DW_ACCESS_public)
    7870              
    7871              $C$DW$464       .dwtag  DW_TAG_member
    7872                      .dwattr $C$DW$464, DW_AT_type(*$C$DW$T$28)
    7873                      .dwattr $C$DW$464, DW_AT_name("Kp")
    7874                      .dwattr $C$DW$464, DW_AT_TI_symbol_name("_Kp")
    7875                      .dwattr $C$DW$464, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7876                      .dwattr $C$DW$464, DW_AT_accessibility(DW_ACCESS_public)
    7877              
    7878              $C$DW$465       .dwtag  DW_TAG_member
    7879                      .dwattr $C$DW$465, DW_AT_type(*$C$DW$T$28)
    7880                      .dwattr $C$DW$465, DW_AT_name("Ki")
    7881                      .dwattr $C$DW$465, DW_AT_TI_symbol_name("_Ki")
    7882                      .dwattr $C$DW$465, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7883                      .dwattr $C$DW$465, DW_AT_accessibility(DW_ACCESS_public)
    7884              
    7885              $C$DW$466       .dwtag  DW_TAG_member
    7886                      .dwattr $C$DW$466, DW_AT_type(*$C$DW$T$28)
    7887                      .dwattr $C$DW$466, DW_AT_name("Kd")
    7888                      .dwattr $C$DW$466, DW_AT_TI_symbol_name("_Kd")
    7889                      .dwattr $C$DW$466, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7890                      .dwattr $C$DW$466, DW_AT_accessibility(DW_ACCESS_public)
    7891              
    7892              $C$DW$467       .dwtag  DW_TAG_member
    7893                      .dwattr $C$DW$467, DW_AT_type(*$C$DW$T$28)
    7894                      .dwattr $C$DW$467, DW_AT_name("Km")
    7895                      .dwattr $C$DW$467, DW_AT_TI_symbol_name("_Km")
    7896                      .dwattr $C$DW$467, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7897                      .dwattr $C$DW$467, DW_AT_accessibility(DW_ACCESS_public)
    7898              
    7899              $C$DW$468       .dwtag  DW_TAG_member
    7900                      .dwattr $C$DW$468, DW_AT_type(*$C$DW$T$28)
    7901                      .dwattr $C$DW$468, DW_AT_name("Umax")
    7902                      .dwattr $C$DW$468, DW_AT_TI_symbol_name("_Umax")
    7903                      .dwattr $C$DW$468, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7904                      .dwattr $C$DW$468, DW_AT_accessibility(DW_ACCESS_public)
    7905              
    7906              $C$DW$469       .dwtag  DW_TAG_member
    7907                      .dwattr $C$DW$469, DW_AT_type(*$C$DW$T$28)
    7908                      .dwattr $C$DW$469, DW_AT_name("Umin")
    7909                      .dwattr $C$DW$469, DW_AT_TI_symbol_name("_Umin")
    7910                      .dwattr $C$DW$469, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7911                      .dwattr $C$DW$469, DW_AT_accessibility(DW_ACCESS_public)
    7912              
    7913                      .dwendtag $C$DW$T$35
    7914              
    7915              $C$DW$T$38      .dwtag  DW_TAG_typedef
    7916                      .dwattr $C$DW$T$38, DW_AT_name("PID_PARAMETERS")
    7917                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$35)
    7918                      .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
    7919              
    7920              
    7921              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    7922                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x10)
TMS320C2000 Assembler PC v15.12.1 Wed Jul 12 17:46:37 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
IDDK_PM_Servo_F2837x.asm                                             PAGE  169

    7923              $C$DW$470       .dwtag  DW_TAG_member
    7924                      .dwattr $C$DW$470, DW_AT_type(*$C$DW$T$28)
    7925                      .dwattr $C$DW$470, DW_AT_name("up")
    7926                      .dwattr $C$DW$470, DW_AT_TI_symbol_name("_up")
    7927                      .dwattr $C$DW$470, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7928                      .dwattr $C$DW$470, DW_AT_accessibility(DW_ACCESS_public)
    7929              
    7930              $C$DW$471       .dwtag  DW_TAG_member
    7931                      .dwattr $C$DW$471, DW_AT_type(*$C$DW$T$28)
    7932                      .dwattr $C$DW$471, DW_AT_name("ui")
    7933                      .dwattr $C$DW$471, DW_AT_TI_symbol_name("_ui")
    7934                      .dwattr $C$DW$471, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7935                      .dwattr $C$DW$471, DW_AT_accessibility(DW_ACCESS_public)
    7936              
    7937              $C$DW$472       .dwtag  DW_TAG_member
    7938                      .dwattr $C$DW$472, DW_AT_type(*$C$DW$T$28)
    7939                      .dwattr $C$DW$472, DW_AT_name("ud")
    7940                      .dwattr $C$DW$472, DW_AT_TI_symbol_name("_ud")
    7941                      .dwattr $C$DW$472, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7942                      .dwattr $C$DW$472, DW_AT_accessibility(DW_ACCESS_public)
    7943              
    7944              $C$DW$473       .dwtag  DW_TAG_member
    7945                      .dwattr $C$DW$473, DW_AT_type(*$C$DW$T$28)
    7946                      .dwattr $C$DW$473, DW_AT_name("v1")
    7947                      .dwattr $C$DW$473, DW_AT_TI_symbol_name("_v1")
    7948                      .dwattr $C$DW$473, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7949                      .dwattr $C$DW$473, DW_AT_accessibility(DW_ACCESS_public)
    7950              
    7951              $C$DW$474       .dwtag  DW_TAG_member
    7952                      .dwattr $C$DW$474, DW_AT_type(*$C$DW$T$28)
    7953                      .dwattr $C$DW$474, DW_AT_name("i1")
    7954                      .dwattr $C$DW$474, DW_AT_TI_symbol_name("_i1")
    7955                      .dwattr $C$DW$474, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7956                      .dwattr $C$DW$474, DW_AT_accessibility(DW_ACCESS_public)
    7957              
    7958              $C$DW$475       .dwtag  DW_TAG_member
    7959                      .dwattr $C$DW$475, DW_AT_type(*$C$DW$T$28)
    7960                      .dwattr $C$DW$475, DW_AT_name("d1")
    7961                      .dwattr $C$DW$475, DW_AT_TI_symbol_name("_d1")
    7962                      .dwattr $C$DW$475, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7963                      .dwattr $C$DW$475, DW_AT_accessibility(DW_ACCESS_public)
    7964              
    7965              $C$DW$476       .dwtag  DW_TAG_member
    7966                      .dwattr $C$DW$476, DW_AT_type(*$C$DW$T$28)
    7967                      .dwattr $C$DW$476, DW_AT_name("d2")
    7968                      .dwattr $C$DW$476, DW_AT_TI_symbol_name("_d2")
    7969                      .dwattr $C$DW$476, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7970                      .dwattr $C$DW$476, DW_AT_accessibility(DW_ACCESS_public)
    7971              
    7972              $C$DW$477       .dwtag  DW_TAG_member
    7973                      .dwattr $C$DW$477, DW_AT_type(*$C$DW$T$28)
    7974                      .dwattr $C$DW$477, DW_AT_name("w1")
    7975                      .dwattr $C$DW$477, DW_AT_TI_symbol_name("_w1")
    7976                      .dwattr $C$DW$477, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    7977                      .dwattr $C$DW$477, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.1 Wed Jul 12 17:46:37 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
IDDK_PM_Servo_F2837x.asm                                             PAGE  170

    7978              
    7979                      .dwendtag $C$DW$T$36
    7980              
    7981              $C$DW$T$39      .dwtag  DW_TAG_typedef
    7982                      .dwattr $C$DW$T$39, DW_AT_name("PID_DATA")
    7983                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$36)
    7984                      .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
    7985              
    7986              
    7987              $C$DW$T$40      .dwtag  DW_TAG_structure_type
    7988                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x28)
    7989              $C$DW$478       .dwtag  DW_TAG_member
    7990                      .dwattr $C$DW$478, DW_AT_type(*$C$DW$T$37)
    7991                      .dwattr $C$DW$478, DW_AT_name("term")
    7992                      .dwattr $C$DW$478, DW_AT_TI_symbol_name("_term")
    7993                      .dwattr $C$DW$478, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7994                      .dwattr $C$DW$478, DW_AT_accessibility(DW_ACCESS_public)
    7995              
    7996              $C$DW$479       .dwtag  DW_TAG_member
    7997                      .dwattr $C$DW$479, DW_AT_type(*$C$DW$T$38)
    7998                      .dwattr $C$DW$479, DW_AT_name("param")
    7999                      .dwattr $C$DW$479, DW_AT_TI_symbol_name("_param")
    8000                      .dwattr $C$DW$479, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    8001                      .dwattr $C$DW$479, DW_AT_accessibility(DW_ACCESS_public)
    8002              
    8003              $C$DW$480       .dwtag  DW_TAG_member
    8004                      .dwattr $C$DW$480, DW_AT_type(*$C$DW$T$39)
    8005                      .dwattr $C$DW$480, DW_AT_name("data")
    8006                      .dwattr $C$DW$480, DW_AT_TI_symbol_name("_data")
    8007                      .dwattr $C$DW$480, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    8008                      .dwattr $C$DW$480, DW_AT_accessibility(DW_ACCESS_public)
    8009              
    8010                      .dwendtag $C$DW$T$40
    8011              
    8012              $C$DW$T$688     .dwtag  DW_TAG_typedef
    8013                      .dwattr $C$DW$T$688, DW_AT_name("PID_CONTROLLER")
    8014                      .dwattr $C$DW$T$688, DW_AT_type(*$C$DW$T$40)
    8015                      .dwattr $C$DW$T$688, DW_AT_language(DW_LANG_C)
    8016              
    8017              
    8018              $C$DW$T$41      .dwtag  DW_TAG_structure_type
    8019                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x12)
    8020              $C$DW$481       .dwtag  DW_TAG_member
    8021                      .dwattr $C$DW$481, DW_AT_type(*$C$DW$T$28)
    8022                      .dwattr $C$DW$481, DW_AT_name("Ualpha")
    8023                      .dwattr $C$DW$481, DW_AT_TI_symbol_name("_Ualpha")
    8024                      .dwattr $C$DW$481, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8025                      .dwattr $C$DW$481, DW_AT_accessibility(DW_ACCESS_public)
    8026              
    8027              $C$DW$482       .dwtag  DW_TAG_member
    8028                      .dwattr $C$DW$482, DW_AT_type(*$C$DW$T$28)
    8029                      .dwattr $C$DW$482, DW_AT_name("Ubeta")
    8030                      .dwattr $C$DW$482, DW_AT_TI_symbol_name("_Ubeta")
    8031                      .dwattr $C$DW$482, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8032                      .dwattr $C$DW$482, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.1 Wed Jul 12 17:46:37 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
IDDK_PM_Servo_F2837x.asm                                             PAGE  171

    8033              
    8034              $C$DW$483       .dwtag  DW_TAG_member
    8035                      .dwattr $C$DW$483, DW_AT_type(*$C$DW$T$28)
    8036                      .dwattr $C$DW$483, DW_AT_name("Ta")
    8037                      .dwattr $C$DW$483, DW_AT_TI_symbol_name("_Ta")
    8038                      .dwattr $C$DW$483, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8039                      .dwattr $C$DW$483, DW_AT_accessibility(DW_ACCESS_public)
    8040              
    8041              $C$DW$484       .dwtag  DW_TAG_member
    8042                      .dwattr $C$DW$484, DW_AT_type(*$C$DW$T$28)
    8043                      .dwattr $C$DW$484, DW_AT_name("Tb")
    8044                      .dwattr $C$DW$484, DW_AT_TI_symbol_name("_Tb")
    8045                      .dwattr $C$DW$484, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    8046                      .dwattr $C$DW$484, DW_AT_accessibility(DW_ACCESS_public)
    8047              
    8048              $C$DW$485       .dwtag  DW_TAG_member
    8049                      .dwattr $C$DW$485, DW_AT_type(*$C$DW$T$28)
    8050                      .dwattr $C$DW$485, DW_AT_name("Tc")
    8051                      .dwattr $C$DW$485, DW_AT_TI_symbol_name("_Tc")
    8052                      .dwattr $C$DW$485, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8053                      .dwattr $C$DW$485, DW_AT_accessibility(DW_ACCESS_public)
    8054              
    8055              $C$DW$486       .dwtag  DW_TAG_member
    8056                      .dwattr $C$DW$486, DW_AT_type(*$C$DW$T$28)
    8057                      .dwattr $C$DW$486, DW_AT_name("tmp1")
    8058                      .dwattr $C$DW$486, DW_AT_TI_symbol_name("_tmp1")
    8059                      .dwattr $C$DW$486, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    8060                      .dwattr $C$DW$486, DW_AT_accessibility(DW_ACCESS_public)
    8061              
    8062              $C$DW$487       .dwtag  DW_TAG_member
    8063                      .dwattr $C$DW$487, DW_AT_type(*$C$DW$T$28)
    8064                      .dwattr $C$DW$487, DW_AT_name("tmp2")
    8065                      .dwattr $C$DW$487, DW_AT_TI_symbol_name("_tmp2")
    8066                      .dwattr $C$DW$487, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    8067                      .dwattr $C$DW$487, DW_AT_accessibility(DW_ACCESS_public)
    8068              
    8069              $C$DW$488       .dwtag  DW_TAG_member
    8070                      .dwattr $C$DW$488, DW_AT_type(*$C$DW$T$28)
    8071                      .dwattr $C$DW$488, DW_AT_name("tmp3")
    8072                      .dwattr $C$DW$488, DW_AT_TI_symbol_name("_tmp3")
    8073                      .dwattr $C$DW$488, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    8074                      .dwattr $C$DW$488, DW_AT_accessibility(DW_ACCESS_public)
    8075              
    8076              $C$DW$489       .dwtag  DW_TAG_member
    8077                      .dwattr $C$DW$489, DW_AT_type(*$C$DW$T$23)
    8078                      .dwattr $C$DW$489, DW_AT_name("VecSector")
    8079                      .dwattr $C$DW$489, DW_AT_TI_symbol_name("_VecSector")
    8080                      .dwattr $C$DW$489, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    8081                      .dwattr $C$DW$489, DW_AT_accessibility(DW_ACCESS_public)
    8082              
    8083                      .dwendtag $C$DW$T$41
    8084              
    8085              $C$DW$T$689     .dwtag  DW_TAG_typedef
    8086                      .dwattr $C$DW$T$689, DW_AT_name("SVGEN")
    8087                      .dwattr $C$DW$T$689, DW_AT_type(*$C$DW$T$41)
TMS320C2000 Assembler PC v15.12.1 Wed Jul 12 17:46:37 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
IDDK_PM_Servo_F2837x.asm                                             PAGE  172

    8088                      .dwattr $C$DW$T$689, DW_AT_language(DW_LANG_C)
    8089              
    8090              
    8091              $C$DW$T$43      .dwtag  DW_TAG_structure_type
    8092                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x10)
    8093              $C$DW$490       .dwtag  DW_TAG_member
    8094                      .dwattr $C$DW$490, DW_AT_type(*$C$DW$T$28)
    8095                      .dwattr $C$DW$490, DW_AT_name("TargetValue")
    8096                      .dwattr $C$DW$490, DW_AT_TI_symbol_name("_TargetValue")
    8097                      .dwattr $C$DW$490, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8098                      .dwattr $C$DW$490, DW_AT_accessibility(DW_ACCESS_public)
    8099              
    8100              $C$DW$491       .dwtag  DW_TAG_member
    8101                      .dwattr $C$DW$491, DW_AT_type(*$C$DW$T$42)
    8102                      .dwattr $C$DW$491, DW_AT_name("RampDelayMax")
    8103                      .dwattr $C$DW$491, DW_AT_TI_symbol_name("_RampDelayMax")
    8104                      .dwattr $C$DW$491, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8105                      .dwattr $C$DW$491, DW_AT_accessibility(DW_ACCESS_public)
    8106              
    8107              $C$DW$492       .dwtag  DW_TAG_member
    8108                      .dwattr $C$DW$492, DW_AT_type(*$C$DW$T$28)
    8109                      .dwattr $C$DW$492, DW_AT_name("RampLowLimit")
    8110                      .dwattr $C$DW$492, DW_AT_TI_symbol_name("_RampLowLimit")
    8111                      .dwattr $C$DW$492, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8112                      .dwattr $C$DW$492, DW_AT_accessibility(DW_ACCESS_public)
    8113              
    8114              $C$DW$493       .dwtag  DW_TAG_member
    8115                      .dwattr $C$DW$493, DW_AT_type(*$C$DW$T$28)
    8116                      .dwattr $C$DW$493, DW_AT_name("RampHighLimit")
    8117                      .dwattr $C$DW$493, DW_AT_TI_symbol_name("_RampHighLimit")
    8118                      .dwattr $C$DW$493, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    8119                      .dwattr $C$DW$493, DW_AT_accessibility(DW_ACCESS_public)
    8120              
    8121              $C$DW$494       .dwtag  DW_TAG_member
    8122                      .dwattr $C$DW$494, DW_AT_type(*$C$DW$T$42)
    8123                      .dwattr $C$DW$494, DW_AT_name("RampDelayCount")
    8124                      .dwattr $C$DW$494, DW_AT_TI_symbol_name("_RampDelayCount")
    8125                      .dwattr $C$DW$494, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8126                      .dwattr $C$DW$494, DW_AT_accessibility(DW_ACCESS_public)
    8127              
    8128              $C$DW$495       .dwtag  DW_TAG_member
    8129                      .dwattr $C$DW$495, DW_AT_type(*$C$DW$T$28)
    8130                      .dwattr $C$DW$495, DW_AT_name("SetpointValue")
    8131                      .dwattr $C$DW$495, DW_AT_TI_symbol_name("_SetpointValue")
    8132                      .dwattr $C$DW$495, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    8133                      .dwattr $C$DW$495, DW_AT_accessibility(DW_ACCESS_public)
    8134              
    8135              $C$DW$496       .dwtag  DW_TAG_member
    8136                      .dwattr $C$DW$496, DW_AT_type(*$C$DW$T$42)
    8137                      .dwattr $C$DW$496, DW_AT_name("EqualFlag")
    8138                      .dwattr $C$DW$496, DW_AT_TI_symbol_name("_EqualFlag")
    8139                      .dwattr $C$DW$496, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    8140                      .dwattr $C$DW$496, DW_AT_accessibility(DW_ACCESS_public)
    8141              
    8142              $C$DW$497       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v15.12.1 Wed Jul 12 17:46:37 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
IDDK_PM_Servo_F2837x.asm                                             PAGE  173

    8143                      .dwattr $C$DW$497, DW_AT_type(*$C$DW$T$28)
    8144                      .dwattr $C$DW$497, DW_AT_name("Tmp")
    8145                      .dwattr $C$DW$497, DW_AT_TI_symbol_name("_Tmp")
    8146                      .dwattr $C$DW$497, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    8147                      .dwattr $C$DW$497, DW_AT_accessibility(DW_ACCESS_public)
    8148              
    8149                      .dwendtag $C$DW$T$43
    8150              
    8151              $C$DW$T$690     .dwtag  DW_TAG_typedef
    8152                      .dwattr $C$DW$T$690, DW_AT_name("RMPCNTL")
    8153                      .dwattr $C$DW$T$690, DW_AT_type(*$C$DW$T$43)
    8154                      .dwattr $C$DW$T$690, DW_AT_language(DW_LANG_C)
    8155              
    8156              
    8157              $C$DW$T$44      .dwtag  DW_TAG_structure_type
    8158                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x0c)
    8159              $C$DW$498       .dwtag  DW_TAG_member
    8160                      .dwattr $C$DW$498, DW_AT_type(*$C$DW$T$28)
    8161                      .dwattr $C$DW$498, DW_AT_name("Freq")
    8162                      .dwattr $C$DW$498, DW_AT_TI_symbol_name("_Freq")
    8163                      .dwattr $C$DW$498, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8164                      .dwattr $C$DW$498, DW_AT_accessibility(DW_ACCESS_public)
    8165              
    8166              $C$DW$499       .dwtag  DW_TAG_member
    8167                      .dwattr $C$DW$499, DW_AT_type(*$C$DW$T$28)
    8168                      .dwattr $C$DW$499, DW_AT_name("StepAngleMax")
    8169                      .dwattr $C$DW$499, DW_AT_TI_symbol_name("_StepAngleMax")
    8170                      .dwattr $C$DW$499, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8171                      .dwattr $C$DW$499, DW_AT_accessibility(DW_ACCESS_public)
    8172              
    8173              $C$DW$500       .dwtag  DW_TAG_member
    8174                      .dwattr $C$DW$500, DW_AT_type(*$C$DW$T$28)
    8175                      .dwattr $C$DW$500, DW_AT_name("Angle")
    8176                      .dwattr $C$DW$500, DW_AT_TI_symbol_name("_Angle")
    8177                      .dwattr $C$DW$500, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8178                      .dwattr $C$DW$500, DW_AT_accessibility(DW_ACCESS_public)
    8179              
    8180              $C$DW$501       .dwtag  DW_TAG_member
    8181                      .dwattr $C$DW$501, DW_AT_type(*$C$DW$T$28)
    8182                      .dwattr $C$DW$501, DW_AT_name("Gain")
    8183                      .dwattr $C$DW$501, DW_AT_TI_symbol_name("_Gain")
    8184                      .dwattr $C$DW$501, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    8185                      .dwattr $C$DW$501, DW_AT_accessibility(DW_ACCESS_public)
    8186              
    8187              $C$DW$502       .dwtag  DW_TAG_member
    8188                      .dwattr $C$DW$502, DW_AT_type(*$C$DW$T$28)
    8189                      .dwattr $C$DW$502, DW_AT_name("Out")
    8190                      .dwattr $C$DW$502, DW_AT_TI_symbol_name("_Out")
    8191                      .dwattr $C$DW$502, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8192                      .dwattr $C$DW$502, DW_AT_accessibility(DW_ACCESS_public)
    8193              
    8194              $C$DW$503       .dwtag  DW_TAG_member
    8195                      .dwattr $C$DW$503, DW_AT_type(*$C$DW$T$28)
    8196                      .dwattr $C$DW$503, DW_AT_name("Offset")
    8197                      .dwattr $C$DW$503, DW_AT_TI_symbol_name("_Offset")
TMS320C2000 Assembler PC v15.12.1 Wed Jul 12 17:46:37 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
IDDK_PM_Servo_F2837x.asm                                             PAGE  174

    8198                      .dwattr $C$DW$503, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    8199                      .dwattr $C$DW$503, DW_AT_accessibility(DW_ACCESS_public)
    8200              
    8201                      .dwendtag $C$DW$T$44
    8202              
    8203              $C$DW$T$691     .dwtag  DW_TAG_typedef
    8204                      .dwattr $C$DW$T$691, DW_AT_name("RAMPGEN")
    8205                      .dwattr $C$DW$T$691, DW_AT_type(*$C$DW$T$44)
    8206                      .dwattr $C$DW$T$691, DW_AT_language(DW_LANG_C)
    8207              
    8208              
    8209              $C$DW$T$45      .dwtag  DW_TAG_structure_type
    8210                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x16)
    8211              $C$DW$504       .dwtag  DW_TAG_member
    8212                      .dwattr $C$DW$504, DW_AT_type(*$C$DW$T$28)
    8213                      .dwattr $C$DW$504, DW_AT_name("DcBusVolt")
    8214                      .dwattr $C$DW$504, DW_AT_TI_symbol_name("_DcBusVolt")
    8215                      .dwattr $C$DW$504, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8216                      .dwattr $C$DW$504, DW_AT_accessibility(DW_ACCESS_public)
    8217              
    8218              $C$DW$505       .dwtag  DW_TAG_member
    8219                      .dwattr $C$DW$505, DW_AT_type(*$C$DW$T$28)
    8220                      .dwattr $C$DW$505, DW_AT_name("MfuncV1")
    8221                      .dwattr $C$DW$505, DW_AT_TI_symbol_name("_MfuncV1")
    8222                      .dwattr $C$DW$505, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8223                      .dwattr $C$DW$505, DW_AT_accessibility(DW_ACCESS_public)
    8224              
    8225              $C$DW$506       .dwtag  DW_TAG_member
    8226                      .dwattr $C$DW$506, DW_AT_type(*$C$DW$T$28)
    8227                      .dwattr $C$DW$506, DW_AT_name("MfuncV2")
    8228                      .dwattr $C$DW$506, DW_AT_TI_symbol_name("_MfuncV2")
    8229                      .dwattr $C$DW$506, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8230                      .dwattr $C$DW$506, DW_AT_accessibility(DW_ACCESS_public)
    8231              
    8232              $C$DW$507       .dwtag  DW_TAG_member
    8233                      .dwattr $C$DW$507, DW_AT_type(*$C$DW$T$28)
    8234                      .dwattr $C$DW$507, DW_AT_name("MfuncV3")
    8235                      .dwattr $C$DW$507, DW_AT_TI_symbol_name("_MfuncV3")
    8236                      .dwattr $C$DW$507, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    8237                      .dwattr $C$DW$507, DW_AT_accessibility(DW_ACCESS_public)
    8238              
    8239              $C$DW$508       .dwtag  DW_TAG_member
    8240                      .dwattr $C$DW$508, DW_AT_type(*$C$DW$T$23)
    8241                      .dwattr $C$DW$508, DW_AT_name("OutOfPhase")
    8242                      .dwattr $C$DW$508, DW_AT_TI_symbol_name("_OutOfPhase")
    8243                      .dwattr $C$DW$508, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8244                      .dwattr $C$DW$508, DW_AT_accessibility(DW_ACCESS_public)
    8245              
    8246              $C$DW$509       .dwtag  DW_TAG_member
    8247                      .dwattr $C$DW$509, DW_AT_type(*$C$DW$T$28)
    8248                      .dwattr $C$DW$509, DW_AT_name("VphaseA")
    8249                      .dwattr $C$DW$509, DW_AT_TI_symbol_name("_VphaseA")
    8250                      .dwattr $C$DW$509, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    8251                      .dwattr $C$DW$509, DW_AT_accessibility(DW_ACCESS_public)
    8252              
TMS320C2000 Assembler PC v15.12.1 Wed Jul 12 17:46:37 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
IDDK_PM_Servo_F2837x.asm                                             PAGE  175

    8253              $C$DW$510       .dwtag  DW_TAG_member
    8254                      .dwattr $C$DW$510, DW_AT_type(*$C$DW$T$28)
    8255                      .dwattr $C$DW$510, DW_AT_name("VphaseB")
    8256                      .dwattr $C$DW$510, DW_AT_TI_symbol_name("_VphaseB")
    8257                      .dwattr $C$DW$510, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    8258                      .dwattr $C$DW$510, DW_AT_accessibility(DW_ACCESS_public)
    8259              
    8260              $C$DW$511       .dwtag  DW_TAG_member
    8261                      .dwattr $C$DW$511, DW_AT_type(*$C$DW$T$28)
    8262                      .dwattr $C$DW$511, DW_AT_name("VphaseC")
    8263                      .dwattr $C$DW$511, DW_AT_TI_symbol_name("_VphaseC")
    8264                      .dwattr $C$DW$511, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    8265                      .dwattr $C$DW$511, DW_AT_accessibility(DW_ACCESS_public)
    8266              
    8267              $C$DW$512       .dwtag  DW_TAG_member
    8268                      .dwattr $C$DW$512, DW_AT_type(*$C$DW$T$28)
    8269                      .dwattr $C$DW$512, DW_AT_name("Valpha")
    8270                      .dwattr $C$DW$512, DW_AT_TI_symbol_name("_Valpha")
    8271                      .dwattr $C$DW$512, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    8272                      .dwattr $C$DW$512, DW_AT_accessibility(DW_ACCESS_public)
    8273              
    8274              $C$DW$513       .dwtag  DW_TAG_member
    8275                      .dwattr $C$DW$513, DW_AT_type(*$C$DW$T$28)
    8276                      .dwattr $C$DW$513, DW_AT_name("Vbeta")
    8277                      .dwattr $C$DW$513, DW_AT_TI_symbol_name("_Vbeta")
    8278                      .dwattr $C$DW$513, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    8279                      .dwattr $C$DW$513, DW_AT_accessibility(DW_ACCESS_public)
    8280              
    8281              $C$DW$514       .dwtag  DW_TAG_member
    8282                      .dwattr $C$DW$514, DW_AT_type(*$C$DW$T$28)
    8283                      .dwattr $C$DW$514, DW_AT_name("temp")
    8284                      .dwattr $C$DW$514, DW_AT_TI_symbol_name("_temp")
    8285                      .dwattr $C$DW$514, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    8286                      .dwattr $C$DW$514, DW_AT_accessibility(DW_ACCESS_public)
    8287              
    8288                      .dwendtag $C$DW$T$45
    8289              
    8290              $C$DW$T$692     .dwtag  DW_TAG_typedef
    8291                      .dwattr $C$DW$T$692, DW_AT_name("PHASEVOLTAGE")
    8292                      .dwattr $C$DW$T$692, DW_AT_type(*$C$DW$T$45)
    8293                      .dwattr $C$DW$T$692, DW_AT_language(DW_LANG_C)
    8294              
    8295              
    8296              $C$DW$T$47      .dwtag  DW_TAG_structure_type
    8297                      .dwattr $C$DW$T$47, DW_AT_byte_size(0x14)
    8298              $C$DW$515       .dwtag  DW_TAG_member
    8299                      .dwattr $C$DW$515, DW_AT_type(*$C$DW$T$28)
    8300                      .dwattr $C$DW$515, DW_AT_name("ElecTheta")
    8301                      .dwattr $C$DW$515, DW_AT_TI_symbol_name("_ElecTheta")
    8302                      .dwattr $C$DW$515, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8303                      .dwattr $C$DW$515, DW_AT_accessibility(DW_ACCESS_public)
    8304              
    8305              $C$DW$516       .dwtag  DW_TAG_member
    8306                      .dwattr $C$DW$516, DW_AT_type(*$C$DW$T$42)
    8307                      .dwattr $C$DW$516, DW_AT_name("DirectionQep")
TMS320C2000 Assembler PC v15.12.1 Wed Jul 12 17:46:37 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
IDDK_PM_Servo_F2837x.asm                                             PAGE  176

    8308                      .dwattr $C$DW$516, DW_AT_TI_symbol_name("_DirectionQep")
    8309                      .dwattr $C$DW$516, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8310                      .dwattr $C$DW$516, DW_AT_accessibility(DW_ACCESS_public)
    8311              
    8312              $C$DW$517       .dwtag  DW_TAG_member
    8313                      .dwattr $C$DW$517, DW_AT_type(*$C$DW$T$28)
    8314                      .dwattr $C$DW$517, DW_AT_name("OldElecTheta")
    8315                      .dwattr $C$DW$517, DW_AT_TI_symbol_name("_OldElecTheta")
    8316                      .dwattr $C$DW$517, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8317                      .dwattr $C$DW$517, DW_AT_accessibility(DW_ACCESS_public)
    8318              
    8319              $C$DW$518       .dwtag  DW_TAG_member
    8320                      .dwattr $C$DW$518, DW_AT_type(*$C$DW$T$28)
    8321                      .dwattr $C$DW$518, DW_AT_name("Speed")
    8322                      .dwattr $C$DW$518, DW_AT_TI_symbol_name("_Speed")
    8323                      .dwattr $C$DW$518, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    8324                      .dwattr $C$DW$518, DW_AT_accessibility(DW_ACCESS_public)
    8325              
    8326              $C$DW$519       .dwtag  DW_TAG_member
    8327                      .dwattr $C$DW$519, DW_AT_type(*$C$DW$T$42)
    8328                      .dwattr $C$DW$519, DW_AT_name("BaseRpm")
    8329                      .dwattr $C$DW$519, DW_AT_TI_symbol_name("_BaseRpm")
    8330                      .dwattr $C$DW$519, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
