TMS320C2000 Assembler PC v15.12.1 Tue Jul 04 10:45:52 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
resolver.asm                                                         PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                   PC v15.12.1.LTS *
       3              ;* Date/Time created: Tue Jul 04 10:45:52 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --cla_support=cla0 --float_support=fpu32 --hll_source=on --mem_model:cod
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../resolver.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v15.12.1.LTS Copyright (c) 1996-201
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Keith\Documents\GitHub\ElectricSkateboard\Software\IDDK_PM
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *

     956 0000006a 1E08-         MOVL      @_testCntr,ACC        ; [CPU_] |222| 
     957 0000006b 6F03          B         $C$L11,UNC            ; [CPU_] |222| 
     958                      ; branch occurs ; [] |222| 
     959 0000006c       $C$L10:    
     960                      .dwpsn  file "../resolver.c",line 228,column 7,is_stmt,isa 0
     961              $C$DW$47        .dwtag  DW_TAG_TI_branch
     962                      .dwattr $C$DW$47, DW_AT_low_pc(0x00)
     963                      .dwattr $C$DW$47, DW_AT_name("_resolver_PostProcess")
     964                      .dwattr $C$DW$47, DW_AT_TI_call
     965              
     966 0000006c 7640'         LCR       #_resolver_PostProcess ; [CPU_] |228| 
         0000006d 005B 
     967                      ; call occurs [#_resolver_PostProcess] ; [] |228| 
     968 0000006e       $C$L11:    
     969 0000006e 761F!         MOVW      DP,#_AdccRegs+4       ; [CPU_U] 
         0000006f 0000 
     970                      .dwpsn  file "../resolver.c",line 232,column 2,is_stmt,isa 0
     971 00000070 1A04!         OR        @_AdccRegs+4,#0x0001  ; [CPU_] |232| 
         00000071 0001 
     972 00000072 FE82          SUBB      SP,#2                 ; [CPU_U] 
     973                      .dwcfi  cfa_offset, -26
     974 00000073 761F!         MOVW      DP,#_PieCtrlRegs+1    ; [CPU_U] 
         00000074 0000 
     975 00000075 E2AF          MOV32     R3H,*--SP             ; [CPU_] 
         00000076 03BE 
     976                      .dwpsn  file "../resolver.c",line 233,column 2,is_stmt,isa 0
     977 00000077 56BF!         MOVB      @_PieCtrlRegs+1,#1,UNC ; [CPU_] |233| 
         00000078 0101 
     978 00000079 E2AF          MOV32     R2H,*--SP             ; [CPU_] 
         0000007a 02BE 
     979 0000007b E2AF          MOV32     R1H,*--SP             ; [CPU_] 
         0000007c 01BE 
     980 0000007d E2AF          MOV32     R0H,*--SP             ; [CPU_] 
         0000007e 00BE 
     981 0000007f E280          MOV32     STF,*--SP             ; [CPU_] 
         00000080 00BE 
     982                      .dwcfi  cfa_offset, -16
     983                      .dwcfi  restore_reg, 39
     984                      .dwcfi  restore_reg, 40
     985 00000081 C5BE          MOVL      XAR7,*--SP            ; [CPU_] 
     986                      .dwcfi  cfa_offset, -14
     987                      .dwcfi  restore_reg, 18
     988 00000082 C4BE          MOVL      XAR6,*--SP            ; [CPU_] 
     989                      .dwcfi  cfa_offset, -12
     990                      .dwcfi  restore_reg, 16
     991 00000083 83BE          MOVL      XAR5,*--SP            ; [CPU_] 
     992                      .dwcfi  cfa_offset, -10
     993                      .dwcfi  restore_reg, 14
TMS320C2000 Assembler PC v15.12.1 Tue Jul 04 10:45:52 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
resolver.asm                                                         PAGE   22

     994 00000084 8ABE          MOVL      XAR4,*--SP            ; [CPU_] 
     995                      .dwcfi  cfa_offset, -8
     996                      .dwcfi  restore_reg, 12
     997 00000085 87BE          MOVL      XT,*--SP              ; [CPU_] 
     998                      .dwcfi  cfa_offset, -6
     999                      .dwcfi  restore_reg, 22
    1000                      .dwcfi  restore_reg, 21
    1001 00000086 0003          POP       AR1H:AR0H             ; [CPU_] 
    1002                      .dwcfi  cfa_offset, -4
    1003                      .dwcfi  restore_reg, 5
    1004                      .dwcfi  restore_reg, 7
    1005 00000087 FFF1          POP       RB                    ; [CPU_] 
    1006                      .dwcfi  cfa_offset, -2
    1007                      .dwcfi  restore_reg, 73
    1008                      .dwcfi  restore_reg, 74
    1009 00000088 7617          NASP      ; [CPU_] 
    1010              $C$DW$48        .dwtag  DW_TAG_TI_branch
    1011                      .dwattr $C$DW$48, DW_AT_low_pc(0x00)
    1012                      .dwattr $C$DW$48, DW_AT_TI_return
    1013              
    1014 00000089 7602          IRET      ; [CPU_] 
    1015                      ; return occurs ; [] 
    1016                      .dwattr $C$DW$44, DW_AT_TI_end_file("../resolver.c")
    1017                      .dwattr $C$DW$44, DW_AT_TI_end_line(0xec)
    1018                      .dwattr $C$DW$44, DW_AT_TI_end_column(0x01)
    1019                      .dwendentry
    1020                      .dwendtag $C$DW$44
    1021              
    1022              ;**************************************************************
    1023              ;* UNDEFINED EXTERNAL REFERENCES                              *
    1024              ;**************************************************************
    1025                      .global _resolver_algo_Float
    1026                      .global _DacaRegs
    1027                      .global _AdcdResultRegs
    1028                      .global _AdccResultRegs
    1029                      .global _PieCtrlRegs
    1030                      .global _AdccRegs
    1031              
    1032              ;***************************************************************
    1033              ;* TYPE INFORMATION                                            *
    1034              ;***************************************************************
    1035              
    1036              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    1037                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x14)
    1038              $C$DW$49        .dwtag  DW_TAG_member
    1039                      .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$19)
    1040                      .dwattr $C$DW$49, DW_AT_name("firLag")
    1041                      .dwattr $C$DW$49, DW_AT_TI_symbol_name("_firLag")
    1042                      .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1043                      .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
    1044              
    1045              $C$DW$50        .dwtag  DW_TAG_member
    1046                      .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$19)
    1047                      .dwattr $C$DW$50, DW_AT_name("FIR32")
    1048                      .dwattr $C$DW$50, DW_AT_TI_symbol_name("_FIR32")
TMS320C2000 Assembler PC v15.12.1 Tue Jul 04 10:45:52 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
resolver.asm                                                         PAGE   23

    1049                      .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1050                      .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
    1051              
    1052              $C$DW$51        .dwtag  DW_TAG_member
    1053                      .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$19)
    1054                      .dwattr $C$DW$51, DW_AT_name("TUNING")
    1055                      .dwattr $C$DW$51, DW_AT_TI_symbol_name("_TUNING")
    1056                      .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1057                      .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
    1058              
    1059              $C$DW$52        .dwtag  DW_TAG_member
    1060                      .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$19)
    1061                      .dwattr $C$DW$52, DW_AT_name("TABLE_LENGTH")
    1062                      .dwattr $C$DW$52, DW_AT_TI_symbol_name("_TABLE_LENGTH")
    1063                      .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1064                      .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
    1065              
    1066              $C$DW$53        .dwtag  DW_TAG_member
    1067                      .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$16)
    1068                      .dwattr $C$DW$53, DW_AT_name("offsetS")
    1069                      .dwattr $C$DW$53, DW_AT_TI_symbol_name("_offsetS")
    1070                      .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1071                      .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
    1072              
    1073              $C$DW$54        .dwtag  DW_TAG_member
    1074                      .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$16)
    1075                      .dwattr $C$DW$54, DW_AT_name("offsetC")
    1076                      .dwattr $C$DW$54, DW_AT_TI_symbol_name("_offsetC")
    1077                      .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1078                      .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
    1079              
    1080              $C$DW$55        .dwtag  DW_TAG_member
    1081                      .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$16)
    1082                      .dwattr $C$DW$55, DW_AT_name("testAngle")
    1083                      .dwattr $C$DW$55, DW_AT_TI_symbol_name("_testAngle")
    1084                      .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1085                      .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
    1086              
    1087              $C$DW$56        .dwtag  DW_TAG_member
    1088                      .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$16)
    1089                      .dwattr $C$DW$56, DW_AT_name("SAMPLING_TIME")
    1090                      .dwattr $C$DW$56, DW_AT_TI_symbol_name("_SAMPLING_TIME")
    1091                      .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1092                      .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
    1093              
    1094              $C$DW$57        .dwtag  DW_TAG_member
    1095                      .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$16)
    1096                      .dwattr $C$DW$57, DW_AT_name("errorWfT")
    1097                      .dwattr $C$DW$57, DW_AT_TI_symbol_name("_errorWfT")
    1098                      .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1099                      .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
    1100              
    1101              $C$DW$58        .dwtag  DW_TAG_member
    1102                      .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$16)
    1103                      .dwattr $C$DW$58, DW_AT_name("picon_K0")
TMS320C2000 Assembler PC v15.12.1 Tue Jul 04 10:45:52 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
resolver.asm                                                         PAGE   24

    1104                      .dwattr $C$DW$58, DW_AT_TI_symbol_name("_picon_K0")
    1105                      .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1106                      .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
    1107              
    1108              $C$DW$59        .dwtag  DW_TAG_member
    1109                      .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$16)
    1110                      .dwattr $C$DW$59, DW_AT_name("picon_K1")
    1111                      .dwattr $C$DW$59, DW_AT_TI_symbol_name("_picon_K1")
    1112                      .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1113                      .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
    1114              
    1115              $C$DW$60        .dwtag  DW_TAG_member
    1116                      .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$16)
    1117                      .dwattr $C$DW$60, DW_AT_name("rpsMax")
    1118                      .dwattr $C$DW$60, DW_AT_TI_symbol_name("_rpsMax")
    1119                      .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1120                      .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
    1121              
    1122                      .dwendtag $C$DW$T$20
    1123              
    1124              $C$DW$T$223     .dwtag  DW_TAG_typedef
    1125                      .dwattr $C$DW$T$223, DW_AT_name("RESOLVER_INPUT")
    1126                      .dwattr $C$DW$T$223, DW_AT_type(*$C$DW$T$20)
    1127                      .dwattr $C$DW$T$223, DW_AT_language(DW_LANG_C)
    1128              
    1129              
    1130              $C$DW$T$22      .dwtag  DW_TAG_structure_type
    1131                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x22)
    1132              $C$DW$61        .dwtag  DW_TAG_member
    1133                      .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$16)
    1134                      .dwattr $C$DW$61, DW_AT_name("angleRaw")
    1135                      .dwattr $C$DW$61, DW_AT_TI_symbol_name("_angleRaw")
    1136                      .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1137                      .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
    1138              
    1139              $C$DW$62        .dwtag  DW_TAG_member
    1140                      .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$16)
    1141                      .dwattr $C$DW$62, DW_AT_name("angleObs")
    1142                      .dwattr $C$DW$62, DW_AT_TI_symbol_name("_angleObs")
    1143                      .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1144                      .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
    1145              
    1146              $C$DW$63        .dwtag  DW_TAG_member
    1147                      .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$16)
    1148                      .dwattr $C$DW$63, DW_AT_name("angleOut")
    1149                      .dwattr $C$DW$63, DW_AT_TI_symbol_name("_angleOut")
    1150                      .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1151                      .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
    1152              
    1153              $C$DW$64        .dwtag  DW_TAG_member
    1154                      .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$16)
    1155                      .dwattr $C$DW$64, DW_AT_name("rpsObs")
    1156                      .dwattr $C$DW$64, DW_AT_TI_symbol_name("_rpsObs")
    1157                      .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1158                      .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.1 Tue Jul 04 10:45:52 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
resolver.asm                                                         PAGE   25

    1159              
    1160              $C$DW$65        .dwtag  DW_TAG_member
    1161                      .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$16)
    1162                      .dwattr $C$DW$65, DW_AT_name("errorNew")
    1163                      .dwattr $C$DW$65, DW_AT_TI_symbol_name("_errorNew")
    1164                      .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1165                      .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
    1166              
    1167              $C$DW$66        .dwtag  DW_TAG_member
    1168                      .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$16)
    1169                      .dwattr $C$DW$66, DW_AT_name("resMag")
    1170                      .dwattr $C$DW$66, DW_AT_TI_symbol_name("_resMag")
    1171                      .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1172                      .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
    1173              
    1174              $C$DW$67        .dwtag  DW_TAG_member
    1175                      .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$16)
    1176                      .dwattr $C$DW$67, DW_AT_name("sinFIRout")
    1177                      .dwattr $C$DW$67, DW_AT_TI_symbol_name("_sinFIRout")
    1178                      .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1179                      .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
    1180              
    1181              $C$DW$68        .dwtag  DW_TAG_member
    1182                      .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$16)
    1183                      .dwattr $C$DW$68, DW_AT_name("cosFIRout")
    1184                      .dwattr $C$DW$68, DW_AT_TI_symbol_name("_cosFIRout")
    1185                      .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1186                      .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
    1187              
    1188              $C$DW$69        .dwtag  DW_TAG_member
    1189                      .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$21)
    1190                      .dwattr $C$DW$69, DW_AT_name("angleRaw20")
    1191                      .dwattr $C$DW$69, DW_AT_TI_symbol_name("_angleRaw20")
    1192                      .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1193                      .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
    1194              
    1195              $C$DW$70        .dwtag  DW_TAG_member
    1196                      .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$21)
    1197                      .dwattr $C$DW$70, DW_AT_name("angleObs20")
    1198                      .dwattr $C$DW$70, DW_AT_TI_symbol_name("_angleObs20")
    1199                      .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1200                      .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
    1201              
    1202              $C$DW$71        .dwtag  DW_TAG_member
    1203                      .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$21)
    1204                      .dwattr $C$DW$71, DW_AT_name("angleOut20")
    1205                      .dwattr $C$DW$71, DW_AT_TI_symbol_name("_angleOut20")
    1206                      .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1207                      .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
    1208              
    1209              $C$DW$72        .dwtag  DW_TAG_member
    1210                      .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$21)
    1211                      .dwattr $C$DW$72, DW_AT_name("rpsObs20")
    1212                      .dwattr $C$DW$72, DW_AT_TI_symbol_name("_rpsObs20")
    1213                      .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
TMS320C2000 Assembler PC v15.12.1 Tue Jul 04 10:45:52 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
resolver.asm                                                         PAGE   26

    1214                      .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
    1215              
    1216              $C$DW$73        .dwtag  DW_TAG_member
    1217                      .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$21)
    1218                      .dwattr $C$DW$73, DW_AT_name("errorNew20")
    1219                      .dwattr $C$DW$73, DW_AT_TI_symbol_name("_errorNew20")
    1220                      .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1221                      .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
    1222              
    1223              $C$DW$74        .dwtag  DW_TAG_member
    1224                      .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$21)
    1225                      .dwattr $C$DW$74, DW_AT_name("resMag20")
    1226                      .dwattr $C$DW$74, DW_AT_TI_symbol_name("_resMag20")
    1227                      .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    1228                      .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
    1229              
    1230              $C$DW$75        .dwtag  DW_TAG_member
    1231                      .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$16)
    1232                      .dwattr $C$DW$75, DW_AT_name("sin_input")
    1233                      .dwattr $C$DW$75, DW_AT_TI_symbol_name("_sin_input")
    1234                      .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1235                      .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
    1236              
    1237              $C$DW$76        .dwtag  DW_TAG_member
    1238                      .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$16)
    1239                      .dwattr $C$DW$76, DW_AT_name("cos_input")
    1240                      .dwattr $C$DW$76, DW_AT_TI_symbol_name("_cos_input")
    1241                      .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    1242                      .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
    1243              
    1244              $C$DW$77        .dwtag  DW_TAG_member
    1245                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$19)
    1246                      .dwattr $C$DW$77, DW_AT_name("sineIndex")
    1247                      .dwattr $C$DW$77, DW_AT_TI_symbol_name("_sineIndex")
    1248                      .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1249                      .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
    1250              
    1251                      .dwendtag $C$DW$T$22
    1252              
    1253              $C$DW$T$224     .dwtag  DW_TAG_typedef
    1254                      .dwattr $C$DW$T$224, DW_AT_name("RESOLVER_OUTPUT")
    1255                      .dwattr $C$DW$T$224, DW_AT_type(*$C$DW$T$22)
    1256                      .dwattr $C$DW$T$224, DW_AT_language(DW_LANG_C)
    1257              
    1258              
    1259              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    1260                      .dwattr $C$DW$T$23, DW_AT_name("ADCBURSTCTL_BITS")
    1261                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x01)
    1262              $C$DW$78        .dwtag  DW_TAG_member
    1263                      .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$19)
    1264                      .dwattr $C$DW$78, DW_AT_name("BURSTTRIGSEL")
    1265                      .dwattr $C$DW$78, DW_AT_TI_symbol_name("_BURSTTRIGSEL")
    1266                      .dwattr $C$DW$78, DW_AT_bit_offset(0x0a)
    1267                      .dwattr $C$DW$78, DW_AT_bit_size(0x06)
    1268                      .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v15.12.1 Tue Jul 04 10:45:52 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
resolver.asm                                                         PAGE   27

    1269                      .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
    1270              
    1271              $C$DW$79        .dwtag  DW_TAG_member
    1272                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$19)
    1273                      .dwattr $C$DW$79, DW_AT_name("rsvd1")
    1274                      .dwattr $C$DW$79, DW_AT_TI_symbol_name("_rsvd1")
    1275                      .dwattr $C$DW$79, DW_AT_bit_offset(0x08)
    1276                      .dwattr $C$DW$79, DW_AT_bit_size(0x02)
    1277                      .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1278                      .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    1279              
    1280              $C$DW$80        .dwtag  DW_TAG_member
    1281                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$19)
    1282                      .dwattr $C$DW$80, DW_AT_name("BURSTSIZE")
    1283                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_BURSTSIZE")
    1284                      .dwattr $C$DW$80, DW_AT_bit_offset(0x04)
    1285                      .dwattr $C$DW$80, DW_AT_bit_size(0x04)
    1286                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1287                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    1288              
    1289              $C$DW$81        .dwtag  DW_TAG_member
    1290                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$19)
    1291                      .dwattr $C$DW$81, DW_AT_name("rsvd2")
    1292                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_rsvd2")
    1293                      .dwattr $C$DW$81, DW_AT_bit_offset(0x01)
    1294                      .dwattr $C$DW$81, DW_AT_bit_size(0x03)
    1295                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1296                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1297              
    1298              $C$DW$82        .dwtag  DW_TAG_member
    1299                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$19)
    1300                      .dwattr $C$DW$82, DW_AT_name("BURSTEN")
    1301                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_BURSTEN")
    1302                      .dwattr $C$DW$82, DW_AT_bit_offset(0x00)
    1303                      .dwattr $C$DW$82, DW_AT_bit_size(0x01)
    1304                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1305                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1306              
    1307                      .dwendtag $C$DW$T$23
    1308              
    1309              
    1310              $C$DW$T$24      .dwtag  DW_TAG_union_type
    1311                      .dwattr $C$DW$T$24, DW_AT_name("ADCBURSTCTL_REG")
    1312                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x01)
    1313              $C$DW$83        .dwtag  DW_TAG_member
    1314                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$19)
    1315                      .dwattr $C$DW$83, DW_AT_name("all")
    1316                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_all")
    1317                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1318                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1319              
    1320              $C$DW$84        .dwtag  DW_TAG_member
    1321                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$23)
    1322                      .dwattr $C$DW$84, DW_AT_name("bit")
    1323                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_bit")
TMS320C2000 Assembler PC v15.12.1 Tue Jul 04 10:45:52 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
resolver.asm                                                         PAGE   28

    1324                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1325                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1326              
    1327                      .dwendtag $C$DW$T$24
    1328              
    1329              
    1330              $C$DW$T$25      .dwtag  DW_TAG_structure_type
    1331                      .dwattr $C$DW$T$25, DW_AT_name("ADCCOUNTER_BITS")
    1332                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x01)
    1333              $C$DW$85        .dwtag  DW_TAG_member
    1334                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$19)
    1335                      .dwattr $C$DW$85, DW_AT_name("FREECOUNT")
    1336                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_FREECOUNT")
    1337                      .dwattr $C$DW$85, DW_AT_bit_offset(0x04)
    1338                      .dwattr $C$DW$85, DW_AT_bit_size(0x0c)
    1339                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1340                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1341              
    1342              $C$DW$86        .dwtag  DW_TAG_member
    1343                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$19)
    1344                      .dwattr $C$DW$86, DW_AT_name("rsvd1")
    1345                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_rsvd1")
    1346                      .dwattr $C$DW$86, DW_AT_bit_offset(0x00)
    1347                      .dwattr $C$DW$86, DW_AT_bit_size(0x04)
    1348                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1349                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1350              
    1351                      .dwendtag $C$DW$T$25
    1352              
    1353              
    1354              $C$DW$T$26      .dwtag  DW_TAG_union_type
    1355                      .dwattr $C$DW$T$26, DW_AT_name("ADCCOUNTER_REG")
    1356                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x01)
    1357              $C$DW$87        .dwtag  DW_TAG_member
    1358                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$19)
    1359                      .dwattr $C$DW$87, DW_AT_name("all")
    1360                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_all")
    1361                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1362                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1363              
    1364              $C$DW$88        .dwtag  DW_TAG_member
    1365                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$25)
    1366                      .dwattr $C$DW$88, DW_AT_name("bit")
    1367                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_bit")
    1368                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1369                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1370              
    1371                      .dwendtag $C$DW$T$26
    1372              
    1373              
    1374              $C$DW$T$27      .dwtag  DW_TAG_structure_type
    1375                      .dwattr $C$DW$T$27, DW_AT_name("ADCCTL1_BITS")
    1376                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x01)
    1377              $C$DW$89        .dwtag  DW_TAG_member
    1378                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v15.12.1 Tue Jul 04 10:45:52 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
resolver.asm                                                         PAGE   29

    1379                      .dwattr $C$DW$89, DW_AT_name("rsvd1")
    1380                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_rsvd1")
    1381                      .dwattr $C$DW$89, DW_AT_bit_offset(0x0e)
    1382                      .dwattr $C$DW$89, DW_AT_bit_size(0x02)
    1383                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1384                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1385              
    1386              $C$DW$90        .dwtag  DW_TAG_member
    1387                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$19)
    1388                      .dwattr $C$DW$90, DW_AT_name("INTPULSEPOS")
    1389                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_INTPULSEPOS")
    1390                      .dwattr $C$DW$90, DW_AT_bit_offset(0x0d)
    1391                      .dwattr $C$DW$90, DW_AT_bit_size(0x01)
    1392                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1393                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1394              
    1395              $C$DW$91        .dwtag  DW_TAG_member
    1396                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$19)
    1397                      .dwattr $C$DW$91, DW_AT_name("rsvd2")
    1398                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_rsvd2")
    1399                      .dwattr $C$DW$91, DW_AT_bit_offset(0x09)
    1400                      .dwattr $C$DW$91, DW_AT_bit_size(0x04)
    1401                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1402                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1403              
    1404              $C$DW$92        .dwtag  DW_TAG_member
    1405                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$19)
    1406                      .dwattr $C$DW$92, DW_AT_name("ADCPWDNZ")
    1407                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_ADCPWDNZ")
    1408                      .dwattr $C$DW$92, DW_AT_bit_offset(0x08)
    1409                      .dwattr $C$DW$92, DW_AT_bit_size(0x01)
    1410                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1411                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1412              
    1413              $C$DW$93        .dwtag  DW_TAG_member
    1414                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$19)
    1415                      .dwattr $C$DW$93, DW_AT_name("ADCBSYCHN")
    1416                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_ADCBSYCHN")
    1417                      .dwattr $C$DW$93, DW_AT_bit_offset(0x04)
    1418                      .dwattr $C$DW$93, DW_AT_bit_size(0x04)
    1419                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1420                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1421              
    1422              $C$DW$94        .dwtag  DW_TAG_member
    1423                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$19)
    1424                      .dwattr $C$DW$94, DW_AT_name("rsvd3")
    1425                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_rsvd3")
    1426                      .dwattr $C$DW$94, DW_AT_bit_offset(0x03)
    1427                      .dwattr $C$DW$94, DW_AT_bit_size(0x01)
    1428                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1429                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1430              
    1431              $C$DW$95        .dwtag  DW_TAG_member
    1432                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$19)
    1433                      .dwattr $C$DW$95, DW_AT_name("ADCBSY")
TMS320C2000 Assembler PC v15.12.1 Tue Jul 04 10:45:52 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
resolver.asm                                                         PAGE   30

    1434                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_ADCBSY")
    1435                      .dwattr $C$DW$95, DW_AT_bit_offset(0x02)
    1436                      .dwattr $C$DW$95, DW_AT_bit_size(0x01)
    1437                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1438                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1439              
    1440              $C$DW$96        .dwtag  DW_TAG_member
    1441                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$19)
    1442                      .dwattr $C$DW$96, DW_AT_name("rsvd4")
    1443                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_rsvd4")
    1444                      .dwattr $C$DW$96, DW_AT_bit_offset(0x00)
    1445                      .dwattr $C$DW$96, DW_AT_bit_size(0x02)
    1446                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1447                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1448              
    1449                      .dwendtag $C$DW$T$27
    1450              
    1451              
    1452              $C$DW$T$28      .dwtag  DW_TAG_union_type
    1453                      .dwattr $C$DW$T$28, DW_AT_name("ADCCTL1_REG")
    1454                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x01)
    1455              $C$DW$97        .dwtag  DW_TAG_member
    1456                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$19)
    1457                      .dwattr $C$DW$97, DW_AT_name("all")
    1458                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_all")
    1459                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1460                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1461              
    1462              $C$DW$98        .dwtag  DW_TAG_member
    1463                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$27)
    1464                      .dwattr $C$DW$98, DW_AT_name("bit")
    1465                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_bit")
    1466                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1467                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1468              
    1469                      .dwendtag $C$DW$T$28
    1470              
    1471              
    1472              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    1473                      .dwattr $C$DW$T$29, DW_AT_name("ADCCTL2_BITS")
    1474                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x01)
    1475              $C$DW$99        .dwtag  DW_TAG_member
    1476                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$19)
    1477                      .dwattr $C$DW$99, DW_AT_name("PRESCALE")
    1478                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_PRESCALE")
    1479                      .dwattr $C$DW$99, DW_AT_bit_offset(0x0c)
    1480                      .dwattr $C$DW$99, DW_AT_bit_size(0x04)
    1481                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1482                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1483              
    1484              $C$DW$100       .dwtag  DW_TAG_member
    1485                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$19)
    1486                      .dwattr $C$DW$100, DW_AT_name("rsvd1")
    1487                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_rsvd1")
    1488                      .dwattr $C$DW$100, DW_AT_bit_offset(0x0a)
TMS320C2000 Assembler PC v15.12.1 Tue Jul 04 10:45:52 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
resolver.asm                                                         PAGE   31

    1489                      .dwattr $C$DW$100, DW_AT_bit_size(0x02)
    1490                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1491                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1492              
    1493              $C$DW$101       .dwtag  DW_TAG_member
    1494                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$19)
    1495                      .dwattr $C$DW$101, DW_AT_name("RESOLUTION")
    1496                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_RESOLUTION")
    1497                      .dwattr $C$DW$101, DW_AT_bit_offset(0x09)
    1498                      .dwattr $C$DW$101, DW_AT_bit_size(0x01)
    1499                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1500                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1501              
    1502              $C$DW$102       .dwtag  DW_TAG_member
    1503                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$19)
    1504                      .dwattr $C$DW$102, DW_AT_name("SIGNALMODE")
    1505                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_SIGNALMODE")
    1506                      .dwattr $C$DW$102, DW_AT_bit_offset(0x08)
    1507                      .dwattr $C$DW$102, DW_AT_bit_size(0x01)
    1508                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1509                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1510              
    1511              $C$DW$103       .dwtag  DW_TAG_member
    1512                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$19)
    1513                      .dwattr $C$DW$103, DW_AT_name("rsvd2")
    1514                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_rsvd2")
    1515                      .dwattr $C$DW$103, DW_AT_bit_offset(0x03)
    1516                      .dwattr $C$DW$103, DW_AT_bit_size(0x05)
    1517                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1518                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1519              
    1520              $C$DW$104       .dwtag  DW_TAG_member
    1521                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$19)
    1522                      .dwattr $C$DW$104, DW_AT_name("rsvd3")
    1523                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_rsvd3")
    1524                      .dwattr $C$DW$104, DW_AT_bit_offset(0x00)
    1525                      .dwattr $C$DW$104, DW_AT_bit_size(0x03)
    1526                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1527                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1528              
    1529                      .dwendtag $C$DW$T$29
    1530              
    1531              
    1532              $C$DW$T$30      .dwtag  DW_TAG_union_type
    1533                      .dwattr $C$DW$T$30, DW_AT_name("ADCCTL2_REG")
    1534                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x01)
    1535              $C$DW$105       .dwtag  DW_TAG_member
    1536                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$19)
    1537                      .dwattr $C$DW$105, DW_AT_name("all")
    1538                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_all")
    1539                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1540                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1541              
    1542              $C$DW$106       .dwtag  DW_TAG_member
    1543                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$29)
TMS320C2000 Assembler PC v15.12.1 Tue Jul 04 10:45:52 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
resolver.asm                                                         PAGE   32

    1544                      .dwattr $C$DW$106, DW_AT_name("bit")
    1545                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_bit")
    1546                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1547                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1548              
    1549                      .dwendtag $C$DW$T$30
    1550              
    1551              
    1552              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    1553                      .dwattr $C$DW$T$31, DW_AT_name("ADCEVTCLR_BITS")
    1554                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x01)
    1555              $C$DW$107       .dwtag  DW_TAG_member
    1556                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$19)
    1557                      .dwattr $C$DW$107, DW_AT_name("PPB1TRIPHI")
    1558                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_PPB1TRIPHI")
    1559                      .dwattr $C$DW$107, DW_AT_bit_offset(0x0f)
    1560                      .dwattr $C$DW$107, DW_AT_bit_size(0x01)
    1561                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1562                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1563              
    1564              $C$DW$108       .dwtag  DW_TAG_member
    1565                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$19)
    1566                      .dwattr $C$DW$108, DW_AT_name("PPB1TRIPLO")
    1567                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_PPB1TRIPLO")
    1568                      .dwattr $C$DW$108, DW_AT_bit_offset(0x0e)
    1569                      .dwattr $C$DW$108, DW_AT_bit_size(0x01)
    1570                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1571                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1572              
    1573              $C$DW$109       .dwtag  DW_TAG_member
    1574                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$19)
    1575                      .dwattr $C$DW$109, DW_AT_name("PPB1ZERO")
    1576                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_PPB1ZERO")
    1577                      .dwattr $C$DW$109, DW_AT_bit_offset(0x0d)
    1578                      .dwattr $C$DW$109, DW_AT_bit_size(0x01)
    1579                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1580                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1581              
    1582              $C$DW$110       .dwtag  DW_TAG_member
    1583                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$19)
    1584                      .dwattr $C$DW$110, DW_AT_name("rsvd1")
    1585                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_rsvd1")
    1586                      .dwattr $C$DW$110, DW_AT_bit_offset(0x0c)
    1587                      .dwattr $C$DW$110, DW_AT_bit_size(0x01)
    1588                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1589                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1590              
    1591              $C$DW$111       .dwtag  DW_TAG_member
    1592                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$19)
    1593                      .dwattr $C$DW$111, DW_AT_name("PPB2TRIPHI")
    1594                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_PPB2TRIPHI")
    1595                      .dwattr $C$DW$111, DW_AT_bit_offset(0x0b)
    1596                      .dwattr $C$DW$111, DW_AT_bit_size(0x01)
    1597                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1598                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.1 Tue Jul 04 10:45:52 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
resolver.asm                                                         PAGE   33

    1599              
    1600              $C$DW$112       .dwtag  DW_TAG_member
    1601                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$19)
    1602                      .dwattr $C$DW$112, DW_AT_name("PPB2TRIPLO")
    1603                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_PPB2TRIPLO")
    1604                      .dwattr $C$DW$112, DW_AT_bit_offset(0x0a)
    1605                      .dwattr $C$DW$112, DW_AT_bit_size(0x01)
    1606                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1607                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1608              
    1609              $C$DW$113       .dwtag  DW_TAG_member
    1610                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$19)
    1611                      .dwattr $C$DW$113, DW_AT_name("PPB2ZERO")
    1612                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_PPB2ZERO")
    1613                      .dwattr $C$DW$113, DW_AT_bit_offset(0x09)
    1614                      .dwattr $C$DW$113, DW_AT_bit_size(0x01)
    1615                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1616                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1617              
    1618              $C$DW$114       .dwtag  DW_TAG_member
    1619                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$19)
    1620                      .dwattr $C$DW$114, DW_AT_name("rsvd2")
    1621                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_rsvd2")
    1622                      .dwattr $C$DW$114, DW_AT_bit_offset(0x08)
    1623                      .dwattr $C$DW$114, DW_AT_bit_size(0x01)
    1624                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1625                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1626              
    1627              $C$DW$115       .dwtag  DW_TAG_member
    1628                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$19)
    1629                      .dwattr $C$DW$115, DW_AT_name("PPB3TRIPHI")
    1630                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_PPB3TRIPHI")
    1631                      .dwattr $C$DW$115, DW_AT_bit_offset(0x07)
    1632                      .dwattr $C$DW$115, DW_AT_bit_size(0x01)
    1633                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1634                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1635              
    1636              $C$DW$116       .dwtag  DW_TAG_member
    1637                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$19)
    1638                      .dwattr $C$DW$116, DW_AT_name("PPB3TRIPLO")
    1639                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_PPB3TRIPLO")
    1640                      .dwattr $C$DW$116, DW_AT_bit_offset(0x06)
    1641                      .dwattr $C$DW$116, DW_AT_bit_size(0x01)
    1642                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1643                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1644              
    1645              $C$DW$117       .dwtag  DW_TAG_member
    1646                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$19)
    1647                      .dwattr $C$DW$117, DW_AT_name("PPB3ZERO")
    1648                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_PPB3ZERO")
    1649                      .dwattr $C$DW$117, DW_AT_bit_offset(0x05)
    1650                      .dwattr $C$DW$117, DW_AT_bit_size(0x01)
    1651                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1652                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1653              
TMS320C2000 Assembler PC v15.12.1 Tue Jul 04 10:45:52 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
resolver.asm                                                         PAGE   34

    1654              $C$DW$118       .dwtag  DW_TAG_member
    1655                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$19)
    1656                      .dwattr $C$DW$118, DW_AT_name("rsvd3")
    1657                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_rsvd3")
    1658                      .dwattr $C$DW$118, DW_AT_bit_offset(0x04)
    1659                      .dwattr $C$DW$118, DW_AT_bit_size(0x01)
    1660                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1661                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1662              
    1663              $C$DW$119       .dwtag  DW_TAG_member
    1664                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$19)
    1665                      .dwattr $C$DW$119, DW_AT_name("PPB4TRIPHI")
    1666                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_PPB4TRIPHI")
    1667                      .dwattr $C$DW$119, DW_AT_bit_offset(0x03)
    1668                      .dwattr $C$DW$119, DW_AT_bit_size(0x01)
    1669                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1670                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1671              
    1672              $C$DW$120       .dwtag  DW_TAG_member
    1673                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$19)
    1674                      .dwattr $C$DW$120, DW_AT_name("PPB4TRIPLO")
    1675                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_PPB4TRIPLO")
    1676                      .dwattr $C$DW$120, DW_AT_bit_offset(0x02)
    1677                      .dwattr $C$DW$120, DW_AT_bit_size(0x01)
    1678                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1679                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1680              
    1681              $C$DW$121       .dwtag  DW_TAG_member
    1682                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$19)
    1683                      .dwattr $C$DW$121, DW_AT_name("PPB4ZERO")
    1684                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_PPB4ZERO")
    1685                      .dwattr $C$DW$121, DW_AT_bit_offset(0x01)
    1686                      .dwattr $C$DW$121, DW_AT_bit_size(0x01)
    1687                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1688                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1689              
    1690              $C$DW$122       .dwtag  DW_TAG_member
    1691                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$19)
    1692                      .dwattr $C$DW$122, DW_AT_name("rsvd4")
    1693                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_rsvd4")
    1694                      .dwattr $C$DW$122, DW_AT_bit_offset(0x00)
    1695                      .dwattr $C$DW$122, DW_AT_bit_size(0x01)
    1696                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1697                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1698              
    1699                      .dwendtag $C$DW$T$31
    1700              
    1701              
    1702              $C$DW$T$32      .dwtag  DW_TAG_union_type
    1703                      .dwattr $C$DW$T$32, DW_AT_name("ADCEVTCLR_REG")
    1704                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x01)
    1705              $C$DW$123       .dwtag  DW_TAG_member
    1706                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$19)
    1707                      .dwattr $C$DW$123, DW_AT_name("all")
    1708                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_all")
TMS320C2000 Assembler PC v15.12.1 Tue Jul 04 10:45:52 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
resolver.asm                                                         PAGE   35

    1709                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1710                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1711              
    1712              $C$DW$124       .dwtag  DW_TAG_member
    1713                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$31)
    1714                      .dwattr $C$DW$124, DW_AT_name("bit")
    1715                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_bit")
    1716                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1717                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1718              
    1719                      .dwendtag $C$DW$T$32
    1720              
    1721              
    1722              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    1723                      .dwattr $C$DW$T$33, DW_AT_name("ADCEVTINTSEL_BITS")
    1724                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
    1725              $C$DW$125       .dwtag  DW_TAG_member
    1726                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$19)
    1727                      .dwattr $C$DW$125, DW_AT_name("PPB1TRIPHI")
    1728                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_PPB1TRIPHI")
    1729                      .dwattr $C$DW$125, DW_AT_bit_offset(0x0f)
    1730                      .dwattr $C$DW$125, DW_AT_bit_size(0x01)
    1731                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1732                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1733              
    1734              $C$DW$126       .dwtag  DW_TAG_member
    1735                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$19)
    1736                      .dwattr $C$DW$126, DW_AT_name("PPB1TRIPLO")
    1737                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_PPB1TRIPLO")
    1738                      .dwattr $C$DW$126, DW_AT_bit_offset(0x0e)
    1739                      .dwattr $C$DW$126, DW_AT_bit_size(0x01)
    1740                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1741                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1742              
    1743              $C$DW$127       .dwtag  DW_TAG_member
    1744                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$19)
    1745                      .dwattr $C$DW$127, DW_AT_name("PPB1ZERO")
    1746                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_PPB1ZERO")
    1747                      .dwattr $C$DW$127, DW_AT_bit_offset(0x0d)
    1748                      .dwattr $C$DW$127, DW_AT_bit_size(0x01)
    1749                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1750                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1751              
    1752              $C$DW$128       .dwtag  DW_TAG_member
    1753                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$19)
    1754                      .dwattr $C$DW$128, DW_AT_name("rsvd1")
    1755                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_rsvd1")
    1756                      .dwattr $C$DW$128, DW_AT_bit_offset(0x0c)
    1757                      .dwattr $C$DW$128, DW_AT_bit_size(0x01)
    1758                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1759                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1760              
    1761              $C$DW$129       .dwtag  DW_TAG_member
    1762                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$19)
    1763                      .dwattr $C$DW$129, DW_AT_name("PPB2TRIPHI")
TMS320C2000 Assembler PC v15.12.1 Tue Jul 04 10:45:52 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
resolver.asm                                                         PAGE   36

    1764                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_PPB2TRIPHI")
    1765                      .dwattr $C$DW$129, DW_AT_bit_offset(0x0b)
    1766                      .dwattr $C$DW$129, DW_AT_bit_size(0x01)
    1767                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1768                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1769              
    1770              $C$DW$130       .dwtag  DW_TAG_member
    1771                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$19)
    1772                      .dwattr $C$DW$130, DW_AT_name("PPB2TRIPLO")
    1773                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_PPB2TRIPLO")
    1774                      .dwattr $C$DW$130, DW_AT_bit_offset(0x0a)
    1775                      .dwattr $C$DW$130, DW_AT_bit_size(0x01)
    1776                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1777                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1778              
    1779              $C$DW$131       .dwtag  DW_TAG_member
    1780                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$19)
    1781                      .dwattr $C$DW$131, DW_AT_name("PPB2ZERO")
    1782                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_PPB2ZERO")
    1783                      .dwattr $C$DW$131, DW_AT_bit_offset(0x09)
    1784                      .dwattr $C$DW$131, DW_AT_bit_size(0x01)
    1785                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1786                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1787              
    1788              $C$DW$132       .dwtag  DW_TAG_member
    1789                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$19)
    1790                      .dwattr $C$DW$132, DW_AT_name("rsvd2")
    1791                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_rsvd2")
    1792                      .dwattr $C$DW$132, DW_AT_bit_offset(0x08)
    1793                      .dwattr $C$DW$132, DW_AT_bit_size(0x01)
    1794                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1795                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1796              
    1797              $C$DW$133       .dwtag  DW_TAG_member
    1798                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$19)
    1799                      .dwattr $C$DW$133, DW_AT_name("PPB3TRIPHI")
    1800                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_PPB3TRIPHI")
    1801                      .dwattr $C$DW$133, DW_AT_bit_offset(0x07)
    1802                      .dwattr $C$DW$133, DW_AT_bit_size(0x01)
    1803                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1804                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1805              
    1806              $C$DW$134       .dwtag  DW_TAG_member
    1807                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$19)
    1808                      .dwattr $C$DW$134, DW_AT_name("PPB3TRIPLO")
    1809                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_PPB3TRIPLO")
    1810                      .dwattr $C$DW$134, DW_AT_bit_offset(0x06)
    1811                      .dwattr $C$DW$134, DW_AT_bit_size(0x01)
    1812                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1813                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1814              
    1815              $C$DW$135       .dwtag  DW_TAG_member
    1816                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$19)
    1817                      .dwattr $C$DW$135, DW_AT_name("PPB3ZERO")
    1818                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_PPB3ZERO")
TMS320C2000 Assembler PC v15.12.1 Tue Jul 04 10:45:52 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
resolver.asm                                                         PAGE   37

    1819                      .dwattr $C$DW$135, DW_AT_bit_offset(0x05)
    1820                      .dwattr $C$DW$135, DW_AT_bit_size(0x01)
    1821                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1822                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1823              
    1824              $C$DW$136       .dwtag  DW_TAG_member
    1825                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$19)
    1826                      .dwattr $C$DW$136, DW_AT_name("rsvd3")
    1827                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_rsvd3")
    1828                      .dwattr $C$DW$136, DW_AT_bit_offset(0x04)
    1829                      .dwattr $C$DW$136, DW_AT_bit_size(0x01)
    1830                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1831                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1832              
    1833              $C$DW$137       .dwtag  DW_TAG_member
    1834                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$19)
    1835                      .dwattr $C$DW$137, DW_AT_name("PPB4TRIPHI")
    1836                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_PPB4TRIPHI")
    1837                      .dwattr $C$DW$137, DW_AT_bit_offset(0x03)
    1838                      .dwattr $C$DW$137, DW_AT_bit_size(0x01)
    1839                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1840                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1841              
    1842              $C$DW$138       .dwtag  DW_TAG_member
    1843                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$19)
    1844                      .dwattr $C$DW$138, DW_AT_name("PPB4TRIPLO")
    1845                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_PPB4TRIPLO")
    1846                      .dwattr $C$DW$138, DW_AT_bit_offset(0x02)
    1847                      .dwattr $C$DW$138, DW_AT_bit_size(0x01)
    1848                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1849                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1850              
    1851              $C$DW$139       .dwtag  DW_TAG_member
    1852                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$19)
    1853                      .dwattr $C$DW$139, DW_AT_name("PPB4ZERO")
    1854                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_PPB4ZERO")
    1855                      .dwattr $C$DW$139, DW_AT_bit_offset(0x01)
    1856                      .dwattr $C$DW$139, DW_AT_bit_size(0x01)
    1857                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1858                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1859              
    1860              $C$DW$140       .dwtag  DW_TAG_member
    1861                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$19)
    1862                      .dwattr $C$DW$140, DW_AT_name("rsvd4")
    1863                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_rsvd4")
    1864                      .dwattr $C$DW$140, DW_AT_bit_offset(0x00)
    1865                      .dwattr $C$DW$140, DW_AT_bit_size(0x01)
    1866                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1867                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1868              
    1869                      .dwendtag $C$DW$T$33
    1870              
    1871              
    1872              $C$DW$T$34      .dwtag  DW_TAG_union_type
    1873                      .dwattr $C$DW$T$34, DW_AT_name("ADCEVTINTSEL_REG")
TMS320C2000 Assembler PC v15.12.1 Tue Jul 04 10:45:52 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
resolver.asm                                                         PAGE   38

    1874                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
    1875              $C$DW$141       .dwtag  DW_TAG_member
    1876                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$19)
    1877                      .dwattr $C$DW$141, DW_AT_name("all")
    1878                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_all")
    1879                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1880                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1881              
    1882              $C$DW$142       .dwtag  DW_TAG_member
    1883                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$33)
    1884                      .dwattr $C$DW$142, DW_AT_name("bit")
    1885                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_bit")
    1886                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1887                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1888              
    1889                      .dwendtag $C$DW$T$34
    1890              
    1891              
    1892              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    1893                      .dwattr $C$DW$T$35, DW_AT_name("ADCEVTSEL_BITS")
    1894                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x01)
    1895              $C$DW$143       .dwtag  DW_TAG_member
    1896                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$19)
    1897                      .dwattr $C$DW$143, DW_AT_name("PPB1TRIPHI")
    1898                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_PPB1TRIPHI")
    1899                      .dwattr $C$DW$143, DW_AT_bit_offset(0x0f)
    1900                      .dwattr $C$DW$143, DW_AT_bit_size(0x01)
    1901                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1902                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1903              
    1904              $C$DW$144       .dwtag  DW_TAG_member
    1905                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$19)
    1906                      .dwattr $C$DW$144, DW_AT_name("PPB1TRIPLO")
    1907                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_PPB1TRIPLO")
    1908                      .dwattr $C$DW$144, DW_AT_bit_offset(0x0e)
    1909                      .dwattr $C$DW$144, DW_AT_bit_size(0x01)
    1910                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1911                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1912              
    1913              $C$DW$145       .dwtag  DW_TAG_member
    1914                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$19)
    1915                      .dwattr $C$DW$145, DW_AT_name("PPB1ZERO")
    1916                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_PPB1ZERO")
    1917                      .dwattr $C$DW$145, DW_AT_bit_offset(0x0d)
    1918                      .dwattr $C$DW$145, DW_AT_bit_size(0x01)
    1919                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1920                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1921              
    1922              $C$DW$146       .dwtag  DW_TAG_member
    1923                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$19)
    1924                      .dwattr $C$DW$146, DW_AT_name("rsvd1")
    1925                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_rsvd1")
    1926                      .dwattr $C$DW$146, DW_AT_bit_offset(0x0c)
    1927                      .dwattr $C$DW$146, DW_AT_bit_size(0x01)
    1928                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v15.12.1 Tue Jul 04 10:45:52 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
resolver.asm                                                         PAGE   39

    1929                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    1930              
    1931              $C$DW$147       .dwtag  DW_TAG_member
    1932                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$19)
    1933                      .dwattr $C$DW$147, DW_AT_name("PPB2TRIPHI")
    1934                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_PPB2TRIPHI")
    1935                      .dwattr $C$DW$147, DW_AT_bit_offset(0x0b)
    1936                      .dwattr $C$DW$147, DW_AT_bit_size(0x01)
    1937                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1938                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    1939              
    1940              $C$DW$148       .dwtag  DW_TAG_member
    1941                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$19)
    1942                      .dwattr $C$DW$148, DW_AT_name("PPB2TRIPLO")
    1943                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_PPB2TRIPLO")
    1944                      .dwattr $C$DW$148, DW_AT_bit_offset(0x0a)
    1945                      .dwattr $C$DW$148, DW_AT_bit_size(0x01)
    1946                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1947                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1948              
    1949              $C$DW$149       .dwtag  DW_TAG_member
    1950                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$19)
    1951                      .dwattr $C$DW$149, DW_AT_name("PPB2ZERO")
    1952                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_PPB2ZERO")
    1953                      .dwattr $C$DW$149, DW_AT_bit_offset(0x09)
    1954                      .dwattr $C$DW$149, DW_AT_bit_size(0x01)
    1955                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1956                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1957              
    1958              $C$DW$150       .dwtag  DW_TAG_member
    1959                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$19)
    1960                      .dwattr $C$DW$150, DW_AT_name("rsvd2")
    1961                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_rsvd2")
    1962                      .dwattr $C$DW$150, DW_AT_bit_offset(0x08)
    1963                      .dwattr $C$DW$150, DW_AT_bit_size(0x01)
    1964                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1965                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    1966              
    1967              $C$DW$151       .dwtag  DW_TAG_member
    1968                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$19)
    1969                      .dwattr $C$DW$151, DW_AT_name("PPB3TRIPHI")
    1970                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_PPB3TRIPHI")
    1971                      .dwattr $C$DW$151, DW_AT_bit_offset(0x07)
    1972                      .dwattr $C$DW$151, DW_AT_bit_size(0x01)
    1973                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1974                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    1975              
    1976              $C$DW$152       .dwtag  DW_TAG_member
    1977                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$19)
    1978                      .dwattr $C$DW$152, DW_AT_name("PPB3TRIPLO")
    1979                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_PPB3TRIPLO")
    1980                      .dwattr $C$DW$152, DW_AT_bit_offset(0x06)
    1981                      .dwattr $C$DW$152, DW_AT_bit_size(0x01)
    1982                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1983                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.1 Tue Jul 04 10:45:52 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
resolver.asm                                                         PAGE   40

    1984              
    1985              $C$DW$153       .dwtag  DW_TAG_member
    1986                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$19)
    1987                      .dwattr $C$DW$153, DW_AT_name("PPB3ZERO")
    1988                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_PPB3ZERO")
    1989                      .dwattr $C$DW$153, DW_AT_bit_offset(0x05)
    1990                      .dwattr $C$DW$153, DW_AT_bit_size(0x01)
    1991                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1992                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    1993              
    1994              $C$DW$154       .dwtag  DW_TAG_member
    1995                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$19)
    1996                      .dwattr $C$DW$154, DW_AT_name("rsvd3")
    1997                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_rsvd3")
    1998                      .dwattr $C$DW$154, DW_AT_bit_offset(0x04)
    1999                      .dwattr $C$DW$154, DW_AT_bit_size(0x01)
    2000                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2001                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    2002              
    2003              $C$DW$155       .dwtag  DW_TAG_member
    2004                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$19)
    2005                      .dwattr $C$DW$155, DW_AT_name("PPB4TRIPHI")
    2006                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_PPB4TRIPHI")
    2007                      .dwattr $C$DW$155, DW_AT_bit_offset(0x03)
    2008                      .dwattr $C$DW$155, DW_AT_bit_size(0x01)
    2009                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2010                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    2011              
    2012              $C$DW$156       .dwtag  DW_TAG_member
    2013                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$19)
    2014                      .dwattr $C$DW$156, DW_AT_name("PPB4TRIPLO")
    2015                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_PPB4TRIPLO")
    2016                      .dwattr $C$DW$156, DW_AT_bit_offset(0x02)
    2017                      .dwattr $C$DW$156, DW_AT_bit_size(0x01)
    2018                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2019                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    2020              
    2021              $C$DW$157       .dwtag  DW_TAG_member
    2022                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$19)
    2023                      .dwattr $C$DW$157, DW_AT_name("PPB4ZERO")
    2024                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_PPB4ZERO")
    2025                      .dwattr $C$DW$157, DW_AT_bit_offset(0x01)
    2026                      .dwattr $C$DW$157, DW_AT_bit_size(0x01)
    2027                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2028                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    2029              
    2030              $C$DW$158       .dwtag  DW_TAG_member
    2031                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$19)
    2032                      .dwattr $C$DW$158, DW_AT_name("rsvd4")
    2033                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_rsvd4")
    2034                      .dwattr $C$DW$158, DW_AT_bit_offset(0x00)
    2035                      .dwattr $C$DW$158, DW_AT_bit_size(0x01)
    2036                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2037                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    2038              
TMS320C2000 Assembler PC v15.12.1 Tue Jul 04 10:45:52 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
resolver.asm                                                         PAGE   41

    2039                      .dwendtag $C$DW$T$35
    2040              
    2041              
    2042              $C$DW$T$36      .dwtag  DW_TAG_union_type
    2043                      .dwattr $C$DW$T$36, DW_AT_name("ADCEVTSEL_REG")
    2044                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x01)
    2045              $C$DW$159       .dwtag  DW_TAG_member
    2046                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$19)
    2047                      .dwattr $C$DW$159, DW_AT_name("all")
    2048                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_all")
    2049                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2050                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    2051              
    2052              $C$DW$160       .dwtag  DW_TAG_member
    2053                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$35)
    2054                      .dwattr $C$DW$160, DW_AT_name("bit")
    2055                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_bit")
    2056                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2057                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    2058              
    2059                      .dwendtag $C$DW$T$36
    2060              
    2061              
    2062              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    2063                      .dwattr $C$DW$T$37, DW_AT_name("ADCEVTSTAT_BITS")
    2064                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x01)
    2065              $C$DW$161       .dwtag  DW_TAG_member
    2066                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$19)
    2067                      .dwattr $C$DW$161, DW_AT_name("PPB1TRIPHI")
    2068                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_PPB1TRIPHI")
    2069                      .dwattr $C$DW$161, DW_AT_bit_offset(0x0f)
    2070                      .dwattr $C$DW$161, DW_AT_bit_size(0x01)
    2071                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2072                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    2073              
    2074              $C$DW$162       .dwtag  DW_TAG_member
    2075                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$19)
    2076                      .dwattr $C$DW$162, DW_AT_name("PPB1TRIPLO")
    2077                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_PPB1TRIPLO")
    2078                      .dwattr $C$DW$162, DW_AT_bit_offset(0x0e)
    2079                      .dwattr $C$DW$162, DW_AT_bit_size(0x01)
    2080                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2081                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    2082              
    2083              $C$DW$163       .dwtag  DW_TAG_member
    2084                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$19)
    2085                      .dwattr $C$DW$163, DW_AT_name("PPB1ZERO")
    2086                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_PPB1ZERO")
    2087                      .dwattr $C$DW$163, DW_AT_bit_offset(0x0d)
    2088                      .dwattr $C$DW$163, DW_AT_bit_size(0x01)
    2089                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2090                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    2091              
    2092              $C$DW$164       .dwtag  DW_TAG_member
    2093                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v15.12.1 Tue Jul 04 10:45:52 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
resolver.asm                                                         PAGE   42

    2094                      .dwattr $C$DW$164, DW_AT_name("rsvd1")
    2095                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_rsvd1")
    2096                      .dwattr $C$DW$164, DW_AT_bit_offset(0x0c)
    2097                      .dwattr $C$DW$164, DW_AT_bit_size(0x01)
    2098                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2099                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    2100              
    2101              $C$DW$165       .dwtag  DW_TAG_member
    2102                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$19)
    2103                      .dwattr $C$DW$165, DW_AT_name("PPB2TRIPHI")
    2104                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_PPB2TRIPHI")
    2105                      .dwattr $C$DW$165, DW_AT_bit_offset(0x0b)
    2106                      .dwattr $C$DW$165, DW_AT_bit_size(0x01)
    2107                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2108                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    2109              
    2110              $C$DW$166       .dwtag  DW_TAG_member
    2111                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$19)
    2112                      .dwattr $C$DW$166, DW_AT_name("PPB2TRIPLO")
    2113                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_PPB2TRIPLO")
    2114                      .dwattr $C$DW$166, DW_AT_bit_offset(0x0a)
    2115                      .dwattr $C$DW$166, DW_AT_bit_size(0x01)
    2116                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2117                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    2118              
    2119              $C$DW$167       .dwtag  DW_TAG_member
    2120                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$19)
    2121                      .dwattr $C$DW$167, DW_AT_name("PPB2ZERO")
    2122                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_PPB2ZERO")
    2123                      .dwattr $C$DW$167, DW_AT_bit_offset(0x09)
    2124                      .dwattr $C$DW$167, DW_AT_bit_size(0x01)
    2125                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2126                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    2127              
    2128              $C$DW$168       .dwtag  DW_TAG_member
    2129                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$19)
    2130                      .dwattr $C$DW$168, DW_AT_name("rsvd2")
    2131                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_rsvd2")
    2132                      .dwattr $C$DW$168, DW_AT_bit_offset(0x08)
    2133                      .dwattr $C$DW$168, DW_AT_bit_size(0x01)
    2134                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2135                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    2136              
    2137              $C$DW$169       .dwtag  DW_TAG_member
    2138                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$19)
    2139                      .dwattr $C$DW$169, DW_AT_name("PPB3TRIPHI")
    2140                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_PPB3TRIPHI")
    2141                      .dwattr $C$DW$169, DW_AT_bit_offset(0x07)
    2142                      .dwattr $C$DW$169, DW_AT_bit_size(0x01)
    2143                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2144                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    2145              
    2146              $C$DW$170       .dwtag  DW_TAG_member
    2147                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$19)
    2148                      .dwattr $C$DW$170, DW_AT_name("PPB3TRIPLO")
TMS320C2000 Assembler PC v15.12.1 Tue Jul 04 10:45:52 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
resolver.asm                                                         PAGE   43

    2149                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_PPB3TRIPLO")
    2150                      .dwattr $C$DW$170, DW_AT_bit_offset(0x06)
    2151                      .dwattr $C$DW$170, DW_AT_bit_size(0x01)
    2152                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2153                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    2154              
    2155              $C$DW$171       .dwtag  DW_TAG_member
    2156                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$19)
    2157                      .dwattr $C$DW$171, DW_AT_name("PPB3ZERO")
    2158                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_PPB3ZERO")
    2159                      .dwattr $C$DW$171, DW_AT_bit_offset(0x05)
    2160                      .dwattr $C$DW$171, DW_AT_bit_size(0x01)
    2161                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2162                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    2163              
    2164              $C$DW$172       .dwtag  DW_TAG_member
    2165                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$19)
    2166                      .dwattr $C$DW$172, DW_AT_name("rsvd3")
    2167                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_rsvd3")
    2168                      .dwattr $C$DW$172, DW_AT_bit_offset(0x04)
    2169                      .dwattr $C$DW$172, DW_AT_bit_size(0x01)
    2170                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2171                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    2172              
    2173              $C$DW$173       .dwtag  DW_TAG_member
    2174                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$19)
    2175                      .dwattr $C$DW$173, DW_AT_name("PPB4TRIPHI")
    2176                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_PPB4TRIPHI")
    2177                      .dwattr $C$DW$173, DW_AT_bit_offset(0x03)
    2178                      .dwattr $C$DW$173, DW_AT_bit_size(0x01)
    2179                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2180                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    2181              
    2182              $C$DW$174       .dwtag  DW_TAG_member
    2183                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$19)
    2184                      .dwattr $C$DW$174, DW_AT_name("PPB4TRIPLO")
    2185                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_PPB4TRIPLO")
    2186                      .dwattr $C$DW$174, DW_AT_bit_offset(0x02)
    2187                      .dwattr $C$DW$174, DW_AT_bit_size(0x01)
    2188                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2189                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    2190              
    2191              $C$DW$175       .dwtag  DW_TAG_member
    2192                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$19)
    2193                      .dwattr $C$DW$175, DW_AT_name("PPB4ZERO")
    2194                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_PPB4ZERO")
    2195                      .dwattr $C$DW$175, DW_AT_bit_offset(0x01)
    2196                      .dwattr $C$DW$175, DW_AT_bit_size(0x01)
    2197                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2198                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    2199              
    2200              $C$DW$176       .dwtag  DW_TAG_member
    2201                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$19)
    2202                      .dwattr $C$DW$176, DW_AT_name("rsvd4")
    2203                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_rsvd4")
TMS320C2000 Assembler PC v15.12.1 Tue Jul 04 10:45:52 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
resolver.asm                                                         PAGE   44

    2204                      .dwattr $C$DW$176, DW_AT_bit_offset(0x00)
    2205                      .dwattr $C$DW$176, DW_AT_bit_size(0x01)
    2206                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2207                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    2208              
    2209                      .dwendtag $C$DW$T$37
    2210              
    2211              
    2212              $C$DW$T$38      .dwtag  DW_TAG_union_type
    2213                      .dwattr $C$DW$T$38, DW_AT_name("ADCEVTSTAT_REG")
    2214                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x01)
    2215              $C$DW$177       .dwtag  DW_TAG_member
    2216                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$19)
    2217                      .dwattr $C$DW$177, DW_AT_name("all")
    2218                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_all")
    2219                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2220                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    2221              
    2222              $C$DW$178       .dwtag  DW_TAG_member
    2223                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$37)
    2224                      .dwattr $C$DW$178, DW_AT_name("bit")
    2225                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_bit")
    2226                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2227                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    2228              
    2229                      .dwendtag $C$DW$T$38
    2230              
    2231              
    2232              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    2233                      .dwattr $C$DW$T$39, DW_AT_name("ADCINTFLGCLR_BITS")
    2234                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x01)
    2235              $C$DW$179       .dwtag  DW_TAG_member
    2236                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$19)
    2237                      .dwattr $C$DW$179, DW_AT_name("ADCINT1")
    2238                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_ADCINT1")
    2239                      .dwattr $C$DW$179, DW_AT_bit_offset(0x0f)
    2240                      .dwattr $C$DW$179, DW_AT_bit_size(0x01)
    2241                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2242                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    2243              
    2244              $C$DW$180       .dwtag  DW_TAG_member
    2245                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$19)
    2246                      .dwattr $C$DW$180, DW_AT_name("ADCINT2")
    2247                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_ADCINT2")
    2248                      .dwattr $C$DW$180, DW_AT_bit_offset(0x0e)
    2249                      .dwattr $C$DW$180, DW_AT_bit_size(0x01)
    2250                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2251                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    2252              
    2253              $C$DW$181       .dwtag  DW_TAG_member
    2254                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$19)
    2255                      .dwattr $C$DW$181, DW_AT_name("ADCINT3")
    2256                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_ADCINT3")
    2257                      .dwattr $C$DW$181, DW_AT_bit_offset(0x0d)
    2258                      .dwattr $C$DW$181, DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v15.12.1 Tue Jul 04 10:45:52 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
resolver.asm                                                         PAGE   45

    2259                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2260                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    2261              
    2262              $C$DW$182       .dwtag  DW_TAG_member
    2263                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$19)
    2264                      .dwattr $C$DW$182, DW_AT_name("ADCINT4")
    2265                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_ADCINT4")
    2266                      .dwattr $C$DW$182, DW_AT_bit_offset(0x0c)
    2267                      .dwattr $C$DW$182, DW_AT_bit_size(0x01)
    2268                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2269                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    2270              
    2271              $C$DW$183       .dwtag  DW_TAG_member
    2272                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$19)
    2273                      .dwattr $C$DW$183, DW_AT_name("rsvd1")
    2274                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_rsvd1")
    2275                      .dwattr $C$DW$183, DW_AT_bit_offset(0x00)
    2276                      .dwattr $C$DW$183, DW_AT_bit_size(0x0c)
    2277                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2278                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    2279              
    2280                      .dwendtag $C$DW$T$39
    2281              
    2282              
    2283              $C$DW$T$40      .dwtag  DW_TAG_union_type
    2284                      .dwattr $C$DW$T$40, DW_AT_name("ADCINTFLGCLR_REG")
    2285                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x01)
    2286              $C$DW$184       .dwtag  DW_TAG_member
    2287                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$19)
    2288                      .dwattr $C$DW$184, DW_AT_name("all")
    2289                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_all")
    2290                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2291                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    2292              
    2293              $C$DW$185       .dwtag  DW_TAG_member
    2294                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$39)
    2295                      .dwattr $C$DW$185, DW_AT_name("bit")
    2296                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_bit")
    2297                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
