TMS320C2000 Assembler PC v15.12.1 Sun May 28 09:38:36 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
bissc.asm                                                            PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                   PC v15.12.1.LTS *
       3              ;* Date/Time created: Sun May 28 09:38:35 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --cla_support=cla0 --float_support=fpu32 --hll_source=on --mem_model:cod
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../bissc.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v15.12.1.LTS Copyright (c) 1996-201
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Keith\Documents\GitHub\ElectricSkateboard\Software\IDDK_PM
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram
      15                      .dwattr $C$DW$1, DW_AT_name("PM_bissc_setupNewSCDTransfer")

    1009                      .dwpsn  file "../bissc.c",line 357,column 2,is_stmt,isa 0
    1010 00000112 9A22          MOVB      AL,#34                ; [CPU_] |357| 
TMS320C2000 Assembler PC v15.12.1 Sun May 28 09:38:36 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
bissc.asm                                                            PAGE   21

    1011 00000113 9B0C          MOVB      AH,#12                ; [CPU_] |357| 
    1012              $C$DW$66        .dwtag  DW_TAG_TI_branch
    1013                      .dwattr $C$DW$66, DW_AT_low_pc(0x00)
    1014                      .dwattr $C$DW$66, DW_AT_name("_PM_bissc_setupNewSCDTransfer")
    1015                      .dwattr $C$DW$66, DW_AT_TI_call
    1016              
    1017 00000114 7640!         LCR       #_PM_bissc_setupNewSCDTransfer ; [CPU_] |357| 
         00000115 0000 
    1018                      ; call occurs [#_PM_bissc_setupNewSCDTransfer] ; [] |357| 
    1019                      .dwpsn  file "../bissc.c",line 366,column 2,is_stmt,isa 0
    1020              $C$DW$67        .dwtag  DW_TAG_TI_branch
    1021                      .dwattr $C$DW$67, DW_AT_low_pc(0x00)
    1022                      .dwattr $C$DW$67, DW_AT_name("_PM_bissc_startOperation")
    1023                      .dwattr $C$DW$67, DW_AT_TI_call
    1024              
    1025 00000116 7640!         LCR       #_PM_bissc_startOperation ; [CPU_] |366| 
         00000117 0000 
    1026                      ; call occurs [#_PM_bissc_startOperation] ; [] |366| 
    1027 00000118       $C$L5:    
    1028 00000118 761F-         MOVW      DP,#_bissc_data_struct+23 ; [CPU_U] 
         00000119 0000 
    1029                      .dwpsn  file "../bissc.c",line 368,column 9,is_stmt,isa 0
    1030 0000011a 9217-         MOV       AL,@_bissc_data_struct+23 ; [CPU_] |368| 
    1031 0000011b 5201          CMPB      AL,#1                 ; [CPU_] |368| 
    1032 0000011c 60FC          B         $C$L5,NEQ             ; [CPU_] |368| 
    1033                      ; branchcc occurs ; [] |368| 
    1034                      .dwpsn  file "../bissc.c",line 371,column 2,is_stmt,isa 0
    1035 0000011d 9A18          MOVB      AL,#24                ; [CPU_] |371| 
    1036 0000011e 9B06          MOVB      AH,#6                 ; [CPU_] |371| 
    1037              $C$DW$68        .dwtag  DW_TAG_TI_branch
    1038                      .dwattr $C$DW$68, DW_AT_low_pc(0x00)
    1039                      .dwattr $C$DW$68, DW_AT_name("_bissc_receivePosition")
    1040                      .dwattr $C$DW$68, DW_AT_TI_call
    1041              
    1042 0000011f 7640'         LCR       #_bissc_receivePosition ; [CPU_] |371| 
         00000120 004F 
    1043                      ; call occurs [#_bissc_receivePosition] ; [] |371| 
    1044 00000121 5200          CMPB      AL,#0                 ; [CPU_] |371| 
    1045 00000122 6002          B         $C$L6,NEQ             ; [CPU_] |371| 
    1046                      ; branchcc occurs ; [] |371| 
    1047 00000123 7625   ESTOP0
    1048 00000124       $C$L6:    
    1049 00000124 FF69          SPM       #0                    ; [CPU_] 
    1050              $C$DW$69        .dwtag  DW_TAG_TI_branch
    1051                      .dwattr $C$DW$69, DW_AT_low_pc(0x00)
    1052                      .dwattr $C$DW$69, DW_AT_TI_return
    1053              
    1054 00000125 0006          LRETR     ; [CPU_] 
    1055                      ; return occurs ; [] 
    1056                      .dwattr $C$DW$65, DW_AT_TI_end_file("../bissc.c")
    1057                      .dwattr $C$DW$65, DW_AT_TI_end_line(0x177)
    1058                      .dwattr $C$DW$65, DW_AT_TI_end_column(0x01)
    1059                      .dwendentry
    1060                      .dwendtag $C$DW$65
    1061              
TMS320C2000 Assembler PC v15.12.1 Sun May 28 09:38:36 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
bissc.asm                                                            PAGE   22

    1062              ;**************************************************************
    1063              ;* UNDEFINED EXTERNAL REFERENCES                              *
    1064              ;**************************************************************
    1065                      .global _PM_bissc_setupNewSCDTransfer
    1066                      .global _PM_bissc_setupPeriph
    1067                      .global _PM_bissc_startOperation
    1068                      .global _PM_bissc_setFreq
    1069                      .global _PM_bissc_generateCRCTable
    1070                      .global _F28x_usDelay
    1071                      .global _PM_bissc_getCRC
    1072                      .global _PM_bissc_getBits
    1073                      .global _SpibRegs
    1074                      .global _PieCtrlRegs
    1075                      .global _InputXbarRegs
    1076                      .global _GpioDataRegs
    1077                      .global _CpuSysRegs
    1078                      .global _EPwm4Regs
    1079                      .global _GpioCtrlRegs
    1080                      .global _PieVectTable
    1081              
    1082              ;***************************************************************
    1083              ;* TYPE INFORMATION                                            *
    1084              ;***************************************************************
    1085              
    1086              $C$DW$T$25      .dwtag  DW_TAG_structure_type
    1087                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x5c)
    1088              $C$DW$70        .dwtag  DW_TAG_member
    1089                      .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$19)
    1090                      .dwattr $C$DW$70, DW_AT_name("cd_status")
    1091                      .dwattr $C$DW$70, DW_AT_TI_symbol_name("_cd_status")
    1092                      .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1093                      .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
    1094              
    1095              $C$DW$71        .dwtag  DW_TAG_member
    1096                      .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$20)
    1097                      .dwattr $C$DW$71, DW_AT_name("remaining_cd_bits")
    1098                      .dwattr $C$DW$71, DW_AT_TI_symbol_name("_remaining_cd_bits")
    1099                      .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1100                      .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
    1101              
    1102              $C$DW$72        .dwtag  DW_TAG_member
    1103                      .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$19)
    1104                      .dwattr $C$DW$72, DW_AT_name("cd_bits_to_send")
    1105                      .dwattr $C$DW$72, DW_AT_TI_symbol_name("_cd_bits_to_send")
    1106                      .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1107                      .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
    1108              
    1109              $C$DW$73        .dwtag  DW_TAG_member
    1110                      .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$21)
    1111                      .dwattr $C$DW$73, DW_AT_name("cdm")
    1112                      .dwattr $C$DW$73, DW_AT_TI_symbol_name("_cdm")
    1113                      .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1114                      .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
    1115              
    1116              $C$DW$74        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v15.12.1 Sun May 28 09:38:36 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
bissc.asm                                                            PAGE   23

    1117                      .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$21)
    1118                      .dwattr $C$DW$74, DW_AT_name("cds_stream")
    1119                      .dwattr $C$DW$74, DW_AT_TI_symbol_name("_cds_stream")
    1120                      .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1121                      .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
    1122              
    1123              $C$DW$75        .dwtag  DW_TAG_member
    1124                      .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$19)
    1125                      .dwattr $C$DW$75, DW_AT_name("cds_raw")
    1126                      .dwattr $C$DW$75, DW_AT_TI_symbol_name("_cds_raw")
    1127                      .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1128                      .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
    1129              
    1130              $C$DW$76        .dwtag  DW_TAG_member
    1131                      .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$19)
    1132                      .dwattr $C$DW$76, DW_AT_name("cd_register_xfer_address")
    1133                      .dwattr $C$DW$76, DW_AT_TI_symbol_name("_cd_register_xfer_address")
    1134                      .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    1135                      .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
    1136              
    1137              $C$DW$77        .dwtag  DW_TAG_member
    1138                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$19)
    1139                      .dwattr $C$DW$77, DW_AT_name("cd_register_xfer_rxdata")
    1140                      .dwattr $C$DW$77, DW_AT_TI_symbol_name("_cd_register_xfer_rxdata")
    1141                      .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1142                      .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
    1143              
    1144              $C$DW$78        .dwtag  DW_TAG_member
    1145                      .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$19)
    1146                      .dwattr $C$DW$78, DW_AT_name("cd_register_xfer_txdata")
    1147                      .dwattr $C$DW$78, DW_AT_TI_symbol_name("_cd_register_xfer_txdata")
    1148                      .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    1149                      .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
    1150              
    1151              $C$DW$79        .dwtag  DW_TAG_member
    1152                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$19)
    1153                      .dwattr $C$DW$79, DW_AT_name("cd_register_xfer_is_write")
    1154                      .dwattr $C$DW$79, DW_AT_TI_symbol_name("_cd_register_xfer_is_write")
    1155                      .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1156                      .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    1157              
    1158              $C$DW$80        .dwtag  DW_TAG_member
    1159                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$21)
    1160                      .dwattr $C$DW$80, DW_AT_name("scd_raw")
    1161                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_scd_raw")
    1162                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1163                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    1164              
    1165              $C$DW$81        .dwtag  DW_TAG_member
    1166                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$19)
    1167                      .dwattr $C$DW$81, DW_AT_name("scd_crc")
    1168                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_scd_crc")
    1169                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1170                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1171              
TMS320C2000 Assembler PC v15.12.1 Sun May 28 09:38:36 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
bissc.asm                                                            PAGE   24

    1172              $C$DW$82        .dwtag  DW_TAG_member
    1173                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$21)
    1174                      .dwattr $C$DW$82, DW_AT_name("position")
    1175                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_position")
    1176                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1177                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1178              
    1179              $C$DW$83        .dwtag  DW_TAG_member
    1180                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$19)
    1181                      .dwattr $C$DW$83, DW_AT_name("scd_error")
    1182                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_scd_error")
    1183                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1184                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1185              
    1186              $C$DW$84        .dwtag  DW_TAG_member
    1187                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$19)
    1188                      .dwattr $C$DW$84, DW_AT_name("scd_warning")
    1189                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_scd_warning")
    1190                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    1191                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1192              
    1193              $C$DW$85        .dwtag  DW_TAG_member
    1194                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$19)
    1195                      .dwattr $C$DW$85, DW_AT_name("crc_incorrect_count")
    1196                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_crc_incorrect_count")
    1197                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    1198                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1199              
    1200              $C$DW$86        .dwtag  DW_TAG_member
    1201                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$19)
    1202                      .dwattr $C$DW$86, DW_AT_name("dataReady")
    1203                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_dataReady")
    1204                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    1205                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1206              
    1207              $C$DW$87        .dwtag  DW_TAG_member
    1208                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$22)
    1209                      .dwattr $C$DW$87, DW_AT_name("sdata")
    1210                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_sdata")
    1211                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1212                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1213              
    1214              $C$DW$88        .dwtag  DW_TAG_member
    1215                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$22)
    1216                      .dwattr $C$DW$88, DW_AT_name("rdata")
    1217                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_rdata")
    1218                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    1219                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1220              
    1221              $C$DW$89        .dwtag  DW_TAG_member
    1222                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$19)
    1223                      .dwattr $C$DW$89, DW_AT_name("fifo_level")
    1224                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_fifo_level")
    1225                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    1226                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.1 Sun May 28 09:38:36 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
bissc.asm                                                            PAGE   25

    1227              
    1228              $C$DW$90        .dwtag  DW_TAG_member
    1229                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$19)
    1230                      .dwattr $C$DW$90, DW_AT_name("xfer_address_withCTS")
    1231                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_xfer_address_withCTS")
    1232                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x59]
    1233                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1234              
    1235              $C$DW$91        .dwtag  DW_TAG_member
    1236                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$24)
    1237                      .dwattr $C$DW$91, DW_AT_name("spi")
    1238                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_spi")
    1239                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
    1240                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1241              
    1242                      .dwendtag $C$DW$T$25
    1243              
    1244              $C$DW$T$538     .dwtag  DW_TAG_typedef
    1245                      .dwattr $C$DW$T$538, DW_AT_name("BISSC_DATA_STRUCT")
    1246                      .dwattr $C$DW$T$538, DW_AT_type(*$C$DW$T$25)
    1247                      .dwattr $C$DW$T$538, DW_AT_language(DW_LANG_C)
    1248              
    1249              
    1250              $C$DW$T$27      .dwtag  DW_TAG_structure_type
    1251                      .dwattr $C$DW$T$27, DW_AT_name("AQCSFRC_BITS")
    1252                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x01)
    1253              $C$DW$92        .dwtag  DW_TAG_member
    1254                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$26)
    1255                      .dwattr $C$DW$92, DW_AT_name("CSFA")
    1256                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_CSFA")
    1257                      .dwattr $C$DW$92, DW_AT_bit_offset(0x0e)
    1258                      .dwattr $C$DW$92, DW_AT_bit_size(0x02)
    1259                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1260                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1261              
    1262              $C$DW$93        .dwtag  DW_TAG_member
    1263                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$26)
    1264                      .dwattr $C$DW$93, DW_AT_name("CSFB")
    1265                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_CSFB")
    1266                      .dwattr $C$DW$93, DW_AT_bit_offset(0x0c)
    1267                      .dwattr $C$DW$93, DW_AT_bit_size(0x02)
    1268                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1269                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1270              
    1271              $C$DW$94        .dwtag  DW_TAG_member
    1272                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$26)
    1273                      .dwattr $C$DW$94, DW_AT_name("rsvd1")
    1274                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_rsvd1")
    1275                      .dwattr $C$DW$94, DW_AT_bit_offset(0x00)
    1276                      .dwattr $C$DW$94, DW_AT_bit_size(0x0c)
    1277                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1278                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1279              
    1280                      .dwendtag $C$DW$T$27
    1281              
TMS320C2000 Assembler PC v15.12.1 Sun May 28 09:38:36 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
bissc.asm                                                            PAGE   26

    1282              
    1283              $C$DW$T$28      .dwtag  DW_TAG_union_type
    1284                      .dwattr $C$DW$T$28, DW_AT_name("AQCSFRC_REG")
    1285                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x01)
    1286              $C$DW$95        .dwtag  DW_TAG_member
    1287                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$26)
    1288                      .dwattr $C$DW$95, DW_AT_name("all")
    1289                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_all")
    1290                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1291                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1292              
    1293              $C$DW$96        .dwtag  DW_TAG_member
    1294                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$27)
    1295                      .dwattr $C$DW$96, DW_AT_name("bit")
    1296                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_bit")
    1297                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1298                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1299              
    1300                      .dwendtag $C$DW$T$28
    1301              
    1302              
    1303              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    1304                      .dwattr $C$DW$T$29, DW_AT_name("AQCTLA2_BITS")
    1305                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x01)
    1306              $C$DW$97        .dwtag  DW_TAG_member
    1307                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$26)
    1308                      .dwattr $C$DW$97, DW_AT_name("T1U")
    1309                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_T1U")
    1310                      .dwattr $C$DW$97, DW_AT_bit_offset(0x0e)
    1311                      .dwattr $C$DW$97, DW_AT_bit_size(0x02)
    1312                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1313                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1314              
    1315              $C$DW$98        .dwtag  DW_TAG_member
    1316                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$26)
    1317                      .dwattr $C$DW$98, DW_AT_name("T1D")
    1318                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_T1D")
    1319                      .dwattr $C$DW$98, DW_AT_bit_offset(0x0c)
    1320                      .dwattr $C$DW$98, DW_AT_bit_size(0x02)
    1321                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1322                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1323              
    1324              $C$DW$99        .dwtag  DW_TAG_member
    1325                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$26)
    1326                      .dwattr $C$DW$99, DW_AT_name("T2U")
    1327                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_T2U")
    1328                      .dwattr $C$DW$99, DW_AT_bit_offset(0x0a)
    1329                      .dwattr $C$DW$99, DW_AT_bit_size(0x02)
    1330                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1331                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1332              
    1333              $C$DW$100       .dwtag  DW_TAG_member
    1334                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$26)
    1335                      .dwattr $C$DW$100, DW_AT_name("T2D")
    1336                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_T2D")
TMS320C2000 Assembler PC v15.12.1 Sun May 28 09:38:36 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
bissc.asm                                                            PAGE   27

    1337                      .dwattr $C$DW$100, DW_AT_bit_offset(0x08)
    1338                      .dwattr $C$DW$100, DW_AT_bit_size(0x02)
    1339                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1340                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1341              
    1342              $C$DW$101       .dwtag  DW_TAG_member
    1343                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$26)
    1344                      .dwattr $C$DW$101, DW_AT_name("rsvd1")
    1345                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_rsvd1")
    1346                      .dwattr $C$DW$101, DW_AT_bit_offset(0x00)
    1347                      .dwattr $C$DW$101, DW_AT_bit_size(0x08)
    1348                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1349                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1350              
    1351                      .dwendtag $C$DW$T$29
    1352              
    1353              
    1354              $C$DW$T$30      .dwtag  DW_TAG_union_type
    1355                      .dwattr $C$DW$T$30, DW_AT_name("AQCTLA2_REG")
    1356                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x01)
    1357              $C$DW$102       .dwtag  DW_TAG_member
    1358                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$26)
    1359                      .dwattr $C$DW$102, DW_AT_name("all")
    1360                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_all")
    1361                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1362                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1363              
    1364              $C$DW$103       .dwtag  DW_TAG_member
    1365                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$29)
    1366                      .dwattr $C$DW$103, DW_AT_name("bit")
    1367                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_bit")
    1368                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1369                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1370              
    1371                      .dwendtag $C$DW$T$30
    1372              
    1373              
    1374              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    1375                      .dwattr $C$DW$T$31, DW_AT_name("AQCTLA_BITS")
    1376                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x01)
    1377              $C$DW$104       .dwtag  DW_TAG_member
    1378                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$26)
    1379                      .dwattr $C$DW$104, DW_AT_name("ZRO")
    1380                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_ZRO")
    1381                      .dwattr $C$DW$104, DW_AT_bit_offset(0x0e)
    1382                      .dwattr $C$DW$104, DW_AT_bit_size(0x02)
    1383                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1384                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1385              
    1386              $C$DW$105       .dwtag  DW_TAG_member
    1387                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$26)
    1388                      .dwattr $C$DW$105, DW_AT_name("PRD")
    1389                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_PRD")
    1390                      .dwattr $C$DW$105, DW_AT_bit_offset(0x0c)
    1391                      .dwattr $C$DW$105, DW_AT_bit_size(0x02)
TMS320C2000 Assembler PC v15.12.1 Sun May 28 09:38:36 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
bissc.asm                                                            PAGE   28

    1392                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1393                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1394              
    1395              $C$DW$106       .dwtag  DW_TAG_member
    1396                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$26)
    1397                      .dwattr $C$DW$106, DW_AT_name("CAU")
    1398                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_CAU")
    1399                      .dwattr $C$DW$106, DW_AT_bit_offset(0x0a)
    1400                      .dwattr $C$DW$106, DW_AT_bit_size(0x02)
    1401                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1402                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1403              
    1404              $C$DW$107       .dwtag  DW_TAG_member
    1405                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$26)
    1406                      .dwattr $C$DW$107, DW_AT_name("CAD")
    1407                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_CAD")
    1408                      .dwattr $C$DW$107, DW_AT_bit_offset(0x08)
    1409                      .dwattr $C$DW$107, DW_AT_bit_size(0x02)
    1410                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1411                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1412              
    1413              $C$DW$108       .dwtag  DW_TAG_member
    1414                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$26)
    1415                      .dwattr $C$DW$108, DW_AT_name("CBU")
    1416                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_CBU")
    1417                      .dwattr $C$DW$108, DW_AT_bit_offset(0x06)
    1418                      .dwattr $C$DW$108, DW_AT_bit_size(0x02)
    1419                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1420                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1421              
    1422              $C$DW$109       .dwtag  DW_TAG_member
    1423                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$26)
    1424                      .dwattr $C$DW$109, DW_AT_name("CBD")
    1425                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_CBD")
    1426                      .dwattr $C$DW$109, DW_AT_bit_offset(0x04)
    1427                      .dwattr $C$DW$109, DW_AT_bit_size(0x02)
    1428                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1429                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1430              
    1431              $C$DW$110       .dwtag  DW_TAG_member
    1432                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$26)
    1433                      .dwattr $C$DW$110, DW_AT_name("rsvd1")
    1434                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_rsvd1")
    1435                      .dwattr $C$DW$110, DW_AT_bit_offset(0x00)
    1436                      .dwattr $C$DW$110, DW_AT_bit_size(0x04)
    1437                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1438                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1439              
    1440                      .dwendtag $C$DW$T$31
    1441              
    1442              
    1443              $C$DW$T$32      .dwtag  DW_TAG_union_type
    1444                      .dwattr $C$DW$T$32, DW_AT_name("AQCTLA_REG")
    1445                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x01)
    1446              $C$DW$111       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v15.12.1 Sun May 28 09:38:36 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
bissc.asm                                                            PAGE   29

    1447                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$26)
    1448                      .dwattr $C$DW$111, DW_AT_name("all")
    1449                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_all")
    1450                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1451                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1452              
    1453              $C$DW$112       .dwtag  DW_TAG_member
    1454                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$31)
    1455                      .dwattr $C$DW$112, DW_AT_name("bit")
    1456                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_bit")
    1457                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1458                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1459              
    1460                      .dwendtag $C$DW$T$32
    1461              
    1462              
    1463              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    1464                      .dwattr $C$DW$T$33, DW_AT_name("AQCTLB2_BITS")
    1465                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
    1466              $C$DW$113       .dwtag  DW_TAG_member
    1467                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$26)
    1468                      .dwattr $C$DW$113, DW_AT_name("T1U")
    1469                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_T1U")
    1470                      .dwattr $C$DW$113, DW_AT_bit_offset(0x0e)
    1471                      .dwattr $C$DW$113, DW_AT_bit_size(0x02)
    1472                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1473                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1474              
    1475              $C$DW$114       .dwtag  DW_TAG_member
    1476                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$26)
    1477                      .dwattr $C$DW$114, DW_AT_name("T1D")
    1478                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_T1D")
    1479                      .dwattr $C$DW$114, DW_AT_bit_offset(0x0c)
    1480                      .dwattr $C$DW$114, DW_AT_bit_size(0x02)
    1481                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1482                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1483              
    1484              $C$DW$115       .dwtag  DW_TAG_member
    1485                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$26)
    1486                      .dwattr $C$DW$115, DW_AT_name("T2U")
    1487                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_T2U")
    1488                      .dwattr $C$DW$115, DW_AT_bit_offset(0x0a)
    1489                      .dwattr $C$DW$115, DW_AT_bit_size(0x02)
    1490                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1491                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1492              
    1493              $C$DW$116       .dwtag  DW_TAG_member
    1494                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$26)
    1495                      .dwattr $C$DW$116, DW_AT_name("T2D")
    1496                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_T2D")
    1497                      .dwattr $C$DW$116, DW_AT_bit_offset(0x08)
    1498                      .dwattr $C$DW$116, DW_AT_bit_size(0x02)
    1499                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1500                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1501              
TMS320C2000 Assembler PC v15.12.1 Sun May 28 09:38:36 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
bissc.asm                                                            PAGE   30

    1502              $C$DW$117       .dwtag  DW_TAG_member
    1503                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$26)
    1504                      .dwattr $C$DW$117, DW_AT_name("rsvd1")
    1505                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_rsvd1")
    1506                      .dwattr $C$DW$117, DW_AT_bit_offset(0x00)
    1507                      .dwattr $C$DW$117, DW_AT_bit_size(0x08)
    1508                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1509                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1510              
    1511                      .dwendtag $C$DW$T$33
    1512              
    1513              
    1514              $C$DW$T$34      .dwtag  DW_TAG_union_type
    1515                      .dwattr $C$DW$T$34, DW_AT_name("AQCTLB2_REG")
    1516                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
    1517              $C$DW$118       .dwtag  DW_TAG_member
    1518                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$26)
    1519                      .dwattr $C$DW$118, DW_AT_name("all")
    1520                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_all")
    1521                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1522                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1523              
    1524              $C$DW$119       .dwtag  DW_TAG_member
    1525                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$33)
    1526                      .dwattr $C$DW$119, DW_AT_name("bit")
    1527                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_bit")
    1528                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1529                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1530              
    1531                      .dwendtag $C$DW$T$34
    1532              
    1533              
    1534              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    1535                      .dwattr $C$DW$T$35, DW_AT_name("AQCTLB_BITS")
    1536                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x01)
    1537              $C$DW$120       .dwtag  DW_TAG_member
    1538                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$26)
    1539                      .dwattr $C$DW$120, DW_AT_name("ZRO")
    1540                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_ZRO")
    1541                      .dwattr $C$DW$120, DW_AT_bit_offset(0x0e)
    1542                      .dwattr $C$DW$120, DW_AT_bit_size(0x02)
    1543                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1544                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1545              
    1546              $C$DW$121       .dwtag  DW_TAG_member
    1547                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$26)
    1548                      .dwattr $C$DW$121, DW_AT_name("PRD")
    1549                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_PRD")
    1550                      .dwattr $C$DW$121, DW_AT_bit_offset(0x0c)
    1551                      .dwattr $C$DW$121, DW_AT_bit_size(0x02)
    1552                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1553                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1554              
    1555              $C$DW$122       .dwtag  DW_TAG_member
    1556                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$26)
TMS320C2000 Assembler PC v15.12.1 Sun May 28 09:38:36 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
bissc.asm                                                            PAGE   31

    1557                      .dwattr $C$DW$122, DW_AT_name("CAU")
    1558                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_CAU")
    1559                      .dwattr $C$DW$122, DW_AT_bit_offset(0x0a)
    1560                      .dwattr $C$DW$122, DW_AT_bit_size(0x02)
    1561                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1562                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1563              
    1564              $C$DW$123       .dwtag  DW_TAG_member
    1565                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$26)
    1566                      .dwattr $C$DW$123, DW_AT_name("CAD")
    1567                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_CAD")
    1568                      .dwattr $C$DW$123, DW_AT_bit_offset(0x08)
    1569                      .dwattr $C$DW$123, DW_AT_bit_size(0x02)
    1570                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1571                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1572              
    1573              $C$DW$124       .dwtag  DW_TAG_member
    1574                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$26)
    1575                      .dwattr $C$DW$124, DW_AT_name("CBU")
    1576                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_CBU")
    1577                      .dwattr $C$DW$124, DW_AT_bit_offset(0x06)
    1578                      .dwattr $C$DW$124, DW_AT_bit_size(0x02)
    1579                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1580                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1581              
    1582              $C$DW$125       .dwtag  DW_TAG_member
    1583                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$26)
    1584                      .dwattr $C$DW$125, DW_AT_name("CBD")
    1585                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_CBD")
    1586                      .dwattr $C$DW$125, DW_AT_bit_offset(0x04)
    1587                      .dwattr $C$DW$125, DW_AT_bit_size(0x02)
    1588                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1589                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1590              
    1591              $C$DW$126       .dwtag  DW_TAG_member
    1592                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$26)
    1593                      .dwattr $C$DW$126, DW_AT_name("rsvd1")
    1594                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_rsvd1")
    1595                      .dwattr $C$DW$126, DW_AT_bit_offset(0x00)
    1596                      .dwattr $C$DW$126, DW_AT_bit_size(0x04)
    1597                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1598                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1599              
    1600                      .dwendtag $C$DW$T$35
    1601              
    1602              
    1603              $C$DW$T$36      .dwtag  DW_TAG_union_type
    1604                      .dwattr $C$DW$T$36, DW_AT_name("AQCTLB_REG")
    1605                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x01)
    1606              $C$DW$127       .dwtag  DW_TAG_member
    1607                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$26)
    1608                      .dwattr $C$DW$127, DW_AT_name("all")
    1609                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_all")
    1610                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1611                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.1 Sun May 28 09:38:36 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
bissc.asm                                                            PAGE   32

    1612              
    1613              $C$DW$128       .dwtag  DW_TAG_member
    1614                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$35)
    1615                      .dwattr $C$DW$128, DW_AT_name("bit")
    1616                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_bit")
    1617                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1618                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1619              
    1620                      .dwendtag $C$DW$T$36
    1621              
    1622              
    1623              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    1624                      .dwattr $C$DW$T$37, DW_AT_name("AQCTL_BITS")
    1625                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x01)
    1626              $C$DW$129       .dwtag  DW_TAG_member
    1627                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$26)
    1628                      .dwattr $C$DW$129, DW_AT_name("LDAQAMODE")
    1629                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_LDAQAMODE")
    1630                      .dwattr $C$DW$129, DW_AT_bit_offset(0x0e)
    1631                      .dwattr $C$DW$129, DW_AT_bit_size(0x02)
    1632                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1633                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1634              
    1635              $C$DW$130       .dwtag  DW_TAG_member
    1636                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$26)
    1637                      .dwattr $C$DW$130, DW_AT_name("LDAQBMODE")
    1638                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_LDAQBMODE")
    1639                      .dwattr $C$DW$130, DW_AT_bit_offset(0x0c)
    1640                      .dwattr $C$DW$130, DW_AT_bit_size(0x02)
    1641                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1642                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1643              
    1644              $C$DW$131       .dwtag  DW_TAG_member
    1645                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$26)
    1646                      .dwattr $C$DW$131, DW_AT_name("SHDWAQAMODE")
    1647                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_SHDWAQAMODE")
    1648                      .dwattr $C$DW$131, DW_AT_bit_offset(0x0b)
    1649                      .dwattr $C$DW$131, DW_AT_bit_size(0x01)
    1650                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1651                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1652              
    1653              $C$DW$132       .dwtag  DW_TAG_member
    1654                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$26)
    1655                      .dwattr $C$DW$132, DW_AT_name("rsvd1")
    1656                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_rsvd1")
    1657                      .dwattr $C$DW$132, DW_AT_bit_offset(0x0a)
    1658                      .dwattr $C$DW$132, DW_AT_bit_size(0x01)
    1659                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1660                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1661              
    1662              $C$DW$133       .dwtag  DW_TAG_member
    1663                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$26)
    1664                      .dwattr $C$DW$133, DW_AT_name("SHDWAQBMODE")
    1665                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_SHDWAQBMODE")
    1666                      .dwattr $C$DW$133, DW_AT_bit_offset(0x09)
TMS320C2000 Assembler PC v15.12.1 Sun May 28 09:38:36 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
bissc.asm                                                            PAGE   33

    1667                      .dwattr $C$DW$133, DW_AT_bit_size(0x01)
    1668                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1669                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1670              
    1671              $C$DW$134       .dwtag  DW_TAG_member
    1672                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$26)
    1673                      .dwattr $C$DW$134, DW_AT_name("rsvd2")
    1674                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_rsvd2")
    1675                      .dwattr $C$DW$134, DW_AT_bit_offset(0x08)
    1676                      .dwattr $C$DW$134, DW_AT_bit_size(0x01)
    1677                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1678                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1679              
    1680              $C$DW$135       .dwtag  DW_TAG_member
    1681                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$26)
    1682                      .dwattr $C$DW$135, DW_AT_name("LDAQASYNC")
    1683                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_LDAQASYNC")
    1684                      .dwattr $C$DW$135, DW_AT_bit_offset(0x06)
    1685                      .dwattr $C$DW$135, DW_AT_bit_size(0x02)
    1686                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1687                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1688              
    1689              $C$DW$136       .dwtag  DW_TAG_member
    1690                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$26)
    1691                      .dwattr $C$DW$136, DW_AT_name("LDAQBSYNC")
    1692                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_LDAQBSYNC")
    1693                      .dwattr $C$DW$136, DW_AT_bit_offset(0x04)
    1694                      .dwattr $C$DW$136, DW_AT_bit_size(0x02)
    1695                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1696                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1697              
    1698              $C$DW$137       .dwtag  DW_TAG_member
    1699                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$26)
    1700                      .dwattr $C$DW$137, DW_AT_name("rsvd3")
    1701                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_rsvd3")
    1702                      .dwattr $C$DW$137, DW_AT_bit_offset(0x00)
    1703                      .dwattr $C$DW$137, DW_AT_bit_size(0x04)
    1704                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1705                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1706              
    1707                      .dwendtag $C$DW$T$37
    1708              
    1709              
    1710              $C$DW$T$38      .dwtag  DW_TAG_union_type
    1711                      .dwattr $C$DW$T$38, DW_AT_name("AQCTL_REG")
    1712                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x01)
    1713              $C$DW$138       .dwtag  DW_TAG_member
    1714                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$26)
    1715                      .dwattr $C$DW$138, DW_AT_name("all")
    1716                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_all")
    1717                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1718                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1719              
    1720              $C$DW$139       .dwtag  DW_TAG_member
    1721                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$37)
TMS320C2000 Assembler PC v15.12.1 Sun May 28 09:38:36 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
bissc.asm                                                            PAGE   34

    1722                      .dwattr $C$DW$139, DW_AT_name("bit")
    1723                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_bit")
    1724                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1725                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1726              
    1727                      .dwendtag $C$DW$T$38
    1728              
    1729              
    1730              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    1731                      .dwattr $C$DW$T$39, DW_AT_name("AQSFRC_BITS")
    1732                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x01)
    1733              $C$DW$140       .dwtag  DW_TAG_member
    1734                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$26)
    1735                      .dwattr $C$DW$140, DW_AT_name("ACTSFA")
    1736                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_ACTSFA")
    1737                      .dwattr $C$DW$140, DW_AT_bit_offset(0x0e)
    1738                      .dwattr $C$DW$140, DW_AT_bit_size(0x02)
    1739                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1740                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1741              
    1742              $C$DW$141       .dwtag  DW_TAG_member
    1743                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$26)
    1744                      .dwattr $C$DW$141, DW_AT_name("OTSFA")
    1745                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_OTSFA")
    1746                      .dwattr $C$DW$141, DW_AT_bit_offset(0x0d)
    1747                      .dwattr $C$DW$141, DW_AT_bit_size(0x01)
    1748                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1749                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1750              
    1751              $C$DW$142       .dwtag  DW_TAG_member
    1752                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$26)
    1753                      .dwattr $C$DW$142, DW_AT_name("ACTSFB")
    1754                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_ACTSFB")
    1755                      .dwattr $C$DW$142, DW_AT_bit_offset(0x0b)
    1756                      .dwattr $C$DW$142, DW_AT_bit_size(0x02)
    1757                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1758                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1759              
    1760              $C$DW$143       .dwtag  DW_TAG_member
    1761                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$26)
    1762                      .dwattr $C$DW$143, DW_AT_name("OTSFB")
    1763                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_OTSFB")
    1764                      .dwattr $C$DW$143, DW_AT_bit_offset(0x0a)
    1765                      .dwattr $C$DW$143, DW_AT_bit_size(0x01)
    1766                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1767                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1768              
    1769              $C$DW$144       .dwtag  DW_TAG_member
    1770                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$26)
    1771                      .dwattr $C$DW$144, DW_AT_name("RLDCSF")
    1772                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_RLDCSF")
    1773                      .dwattr $C$DW$144, DW_AT_bit_offset(0x08)
    1774                      .dwattr $C$DW$144, DW_AT_bit_size(0x02)
    1775                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1776                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.1 Sun May 28 09:38:36 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
bissc.asm                                                            PAGE   35

    1777              
    1778              $C$DW$145       .dwtag  DW_TAG_member
    1779                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$26)
    1780                      .dwattr $C$DW$145, DW_AT_name("rsvd1")
    1781                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_rsvd1")
    1782                      .dwattr $C$DW$145, DW_AT_bit_offset(0x00)
    1783                      .dwattr $C$DW$145, DW_AT_bit_size(0x08)
    1784                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1785                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1786              
    1787                      .dwendtag $C$DW$T$39
    1788              
    1789              
    1790              $C$DW$T$40      .dwtag  DW_TAG_union_type
    1791                      .dwattr $C$DW$T$40, DW_AT_name("AQSFRC_REG")
    1792                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x01)
    1793              $C$DW$146       .dwtag  DW_TAG_member
    1794                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$26)
    1795                      .dwattr $C$DW$146, DW_AT_name("all")
    1796                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_all")
    1797                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1798                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    1799              
    1800              $C$DW$147       .dwtag  DW_TAG_member
    1801                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$39)
    1802                      .dwattr $C$DW$147, DW_AT_name("bit")
    1803                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_bit")
    1804                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1805                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    1806              
    1807                      .dwendtag $C$DW$T$40
    1808              
    1809              
    1810              $C$DW$T$41      .dwtag  DW_TAG_structure_type
    1811                      .dwattr $C$DW$T$41, DW_AT_name("AQTSRCSEL_BITS")
    1812                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x01)
    1813              $C$DW$148       .dwtag  DW_TAG_member
    1814                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$26)
    1815                      .dwattr $C$DW$148, DW_AT_name("T1SEL")
    1816                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_T1SEL")
    1817                      .dwattr $C$DW$148, DW_AT_bit_offset(0x0c)
    1818                      .dwattr $C$DW$148, DW_AT_bit_size(0x04)
    1819                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1820                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1821              
    1822              $C$DW$149       .dwtag  DW_TAG_member
    1823                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$26)
    1824                      .dwattr $C$DW$149, DW_AT_name("T2SEL")
    1825                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_T2SEL")
    1826                      .dwattr $C$DW$149, DW_AT_bit_offset(0x08)
    1827                      .dwattr $C$DW$149, DW_AT_bit_size(0x04)
    1828                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1829                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1830              
    1831              $C$DW$150       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v15.12.1 Sun May 28 09:38:36 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
bissc.asm                                                            PAGE   36

    1832                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$26)
    1833                      .dwattr $C$DW$150, DW_AT_name("rsvd1")
    1834                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_rsvd1")
    1835                      .dwattr $C$DW$150, DW_AT_bit_offset(0x00)
    1836                      .dwattr $C$DW$150, DW_AT_bit_size(0x08)
    1837                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1838                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    1839              
    1840                      .dwendtag $C$DW$T$41
    1841              
    1842              
    1843              $C$DW$T$42      .dwtag  DW_TAG_union_type
    1844                      .dwattr $C$DW$T$42, DW_AT_name("AQTSRCSEL_REG")
    1845                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x01)
    1846              $C$DW$151       .dwtag  DW_TAG_member
    1847                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$26)
    1848                      .dwattr $C$DW$151, DW_AT_name("all")
    1849                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_all")
    1850                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1851                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    1852              
    1853              $C$DW$152       .dwtag  DW_TAG_member
    1854                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$41)
    1855                      .dwattr $C$DW$152, DW_AT_name("bit")
    1856                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_bit")
    1857                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1858                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    1859              
    1860                      .dwendtag $C$DW$T$42
    1861              
    1862              
    1863              $C$DW$T$43      .dwtag  DW_TAG_structure_type
    1864                      .dwattr $C$DW$T$43, DW_AT_name("CMPA_BITS")
    1865                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x02)
    1866              $C$DW$153       .dwtag  DW_TAG_member
    1867                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$26)
    1868                      .dwattr $C$DW$153, DW_AT_name("CMPAHR")
    1869                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_CMPAHR")
    1870                      .dwattr $C$DW$153, DW_AT_bit_offset(0x00)
    1871                      .dwattr $C$DW$153, DW_AT_bit_size(0x10)
    1872                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1873                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    1874              
    1875              $C$DW$154       .dwtag  DW_TAG_member
    1876                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$26)
    1877                      .dwattr $C$DW$154, DW_AT_name("CMPA")
    1878                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_CMPA")
    1879                      .dwattr $C$DW$154, DW_AT_bit_offset(0x00)
    1880                      .dwattr $C$DW$154, DW_AT_bit_size(0x10)
    1881                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1882                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    1883              
    1884                      .dwendtag $C$DW$T$43
    1885              
    1886              
TMS320C2000 Assembler PC v15.12.1 Sun May 28 09:38:36 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
bissc.asm                                                            PAGE   37

    1887              $C$DW$T$45      .dwtag  DW_TAG_union_type
    1888                      .dwattr $C$DW$T$45, DW_AT_name("CMPA_REG")
    1889                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x02)
    1890              $C$DW$155       .dwtag  DW_TAG_member
    1891                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$44)
    1892                      .dwattr $C$DW$155, DW_AT_name("all")
    1893                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_all")
    1894                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1895                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    1896              
    1897              $C$DW$156       .dwtag  DW_TAG_member
    1898                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$43)
    1899                      .dwattr $C$DW$156, DW_AT_name("bit")
    1900                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_bit")
    1901                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1902                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    1903              
    1904                      .dwendtag $C$DW$T$45
    1905              
    1906              
    1907              $C$DW$T$46      .dwtag  DW_TAG_structure_type
    1908                      .dwattr $C$DW$T$46, DW_AT_name("CMPB_BITS")
    1909                      .dwattr $C$DW$T$46, DW_AT_byte_size(0x02)
    1910              $C$DW$157       .dwtag  DW_TAG_member
    1911                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$26)
    1912                      .dwattr $C$DW$157, DW_AT_name("CMPBHR")
    1913                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_CMPBHR")
    1914                      .dwattr $C$DW$157, DW_AT_bit_offset(0x00)
    1915                      .dwattr $C$DW$157, DW_AT_bit_size(0x10)
    1916                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1917                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    1918              
    1919              $C$DW$158       .dwtag  DW_TAG_member
    1920                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$26)
    1921                      .dwattr $C$DW$158, DW_AT_name("CMPB")
    1922                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_CMPB")
    1923                      .dwattr $C$DW$158, DW_AT_bit_offset(0x00)
    1924                      .dwattr $C$DW$158, DW_AT_bit_size(0x10)
    1925                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1926                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    1927              
    1928                      .dwendtag $C$DW$T$46
    1929              
    1930              
    1931              $C$DW$T$47      .dwtag  DW_TAG_union_type
    1932                      .dwattr $C$DW$T$47, DW_AT_name("CMPB_REG")
    1933                      .dwattr $C$DW$T$47, DW_AT_byte_size(0x02)
    1934              $C$DW$159       .dwtag  DW_TAG_member
    1935                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$44)
    1936                      .dwattr $C$DW$159, DW_AT_name("all")
    1937                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_all")
    1938                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1939                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    1940              
    1941              $C$DW$160       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v15.12.1 Sun May 28 09:38:36 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
bissc.asm                                                            PAGE   38

    1942                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$46)
    1943                      .dwattr $C$DW$160, DW_AT_name("bit")
    1944                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_bit")
    1945                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1946                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    1947              
    1948                      .dwendtag $C$DW$T$47
    1949              
    1950              
    1951              $C$DW$T$48      .dwtag  DW_TAG_structure_type
    1952                      .dwattr $C$DW$T$48, DW_AT_name("CMPCTL2_BITS")
    1953                      .dwattr $C$DW$T$48, DW_AT_byte_size(0x01)
    1954              $C$DW$161       .dwtag  DW_TAG_member
    1955                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$26)
    1956                      .dwattr $C$DW$161, DW_AT_name("LOADCMODE")
    1957                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_LOADCMODE")
    1958                      .dwattr $C$DW$161, DW_AT_bit_offset(0x0e)
    1959                      .dwattr $C$DW$161, DW_AT_bit_size(0x02)
    1960                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1961                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    1962              
    1963              $C$DW$162       .dwtag  DW_TAG_member
    1964                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$26)
    1965                      .dwattr $C$DW$162, DW_AT_name("LOADDMODE")
    1966                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_LOADDMODE")
    1967                      .dwattr $C$DW$162, DW_AT_bit_offset(0x0c)
    1968                      .dwattr $C$DW$162, DW_AT_bit_size(0x02)
    1969                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1970                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    1971              
    1972              $C$DW$163       .dwtag  DW_TAG_member
    1973                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$26)
    1974                      .dwattr $C$DW$163, DW_AT_name("SHDWCMODE")
    1975                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_SHDWCMODE")
    1976                      .dwattr $C$DW$163, DW_AT_bit_offset(0x0b)
    1977                      .dwattr $C$DW$163, DW_AT_bit_size(0x01)
    1978                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1979                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    1980              
    1981              $C$DW$164       .dwtag  DW_TAG_member
    1982                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$26)
    1983                      .dwattr $C$DW$164, DW_AT_name("rsvd1")
    1984                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_rsvd1")
    1985                      .dwattr $C$DW$164, DW_AT_bit_offset(0x0a)
    1986                      .dwattr $C$DW$164, DW_AT_bit_size(0x01)
    1987                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1988                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    1989              
    1990              $C$DW$165       .dwtag  DW_TAG_member
    1991                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$26)
    1992                      .dwattr $C$DW$165, DW_AT_name("SHDWDMODE")
    1993                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_SHDWDMODE")
    1994                      .dwattr $C$DW$165, DW_AT_bit_offset(0x09)
    1995                      .dwattr $C$DW$165, DW_AT_bit_size(0x01)
    1996                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v15.12.1 Sun May 28 09:38:36 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
bissc.asm                                                            PAGE   39

    1997                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    1998              
    1999              $C$DW$166       .dwtag  DW_TAG_member
    2000                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$26)
    2001                      .dwattr $C$DW$166, DW_AT_name("rsvd2")
    2002                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_rsvd2")
    2003                      .dwattr $C$DW$166, DW_AT_bit_offset(0x06)
    2004                      .dwattr $C$DW$166, DW_AT_bit_size(0x03)
    2005                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2006                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    2007              
    2008              $C$DW$167       .dwtag  DW_TAG_member
    2009                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$26)
    2010                      .dwattr $C$DW$167, DW_AT_name("LOADCSYNC")
    2011                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_LOADCSYNC")
    2012                      .dwattr $C$DW$167, DW_AT_bit_offset(0x04)
    2013                      .dwattr $C$DW$167, DW_AT_bit_size(0x02)
    2014                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2015                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    2016              
    2017              $C$DW$168       .dwtag  DW_TAG_member
    2018                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$26)
    2019                      .dwattr $C$DW$168, DW_AT_name("LOADDSYNC")
    2020                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_LOADDSYNC")
    2021                      .dwattr $C$DW$168, DW_AT_bit_offset(0x02)
    2022                      .dwattr $C$DW$168, DW_AT_bit_size(0x02)
    2023                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2024                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    2025              
    2026              $C$DW$169       .dwtag  DW_TAG_member
    2027                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$26)
    2028                      .dwattr $C$DW$169, DW_AT_name("rsvd3")
    2029                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_rsvd3")
    2030                      .dwattr $C$DW$169, DW_AT_bit_offset(0x00)
    2031                      .dwattr $C$DW$169, DW_AT_bit_size(0x02)
    2032                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2033                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    2034              
    2035                      .dwendtag $C$DW$T$48
    2036              
    2037              
    2038              $C$DW$T$49      .dwtag  DW_TAG_union_type
    2039                      .dwattr $C$DW$T$49, DW_AT_name("CMPCTL2_REG")
    2040                      .dwattr $C$DW$T$49, DW_AT_byte_size(0x01)
    2041              $C$DW$170       .dwtag  DW_TAG_member
    2042                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$26)
    2043                      .dwattr $C$DW$170, DW_AT_name("all")
    2044                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_all")
    2045                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2046                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    2047              
    2048              $C$DW$171       .dwtag  DW_TAG_member
    2049                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$48)
    2050                      .dwattr $C$DW$171, DW_AT_name("bit")
    2051                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_bit")
TMS320C2000 Assembler PC v15.12.1 Sun May 28 09:38:36 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
bissc.asm                                                            PAGE   40

    2052                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2053                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    2054              
    2055                      .dwendtag $C$DW$T$49
    2056              
    2057              
    2058              $C$DW$T$50      .dwtag  DW_TAG_structure_type
    2059                      .dwattr $C$DW$T$50, DW_AT_name("CMPCTL_BITS")
    2060                      .dwattr $C$DW$T$50, DW_AT_byte_size(0x01)
    2061              $C$DW$172       .dwtag  DW_TAG_member
    2062                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$26)
    2063                      .dwattr $C$DW$172, DW_AT_name("LOADAMODE")
    2064                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_LOADAMODE")
    2065                      .dwattr $C$DW$172, DW_AT_bit_offset(0x0e)
    2066                      .dwattr $C$DW$172, DW_AT_bit_size(0x02)
    2067                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2068                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    2069              
    2070              $C$DW$173       .dwtag  DW_TAG_member
    2071                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$26)
    2072                      .dwattr $C$DW$173, DW_AT_name("LOADBMODE")
    2073                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_LOADBMODE")
    2074                      .dwattr $C$DW$173, DW_AT_bit_offset(0x0c)
    2075                      .dwattr $C$DW$173, DW_AT_bit_size(0x02)
    2076                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2077                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    2078              
    2079              $C$DW$174       .dwtag  DW_TAG_member
    2080                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$26)
    2081                      .dwattr $C$DW$174, DW_AT_name("SHDWAMODE")
    2082                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_SHDWAMODE")
    2083                      .dwattr $C$DW$174, DW_AT_bit_offset(0x0b)
    2084                      .dwattr $C$DW$174, DW_AT_bit_size(0x01)
    2085                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2086                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    2087              
    2088              $C$DW$175       .dwtag  DW_TAG_member
    2089                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$26)
    2090                      .dwattr $C$DW$175, DW_AT_name("rsvd1")
    2091                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_rsvd1")
    2092                      .dwattr $C$DW$175, DW_AT_bit_offset(0x0a)
    2093                      .dwattr $C$DW$175, DW_AT_bit_size(0x01)
    2094                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2095                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    2096              
    2097              $C$DW$176       .dwtag  DW_TAG_member
    2098                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$26)
    2099                      .dwattr $C$DW$176, DW_AT_name("SHDWBMODE")
    2100                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_SHDWBMODE")
    2101                      .dwattr $C$DW$176, DW_AT_bit_offset(0x09)
    2102                      .dwattr $C$DW$176, DW_AT_bit_size(0x01)
    2103                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2104                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    2105              
    2106              $C$DW$177       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v15.12.1 Sun May 28 09:38:36 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
bissc.asm                                                            PAGE   41

    2107                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$26)
    2108                      .dwattr $C$DW$177, DW_AT_name("rsvd2")
    2109                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_rsvd2")
    2110                      .dwattr $C$DW$177, DW_AT_bit_offset(0x08)
    2111                      .dwattr $C$DW$177, DW_AT_bit_size(0x01)
    2112                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2113                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    2114              
    2115              $C$DW$178       .dwtag  DW_TAG_member
    2116                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$26)
    2117                      .dwattr $C$DW$178, DW_AT_name("SHDWAFULL")
    2118                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_SHDWAFULL")
    2119                      .dwattr $C$DW$178, DW_AT_bit_offset(0x07)
    2120                      .dwattr $C$DW$178, DW_AT_bit_size(0x01)
    2121                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2122                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    2123              
    2124              $C$DW$179       .dwtag  DW_TAG_member
    2125                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$26)
    2126                      .dwattr $C$DW$179, DW_AT_name("SHDWBFULL")
    2127                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_SHDWBFULL")
    2128                      .dwattr $C$DW$179, DW_AT_bit_offset(0x06)
    2129                      .dwattr $C$DW$179, DW_AT_bit_size(0x01)
    2130                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2131                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    2132              
    2133              $C$DW$180       .dwtag  DW_TAG_member
    2134                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$26)
    2135                      .dwattr $C$DW$180, DW_AT_name("LOADASYNC")
    2136                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_LOADASYNC")
    2137                      .dwattr $C$DW$180, DW_AT_bit_offset(0x04)
    2138                      .dwattr $C$DW$180, DW_AT_bit_size(0x02)
    2139                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2140                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    2141              
    2142              $C$DW$181       .dwtag  DW_TAG_member
    2143                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$26)
    2144                      .dwattr $C$DW$181, DW_AT_name("LOADBSYNC")
    2145                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_LOADBSYNC")
    2146                      .dwattr $C$DW$181, DW_AT_bit_offset(0x02)
    2147                      .dwattr $C$DW$181, DW_AT_bit_size(0x02)
    2148                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2149                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    2150              
    2151              $C$DW$182       .dwtag  DW_TAG_member
    2152                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$26)
    2153                      .dwattr $C$DW$182, DW_AT_name("rsvd3")
    2154                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_rsvd3")
    2155                      .dwattr $C$DW$182, DW_AT_bit_offset(0x00)
    2156                      .dwattr $C$DW$182, DW_AT_bit_size(0x02)
    2157                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2158                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    2159              
    2160                      .dwendtag $C$DW$T$50
    2161              
TMS320C2000 Assembler PC v15.12.1 Sun May 28 09:38:36 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
bissc.asm                                                            PAGE   42

    2162              
    2163              $C$DW$T$51      .dwtag  DW_TAG_union_type
    2164                      .dwattr $C$DW$T$51, DW_AT_name("CMPCTL_REG")
    2165                      .dwattr $C$DW$T$51, DW_AT_byte_size(0x01)
    2166              $C$DW$183       .dwtag  DW_TAG_member
    2167                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$26)
    2168                      .dwattr $C$DW$183, DW_AT_name("all")
    2169                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_all")
    2170                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2171                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    2172              
    2173              $C$DW$184       .dwtag  DW_TAG_member
    2174                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$50)
    2175                      .dwattr $C$DW$184, DW_AT_name("bit")
    2176                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_bit")
    2177                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2178                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    2179              
    2180                      .dwendtag $C$DW$T$51
    2181              
    2182              
    2183              $C$DW$T$52      .dwtag  DW_TAG_structure_type
    2184                      .dwattr $C$DW$T$52, DW_AT_name("CPUSYSLOCK1_BITS")
    2185                      .dwattr $C$DW$T$52, DW_AT_byte_size(0x02)
    2186              $C$DW$185       .dwtag  DW_TAG_member
    2187                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$26)
    2188                      .dwattr $C$DW$185, DW_AT_name("HIBBOOTMODE")
    2189                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_HIBBOOTMODE")
    2190                      .dwattr $C$DW$185, DW_AT_bit_offset(0x0f)
    2191                      .dwattr $C$DW$185, DW_AT_bit_size(0x01)
    2192                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2193                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    2194              
    2195              $C$DW$186       .dwtag  DW_TAG_member
    2196                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$26)
    2197                      .dwattr $C$DW$186, DW_AT_name("IORESTOREADDR")
    2198                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_IORESTOREADDR")
    2199                      .dwattr $C$DW$186, DW_AT_bit_offset(0x0e)
    2200                      .dwattr $C$DW$186, DW_AT_bit_size(0x01)
    2201                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2202                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    2203              
    2204              $C$DW$187       .dwtag  DW_TAG_member
    2205                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$26)
    2206                      .dwattr $C$DW$187, DW_AT_name("PIEVERRADDR")
    2207                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_PIEVERRADDR")
    2208                      .dwattr $C$DW$187, DW_AT_bit_offset(0x0d)
    2209                      .dwattr $C$DW$187, DW_AT_bit_size(0x01)
    2210                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2211                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    2212              
    2213              $C$DW$188       .dwtag  DW_TAG_member
    2214                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$26)
    2215                      .dwattr $C$DW$188, DW_AT_name("PCLKCR0")
    2216                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_PCLKCR0")
TMS320C2000 Assembler PC v15.12.1 Sun May 28 09:38:36 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
bissc.asm                                                            PAGE   43

    2217                      .dwattr $C$DW$188, DW_AT_bit_offset(0x0c)
    2218                      .dwattr $C$DW$188, DW_AT_bit_size(0x01)
    2219                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2220                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    2221              
    2222              $C$DW$189       .dwtag  DW_TAG_member
    2223                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$26)
    2224                      .dwattr $C$DW$189, DW_AT_name("PCLKCR1")
    2225                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_PCLKCR1")
    2226                      .dwattr $C$DW$189, DW_AT_bit_offset(0x0b)
    2227                      .dwattr $C$DW$189, DW_AT_bit_size(0x01)
    2228                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2229                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    2230              
    2231              $C$DW$190       .dwtag  DW_TAG_member
    2232                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$26)
    2233                      .dwattr $C$DW$190, DW_AT_name("PCLKCR2")
    2234                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_PCLKCR2")
    2235                      .dwattr $C$DW$190, DW_AT_bit_offset(0x0a)
    2236                      .dwattr $C$DW$190, DW_AT_bit_size(0x01)
    2237                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2238                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    2239              
    2240              $C$DW$191       .dwtag  DW_TAG_member
    2241                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$26)
    2242                      .dwattr $C$DW$191, DW_AT_name("PCLKCR3")
    2243                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_PCLKCR3")
    2244                      .dwattr $C$DW$191, DW_AT_bit_offset(0x09)
    2245                      .dwattr $C$DW$191, DW_AT_bit_size(0x01)
    2246                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2247                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    2248              
    2249              $C$DW$192       .dwtag  DW_TAG_member
    2250                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$26)
    2251                      .dwattr $C$DW$192, DW_AT_name("PCLKCR4")
    2252                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_PCLKCR4")
    2253                      .dwattr $C$DW$192, DW_AT_bit_offset(0x08)
    2254                      .dwattr $C$DW$192, DW_AT_bit_size(0x01)
    2255                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2256                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    2257              
    2258              $C$DW$193       .dwtag  DW_TAG_member
    2259                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$26)
    2260                      .dwattr $C$DW$193, DW_AT_name("PCLKCR5")
    2261                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_PCLKCR5")
    2262                      .dwattr $C$DW$193, DW_AT_bit_offset(0x07)
    2263                      .dwattr $C$DW$193, DW_AT_bit_size(0x01)
    2264                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2265                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    2266              
    2267              $C$DW$194       .dwtag  DW_TAG_member
    2268                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$26)
    2269                      .dwattr $C$DW$194, DW_AT_name("PCLKCR6")
    2270                      .dwattr $C$DW$194, DW_AT_TI_symbol_name("_PCLKCR6")
    2271                      .dwattr $C$DW$194, DW_AT_bit_offset(0x06)
TMS320C2000 Assembler PC v15.12.1 Sun May 28 09:38:36 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
bissc.asm                                                            PAGE   44

    2272                      .dwattr $C$DW$194, DW_AT_bit_size(0x01)
    2273                      .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2274                      .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    2275              
    2276              $C$DW$195       .dwtag  DW_TAG_member
    2277                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$26)
    2278                      .dwattr $C$DW$195, DW_AT_name("PCLKCR7")
    2279                      .dwattr $C$DW$195, DW_AT_TI_symbol_name("_PCLKCR7")
    2280                      .dwattr $C$DW$195, DW_AT_bit_offset(0x05)
    2281                      .dwattr $C$DW$195, DW_AT_bit_size(0x01)
    2282                      .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2283                      .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    2284              
    2285              $C$DW$196       .dwtag  DW_TAG_member
    2286                      .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$26)
    2287                      .dwattr $C$DW$196, DW_AT_name("PCLKCR8")
    2288                      .dwattr $C$DW$196, DW_AT_TI_symbol_name("_PCLKCR8")
    2289                      .dwattr $C$DW$196, DW_AT_bit_offset(0x04)
    2290                      .dwattr $C$DW$196, DW_AT_bit_size(0x01)
    2291                      .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2292                      .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    2293              
    2294              $C$DW$197       .dwtag  DW_TAG_member
    2295                      .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$26)
    2296                      .dwattr $C$DW$197, DW_AT_name("PCLKCR9")
    2297                      .dwattr $C$DW$197, DW_AT_TI_symbol_name("_PCLKCR9")
    2298                      .dwattr $C$DW$197, DW_AT_bit_offset(0x03)
    2299                      .dwattr $C$DW$197, DW_AT_bit_size(0x01)
    2300                      .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2301                      .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    2302              
    2303              $C$DW$198       .dwtag  DW_TAG_member
    2304                      .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$26)
    2305                      .dwattr $C$DW$198, DW_AT_name("PCLKCR10")
    2306                      .dwattr $C$DW$198, DW_AT_TI_symbol_name("_PCLKCR10")
    2307                      .dwattr $C$DW$198, DW_AT_bit_offset(0x02)
    2308                      .dwattr $C$DW$198, DW_AT_bit_size(0x01)
    2309                      .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2310                      .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    2311              
    2312              $C$DW$199       .dwtag  DW_TAG_member
    2313                      .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$26)
    2314                      .dwattr $C$DW$199, DW_AT_name("PCLKCR11")
    2315                      .dwattr $C$DW$199, DW_AT_TI_symbol_name("_PCLKCR11")
    2316                      .dwattr $C$DW$199, DW_AT_bit_offset(0x01)
    2317                      .dwattr $C$DW$199, DW_AT_bit_size(0x01)
    2318                      .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2319                      .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    2320              
    2321              $C$DW$200       .dwtag  DW_TAG_member
    2322                      .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$26)
    2323                      .dwattr $C$DW$200, DW_AT_name("PCLKCR12")
    2324                      .dwattr $C$DW$200, DW_AT_TI_symbol_name("_PCLKCR12")
    2325                      .dwattr $C$DW$200, DW_AT_bit_offset(0x00)
    2326                      .dwattr $C$DW$200, DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v15.12.1 Sun May 28 09:38:36 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
bissc.asm                                                            PAGE   45

    2327                      .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2328                      .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    2329              
    2330              $C$DW$201       .dwtag  DW_TAG_member
    2331                      .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$26)
    2332                      .dwattr $C$DW$201, DW_AT_name("PCLKCR13")
    2333                      .dwattr $C$DW$201, DW_AT_TI_symbol_name("_PCLKCR13")
    2334                      .dwattr $C$DW$201, DW_AT_bit_offset(0x0f)
    2335                      .dwattr $C$DW$201, DW_AT_bit_size(0x01)
    2336                      .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2337                      .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    2338              
    2339              $C$DW$202       .dwtag  DW_TAG_member
    2340                      .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$26)
    2341                      .dwattr $C$DW$202, DW_AT_name("PCLKCR14")
    2342                      .dwattr $C$DW$202, DW_AT_TI_symbol_name("_PCLKCR14")
    2343                      .dwattr $C$DW$202, DW_AT_bit_offset(0x0e)
    2344                      .dwattr $C$DW$202, DW_AT_bit_size(0x01)
    2345                      .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2346                      .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    2347              
    2348              $C$DW$203       .dwtag  DW_TAG_member
    2349                      .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$26)
    2350                      .dwattr $C$DW$203, DW_AT_name("PCLKCR15")
    2351                      .dwattr $C$DW$203, DW_AT_TI_symbol_name("_PCLKCR15")
    2352                      .dwattr $C$DW$203, DW_AT_bit_offset(0x0d)
    2353                      .dwattr $C$DW$203, DW_AT_bit_size(0x01)
    2354                      .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2355                      .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    2356              
    2357              $C$DW$204       .dwtag  DW_TAG_member
    2358                      .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$26)
