;***************************************************************
;* TMS320C2000 C/C++ Codegen                   PC v15.12.1.LTS *
;* Date/Time created: Sun Feb 26 22:53:35 2017                 *
;***************************************************************
	.compiler_opts --abi=coffabi --cla_support=cla0 --float_support=fpu32 --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --quiet --silicon_version=28 --symdebug:dwarf --symdebug:dwarf_version=3 --tmu_support=tmu0 
FP	.set	XAR2

$C$DW$CU	.dwtag  DW_TAG_compile_unit
	.dwattr $C$DW$CU, DW_AT_name("../utility Src Files/DLOG_4CH_F.c")
	.dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v15.12.1.LTS Copyright (c) 1996-2015 Texas Instruments Incorporated")
	.dwattr $C$DW$CU, DW_AT_TI_version(0x01)
	.dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Keith\workspace_v6_1_3\IDDK_PM_Servo_F2837x-v2\F2837x_RAM")
;	C:\ti\ccsv6\tools\compiler\ti-cgt-c2000_15.12.1.LTS\bin\opt2000.exe C:\\Users\\Keith\\AppData\\Local\\Temp\\199762 C:\\Users\\Keith\\AppData\\Local\\Temp\\199764 
;	C:\ti\ccsv6\tools\compiler\ti-cgt-c2000_15.12.1.LTS\bin\ac2000.exe -@C:\\Users\\Keith\\AppData\\Local\\Temp\\1997612 
	.sect	".text"
	.clink
	.global	_DLOG_4CH_F_init

$C$DW$1	.dwtag  DW_TAG_subprogram
	.dwattr $C$DW$1, DW_AT_name("DLOG_4CH_F_init")
	.dwattr $C$DW$1, DW_AT_low_pc(_DLOG_4CH_F_init)
	.dwattr $C$DW$1, DW_AT_high_pc(0x00)
	.dwattr $C$DW$1, DW_AT_TI_symbol_name("_DLOG_4CH_F_init")

        MOVB      XAR1,#24              ; [CPU_] |44| 
        MOVB      XAR0,#10              ; [CPU_] |44| 
        MOVL      XAR6,*+XAR6[0]        ; [CPU_] |44| 
        MOV       ACC,*+XAR4[AR1] << 1  ; [CPU_] |44| 
        ADDL      ACC,*+XAR4[AR0]       ; [CPU_] |44| 
	.dwpsn	file "../utility Src Files/DLOG_4CH_F.c",line 45,column 4,is_stmt,isa 0
        MOVL      XAR5,ACC              ; [CPU_] |45| 
	.dwpsn	file "../utility Src Files/DLOG_4CH_F.c",line 44,column 4,is_stmt,isa 0
        MOVL      *+XAR5[0],XAR6        ; [CPU_] |44| 
	.dwpsn	file "../utility Src Files/DLOG_4CH_F.c",line 45,column 4,is_stmt,isa 0
        MOVL      XAR6,*+XAR4[4]        ; [CPU_] |45| 
        MOVB      XAR1,#24              ; [CPU_] |45| 
        MOVB      XAR0,#12              ; [CPU_] |45| 
        MOV       ACC,*+XAR4[AR1] << 1  ; [CPU_] |45| 
        MOVL      XAR7,*+XAR6[0]        ; [CPU_] |45| 
        ADDL      ACC,*+XAR4[AR0]       ; [CPU_] |45| 
	.dwpsn	file "../utility Src Files/DLOG_4CH_F.c",line 47,column 4,is_stmt,isa 0
        MOVL      XAR5,ACC              ; [CPU_] |47| 
	.dwpsn	file "../utility Src Files/DLOG_4CH_F.c",line 46,column 4,is_stmt,isa 0
        MOVB      XAR1,#24              ; [CPU_] |46| 
        MOVB      XAR0,#14              ; [CPU_] |46| 
	.dwpsn	file "../utility Src Files/DLOG_4CH_F.c",line 45,column 4,is_stmt,isa 0
        MOVL      *+XAR5[0],XAR7        ; [CPU_] |45| 
	.dwpsn	file "../utility Src Files/DLOG_4CH_F.c",line 46,column 4,is_stmt,isa 0
        MOVL      XAR7,*+XAR4[6]        ; [CPU_] |46| 
	.dwpsn	file "../utility Src Files/DLOG_4CH_F.c",line 47,column 4,is_stmt,isa 0
        MOVL      XAR6,XAR4             ; [CPU_] |47| 
	.dwpsn	file "../utility Src Files/DLOG_4CH_F.c",line 46,column 4,is_stmt,isa 0
        MOV       ACC,*+XAR4[AR1] << 1  ; [CPU_] |46| 
        ADDL      ACC,*+XAR4[AR0]       ; [CPU_] |46| 
        MOVL      XAR7,*+XAR7[0]        ; [CPU_] |46| 
	.dwpsn	file "../utility Src Files/DLOG_4CH_F.c",line 48,column 4,is_stmt,isa 0
        MOVL      XAR5,ACC              ; [CPU_] |48| 
	.dwpsn	file "../utility Src Files/DLOG_4CH_F.c",line 47,column 4,is_stmt,isa 0
        ADDB      XAR6,#24              ; [CPU_] |47| 
	.dwpsn	file "../utility Src Files/DLOG_4CH_F.c",line 48,column 4,is_stmt,isa 0
        MOVB      XAR0,#23              ; [CPU_] |48| 
        MOVB      XAR1,#24              ; [CPU_] |48| 
	.dwpsn	file "../utility Src Files/DLOG_4CH_F.c",line 46,column 4,is_stmt,isa 0
        MOVL      *+XAR5[0],XAR7        ; [CPU_] |46| 
	.dwpsn	file "../utility Src Files/DLOG_4CH_F.c",line 47,column 4,is_stmt,isa 0
        INC       *+XAR6[0]             ; [CPU_] |47| 
	.dwpsn	file "../utility Src Files/DLOG_4CH_F.c",line 48,column 4,is_stmt,isa 0
        MOV       AL,*+XAR4[AR0]        ; [CPU_] |48| 
        CMP       AL,*+XAR4[AR1]        ; [CPU_] |48| 
        B         $C$L2,NEQ             ; [CPU_] |48| 
        ; branchcc occurs ; [] |48| 
	.dwpsn	file "../utility Src Files/DLOG_4CH_F.c",line 50,column 5,is_stmt,isa 0
        MOVB      XAR1,#24              ; [CPU_] |50| 
	.dwpsn	file "../utility Src Files/DLOG_4CH_F.c",line 51,column 5,is_stmt,isa 0
        MOVB      XAR0,#20              ; [CPU_] |51| 
	.dwpsn	file "../utility Src Files/DLOG_4CH_F.c",line 50,column 5,is_stmt,isa 0
        MOV       *+XAR4[AR1],#0        ; [CPU_] |50| 
	.dwpsn	file "../utility Src Files/DLOG_4CH_F.c",line 51,column 5,is_stmt,isa 0
        MOVB      *+XAR4[AR0],#1,UNC    ; [CPU_] |51| 
        B         $C$L2,UNC             ; [CPU_] |51| 
        ; branch occurs ; [] |51| 
$C$L1:    
	.dwpsn	file "../utility Src Files/DLOG_4CH_F.c",line 32,column 3,is_stmt,isa 0
        MOVL      XAR5,*+XAR4[0]        ; [CPU_] |32| 
        MOVB      XAR0,#18              ; [CPU_] |32| 
        MOV32     R0H,*+XAR4[AR0]       ; [CPU_] |32| 
        MOV32     R1H,*+XAR5[0]         ; [CPU_] |32| 
        CMPF32    R1H,R0H               ; [CPU_] |32| 
        MOVST0    ZF, NF                ; [CPU_] |32| 
        B         $C$L2,LEQ             ; [CPU_] |32| 
        ; branchcc occurs ; [] |32| 
        MOVB      XAR0,#16              ; [CPU_] |32| 
        MOV32     R1H,*+XAR4[AR0]       ; [CPU_] |32| 
        CMPF32    R1H,R0H               ; [CPU_] |32| 
        MOVST0    ZF, NF                ; [CPU_] |32| 
        B         $C$L2,GEQ             ; [CPU_] |32| 
        ; branchcc occurs ; [] |32| 
	.dwpsn	file "../utility Src Files/DLOG_4CH_F.c",line 35,column 4,is_stmt,isa 0
        MOVB      XAR0,#20              ; [CPU_] |35| 
        MOVB      *+XAR4[AR0],#2,UNC    ; [CPU_] |35| 
$C$L2:    
	.dwpsn	file "../utility Src Files/DLOG_4CH_F.c",line 56,column 2,is_stmt,isa 0
        MOVL      XAR5,*+XAR4[0]        ; [CPU_] |56| 
        MOVB      XAR0,#16              ; [CPU_] |56| 
        MOVL      ACC,*+XAR5[0]         ; [CPU_] |56| 
        SUBB      SP,#2                 ; [CPU_U] 
	.dwcfi	cfa_offset, -4
        MOVL      *+XAR4[AR0],ACC       ; [CPU_] |56| 
        MOVL      XAR1,*--SP            ; [CPU_] 
	.dwcfi	cfa_offset, -2
	.dwcfi	restore_reg, 7
$C$DW$8	.dwtag  DW_TAG_TI_branch
	.dwattr $C$DW$8, DW_AT_low_pc(0x00)
	.dwattr $C$DW$8, DW_AT_TI_return

        LRETR     ; [CPU_] 
        ; return occurs ; [] 
	.dwattr $C$DW$5, DW_AT_TI_end_file("../utility Src Files/DLOG_4CH_F.c")
	.dwattr $C$DW$5, DW_AT_TI_end_line(0x39)
	.dwattr $C$DW$5, DW_AT_TI_end_column(0x01)
	.dwendentry
	.dwendtag $C$DW$5


;***************************************************************
;* TYPE INFORMATION                                            *
;***************************************************************

$C$DW$T$22	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$22, DW_AT_byte_size(0x1a)
$C$DW$9	.dwtag  DW_TAG_member
	.dwattr $C$DW$9, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$9, DW_AT_name("input_ptr1")
	.dwattr $C$DW$9, DW_AT_TI_symbol_name("_input_ptr1")
	.dwattr $C$DW$9, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$9, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$10	.dwtag  DW_TAG_member
	.dwattr $C$DW$10, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$10, DW_AT_name("input_ptr2")
	.dwattr $C$DW$10, DW_AT_TI_symbol_name("_input_ptr2")
	.dwattr $C$DW$10, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$10, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$11	.dwtag  DW_TAG_member
	.dwattr $C$DW$11, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$11, DW_AT_name("input_ptr3")
	.dwattr $C$DW$11, DW_AT_TI_symbol_name("_input_ptr3")
	.dwattr $C$DW$11, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$11, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$12	.dwtag  DW_TAG_member
	.dwattr $C$DW$12, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$12, DW_AT_name("input_ptr4")
	.dwattr $C$DW$12, DW_AT_TI_symbol_name("_input_ptr4")
	.dwattr $C$DW$12, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$12, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$13	.dwtag  DW_TAG_member
	.dwattr $C$DW$13, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$13, DW_AT_name("output_ptr1")
	.dwattr $C$DW$13, DW_AT_TI_symbol_name("_output_ptr1")
	.dwattr $C$DW$13, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$13, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$14	.dwtag  DW_TAG_member
	.dwattr $C$DW$14, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$14, DW_AT_name("output_ptr2")
	.dwattr $C$DW$14, DW_AT_TI_symbol_name("_output_ptr2")
	.dwattr $C$DW$14, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$14, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$15	.dwtag  DW_TAG_member
	.dwattr $C$DW$15, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$15, DW_AT_name("output_ptr3")
	.dwattr $C$DW$15, DW_AT_TI_symbol_name("_output_ptr3")
	.dwattr $C$DW$15, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$15, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$16	.dwtag  DW_TAG_member
	.dwattr $C$DW$16, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$16, DW_AT_name("output_ptr4")
	.dwattr $C$DW$16, DW_AT_TI_symbol_name("_output_ptr4")
	.dwattr $C$DW$16, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$16, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$17	.dwtag  DW_TAG_member
	.dwattr $C$DW$17, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$17, DW_AT_name("prev_value")
	.dwattr $C$DW$17, DW_AT_TI_symbol_name("_prev_value")
	.dwattr $C$DW$17, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$17, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$18	.dwtag  DW_TAG_member
	.dwattr $C$DW$18, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$18, DW_AT_name("trig_value")
	.dwattr $C$DW$18, DW_AT_TI_symbol_name("_trig_value")
	.dwattr $C$DW$18, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr $C$DW$18, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$19	.dwtag  DW_TAG_member
	.dwattr $C$DW$19, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$19, DW_AT_name("status")
	.dwattr $C$DW$19, DW_AT_TI_symbol_name("_status")
	.dwattr $C$DW$19, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$19, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$20	.dwtag  DW_TAG_member
	.dwattr $C$DW$20, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$20, DW_AT_name("pre_scalar")
	.dwattr $C$DW$20, DW_AT_TI_symbol_name("_pre_scalar")
	.dwattr $C$DW$20, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
	.dwattr $C$DW$20, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$21	.dwtag  DW_TAG_member
	.dwattr $C$DW$21, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$21, DW_AT_name("skip_count")
	.dwattr $C$DW$21, DW_AT_TI_symbol_name("_skip_count")
	.dwattr $C$DW$21, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
	.dwattr $C$DW$21, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$22	.dwtag  DW_TAG_member
	.dwattr $C$DW$22, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$22, DW_AT_name("size")
	.dwattr $C$DW$22, DW_AT_TI_symbol_name("_size")
	.dwattr $C$DW$22, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
	.dwattr $C$DW$22, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$23	.dwtag  DW_TAG_member
	.dwattr $C$DW$23, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$23, DW_AT_name("count")
	.dwattr $C$DW$23, DW_AT_TI_symbol_name("_count")
	.dwattr $C$DW$23, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$23, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$22

$C$DW$T$23	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$23, DW_AT_name("DLOG_4CH_F")
	.dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$T$23, DW_AT_language(DW_LANG_C)

$C$DW$T$24	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$T$24, DW_AT_address_class(0x20)

$C$DW$24	.dwtag  DW_TAG_TI_far_type
	.dwattr $C$DW$24, DW_AT_type(*$C$DW$T$24)

$C$DW$T$25	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$25, DW_AT_type(*$C$DW$24)

$C$DW$T$2	.dwtag  DW_TAG_unspecified_type
	.dwattr $C$DW$T$2, DW_AT_name("void")

$C$DW$T$4	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
	.dwattr $C$DW$T$4, DW_AT_name("bool")
	.dwattr $C$DW$T$4, DW_AT_byte_size(0x01)

$C$DW$T$5	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
	.dwattr $C$DW$T$5, DW_AT_name("signed char")
	.dwattr $C$DW$T$5, DW_AT_byte_size(0x01)

$C$DW$T$6	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
	.dwattr $C$DW$T$6, DW_AT_name("unsigned char")
	.dwattr $C$DW$T$6, DW_AT_byte_size(0x01)

$C$DW$T$7	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
	.dwattr $C$DW$T$7, DW_AT_name("wchar_t")
	.dwattr $C$DW$T$7, DW_AT_byte_size(0x01)

$C$DW$T$8	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
	.dwattr $C$DW$T$8, DW_AT_name("short")
	.dwattr $C$DW$T$8, DW_AT_byte_size(0x01)

$C$DW$T$9	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr $C$DW$T$9, DW_AT_name("unsigned short")
	.dwattr $C$DW$T$9, DW_AT_byte_size(0x01)

$C$DW$T$10	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
	.dwattr $C$DW$T$10, DW_AT_name("int")
	.dwattr $C$DW$T$10, DW_AT_byte_size(0x01)

$C$DW$T$21	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$21, DW_AT_name("int16")
	.dwattr $C$DW$T$21, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$T$21, DW_AT_language(DW_LANG_C)

$C$DW$T$11	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr $C$DW$T$11, DW_AT_name("unsigned int")
	.dwattr $C$DW$T$11, DW_AT_byte_size(0x01)

$C$DW$T$12	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
	.dwattr $C$DW$T$12, DW_AT_name("long")
	.dwattr $C$DW$T$12, DW_AT_byte_size(0x02)

$C$DW$T$13	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr $C$DW$T$13, DW_AT_name("unsigned long")
	.dwattr $C$DW$T$13, DW_AT_byte_size(0x02)

$C$DW$T$14	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
	.dwattr $C$DW$T$14, DW_AT_name("long long")
	.dwattr $C$DW$T$14, DW_AT_byte_size(0x04)

$C$DW$T$15	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
	.dwattr $C$DW$T$15, DW_AT_byte_size(0x04)

$C$DW$T$16	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
	.dwattr $C$DW$T$16, DW_AT_name("float")
	.dwattr $C$DW$T$16, DW_AT_byte_size(0x02)

$C$DW$T$19	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$19, DW_AT_name("float32")
	.dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$T$19, DW_AT_language(DW_LANG_C)

$C$DW$T$20	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$20, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$T$20, DW_AT_address_class(0x20)

$C$DW$T$17	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
	.dwattr $C$DW$T$17, DW_AT_name("double")
	.dwattr $C$DW$T$17, DW_AT_byte_size(0x02)

$C$DW$T$18	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
	.dwattr $C$DW$T$18, DW_AT_name("long double")
	.dwattr $C$DW$T$18, DW_AT_byte_size(0x04)

	.dwattr $C$DW$CU, DW_AT_language(DW_LANG_C)

