TMS320C2000 Assembler PC v15.12.1 Sun Feb 26 22:53:24 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_EPwm.asm                                                     PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                   PC v15.12.1.LTS *
       3              ;* Date/Time created: Sun Feb 26 22:53:24 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --cla_support=cla0 --float_support=fpu32 --hll_source=on --mem_model:cod
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/controlSUITE/device_support/F2837xD/v170/F2837xD_common/source/F2
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v15.12.1.LTS Copyright (c) 1996-201
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Keith\workspace_v6_1_3\IDDK_PM_Servo_F2837x-v2\F2837x_RAM"
      13              $C$DW$1 .dwtag  DW_TAG_variable
      14                      .dwattr $C$DW$1, DW_AT_name("GpioCtrlRegs")

     883              ;*                                                             *
     884              ;* FUNCTION ENVIRONMENT                                        *
     885              ;*                                                             *
     886              ;* FUNCTION PROPERTIES                                         *
     887              ;*                            0 Parameter,  0 Auto,  0 SOE     *
     888              ;***************************************************************
     889              
     890 00000128       _InitEPwm12Gpio:
     891              ;* AR4   assigned to $O$C1
     892                      .dwcfi  cfa_offset, -2
     893                      .dwcfi  save_reg_to_mem, 26, 0
     894 00000128 7622   EALLOW
     895                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xD/v170/F2837xD_common/source/F2837xD_EPwm.c",li
TMS320C2000 Assembler PC v15.12.1 Sun Feb 26 22:53:24 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_EPwm.asm                                                     PAGE   19

     896 00000129 8F00!         MOVL      XAR4,#_GpioCtrlRegs   ; [CPU_U] |320| 
         0000012a 0000 
     897 0000012b A8A9          MOVL      ACC,XAR4              ; [CPU_] |320| 
     898 0000012c FF12          ADD       ACC,#83 << 2          ; [CPU_] |320| 
         0000012d 0053 
     899 0000012e 1EA6          MOVL      XAR6,ACC              ; [CPU_] |320| 
     900                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xD/v170/F2837xD_common/source/F2837xD_EPwm.c",li
     901 0000012f A8A9          MOVL      ACC,XAR4              ; [CPU_] |327| 
     902 00000130 FF11          ADD       ACC,#163 << 1         ; [CPU_] |327| 
         00000131 00A3 
     903                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xD/v170/F2837xD_common/source/F2837xD_EPwm.c",li
     904 00000132 83A9          MOVL      XAR5,ACC              ; [CPU_] |321| 
     905 00000133 761F!         MOVW      DP,#_GpioCtrlRegs+332 ; [CPU_U] 
         00000134 0005 
     906                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xD/v170/F2837xD_common/source/F2837xD_EPwm.c",li
     907 00000135 1AC6          OR        *+XAR6[0],#0x0080     ; [CPU_] |320| 
         00000136 0080 
     908                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xD/v170/F2837xD_common/source/F2837xD_EPwm.c",li
     909 00000137 1A0C!         OR        @_GpioCtrlRegs+332,#0x0100 ; [CPU_] |321| 
         00000138 0100 
     910                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xD/v170/F2837xD_common/source/F2837xD_EPwm.c",li
     911 00000139 CCC5          AND       AL,*+XAR5[0],#0x3fff  ; [CPU_] |327| 
         0000013a 3FFF 
     912 0000013b 1AA9          OR        AL,#0x4000            ; [CPU_] |327| 
         0000013c 4000 
     913 0000013d 9606!         MOV       @_GpioCtrlRegs+326,AL ; [CPU_] |327| 
     914                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xD/v170/F2837xD_common/source/F2837xD_EPwm.c",li
     915 0000013e A8A9          MOVL      ACC,XAR4              ; [CPU_] |328| 
     916 0000013f FF10          ADD       ACC,#327 << 0         ; [CPU_] |328| 
         00000140 0147 
     917 00000141 8AA9          MOVL      XAR4,ACC              ; [CPU_] |328| 
     918 00000142 CCC4          AND       AL,*+XAR4[0],#0xfffc  ; [CPU_] |328| 
         00000143 FFFC 
     919 00000144 5001          ORB       AL,#0x01              ; [CPU_] |328| 
     920 00000145 9607!         MOV       @_GpioCtrlRegs+327,AL ; [CPU_] |328| 
     921 00000146 761A   EDIS
     922 00000147 FF69          SPM       #0                    ; [CPU_] 
     923              $C$DW$39        .dwtag  DW_TAG_TI_branch
     924                      .dwattr $C$DW$39, DW_AT_low_pc(0x00)
     925                      .dwattr $C$DW$39, DW_AT_TI_return
     926              
     927 00000148 0006          LRETR     ; [CPU_] 
     928                      ; return occurs ; [] 
     929                      .dwattr $C$DW$38, DW_AT_TI_end_file("C:/ti/controlSUITE/device_support/F2837xD/v170/F2837xD_common/so
     930                      .dwattr $C$DW$38, DW_AT_TI_end_line(0x14b)
     931                      .dwattr $C$DW$38, DW_AT_TI_end_column(0x01)
     932                      .dwendentry
     933                      .dwendtag $C$DW$38
     934              
     935              ;**************************************************************
     936              ;* UNDEFINED EXTERNAL REFERENCES                              *
     937              ;**************************************************************
     938                      .global _GpioCtrlRegs
     939              
     940              ;***************************************************************
TMS320C2000 Assembler PC v15.12.1 Sun Feb 26 22:53:24 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_EPwm.asm                                                     PAGE   20

     941              ;* TYPE INFORMATION                                            *
     942              ;***************************************************************
     943              
     944              $C$DW$T$20      .dwtag  DW_TAG_structure_type
     945                      .dwattr $C$DW$T$20, DW_AT_name("GPACR_BITS")
     946                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x02)
     947              $C$DW$40        .dwtag  DW_TAG_member
     948                      .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$19)
     949                      .dwattr $C$DW$40, DW_AT_name("GPIO0")
     950                      .dwattr $C$DW$40, DW_AT_TI_symbol_name("_GPIO0")
     951                      .dwattr $C$DW$40, DW_AT_bit_offset(0x0f)
     952                      .dwattr $C$DW$40, DW_AT_bit_size(0x01)
     953                      .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     954                      .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
     955              
     956              $C$DW$41        .dwtag  DW_TAG_member
     957                      .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$19)
     958                      .dwattr $C$DW$41, DW_AT_name("GPIO1")
     959                      .dwattr $C$DW$41, DW_AT_TI_symbol_name("_GPIO1")
     960                      .dwattr $C$DW$41, DW_AT_bit_offset(0x0e)
     961                      .dwattr $C$DW$41, DW_AT_bit_size(0x01)
     962                      .dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     963                      .dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
     964              
     965              $C$DW$42        .dwtag  DW_TAG_member
     966                      .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$19)
     967                      .dwattr $C$DW$42, DW_AT_name("GPIO2")
     968                      .dwattr $C$DW$42, DW_AT_TI_symbol_name("_GPIO2")
     969                      .dwattr $C$DW$42, DW_AT_bit_offset(0x0d)
     970                      .dwattr $C$DW$42, DW_AT_bit_size(0x01)
     971                      .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     972                      .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
     973              
     974              $C$DW$43        .dwtag  DW_TAG_member
     975                      .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$19)
     976                      .dwattr $C$DW$43, DW_AT_name("GPIO3")
     977                      .dwattr $C$DW$43, DW_AT_TI_symbol_name("_GPIO3")
     978                      .dwattr $C$DW$43, DW_AT_bit_offset(0x0c)
     979                      .dwattr $C$DW$43, DW_AT_bit_size(0x01)
     980                      .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     981                      .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
     982              
     983              $C$DW$44        .dwtag  DW_TAG_member
     984                      .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$19)
     985                      .dwattr $C$DW$44, DW_AT_name("GPIO4")
     986                      .dwattr $C$DW$44, DW_AT_TI_symbol_name("_GPIO4")
     987                      .dwattr $C$DW$44, DW_AT_bit_offset(0x0b)
     988                      .dwattr $C$DW$44, DW_AT_bit_size(0x01)
     989                      .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     990                      .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
     991              
     992              $C$DW$45        .dwtag  DW_TAG_member
     993                      .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$19)
     994                      .dwattr $C$DW$45, DW_AT_name("GPIO5")
     995                      .dwattr $C$DW$45, DW_AT_TI_symbol_name("_GPIO5")
TMS320C2000 Assembler PC v15.12.1 Sun Feb 26 22:53:24 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_EPwm.asm                                                     PAGE   21

     996                      .dwattr $C$DW$45, DW_AT_bit_offset(0x0a)
     997                      .dwattr $C$DW$45, DW_AT_bit_size(0x01)
     998                      .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     999                      .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
    1000              
    1001              $C$DW$46        .dwtag  DW_TAG_member
    1002                      .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$19)
    1003                      .dwattr $C$DW$46, DW_AT_name("GPIO6")
    1004                      .dwattr $C$DW$46, DW_AT_TI_symbol_name("_GPIO6")
    1005                      .dwattr $C$DW$46, DW_AT_bit_offset(0x09)
    1006                      .dwattr $C$DW$46, DW_AT_bit_size(0x01)
    1007                      .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1008                      .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
    1009              
    1010              $C$DW$47        .dwtag  DW_TAG_member
    1011                      .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$19)
    1012                      .dwattr $C$DW$47, DW_AT_name("GPIO7")
    1013                      .dwattr $C$DW$47, DW_AT_TI_symbol_name("_GPIO7")
    1014                      .dwattr $C$DW$47, DW_AT_bit_offset(0x08)
    1015                      .dwattr $C$DW$47, DW_AT_bit_size(0x01)
    1016                      .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1017                      .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
    1018              
    1019              $C$DW$48        .dwtag  DW_TAG_member
    1020                      .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$19)
    1021                      .dwattr $C$DW$48, DW_AT_name("GPIO8")
    1022                      .dwattr $C$DW$48, DW_AT_TI_symbol_name("_GPIO8")
    1023                      .dwattr $C$DW$48, DW_AT_bit_offset(0x07)
    1024                      .dwattr $C$DW$48, DW_AT_bit_size(0x01)
    1025                      .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1026                      .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
    1027              
    1028              $C$DW$49        .dwtag  DW_TAG_member
    1029                      .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$19)
    1030                      .dwattr $C$DW$49, DW_AT_name("GPIO9")
    1031                      .dwattr $C$DW$49, DW_AT_TI_symbol_name("_GPIO9")
    1032                      .dwattr $C$DW$49, DW_AT_bit_offset(0x06)
    1033                      .dwattr $C$DW$49, DW_AT_bit_size(0x01)
    1034                      .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1035                      .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
    1036              
    1037              $C$DW$50        .dwtag  DW_TAG_member
    1038                      .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$19)
    1039                      .dwattr $C$DW$50, DW_AT_name("GPIO10")
    1040                      .dwattr $C$DW$50, DW_AT_TI_symbol_name("_GPIO10")
    1041                      .dwattr $C$DW$50, DW_AT_bit_offset(0x05)
    1042                      .dwattr $C$DW$50, DW_AT_bit_size(0x01)
    1043                      .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1044                      .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
    1045              
    1046              $C$DW$51        .dwtag  DW_TAG_member
    1047                      .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$19)
    1048                      .dwattr $C$DW$51, DW_AT_name("GPIO11")
    1049                      .dwattr $C$DW$51, DW_AT_TI_symbol_name("_GPIO11")
    1050                      .dwattr $C$DW$51, DW_AT_bit_offset(0x04)
TMS320C2000 Assembler PC v15.12.1 Sun Feb 26 22:53:24 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_EPwm.asm                                                     PAGE   22

    1051                      .dwattr $C$DW$51, DW_AT_bit_size(0x01)
    1052                      .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1053                      .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
    1054              
    1055              $C$DW$52        .dwtag  DW_TAG_member
    1056                      .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$19)
    1057                      .dwattr $C$DW$52, DW_AT_name("GPIO12")
    1058                      .dwattr $C$DW$52, DW_AT_TI_symbol_name("_GPIO12")
    1059                      .dwattr $C$DW$52, DW_AT_bit_offset(0x03)
    1060                      .dwattr $C$DW$52, DW_AT_bit_size(0x01)
    1061                      .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1062                      .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
    1063              
    1064              $C$DW$53        .dwtag  DW_TAG_member
    1065                      .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$19)
    1066                      .dwattr $C$DW$53, DW_AT_name("GPIO13")
    1067                      .dwattr $C$DW$53, DW_AT_TI_symbol_name("_GPIO13")
    1068                      .dwattr $C$DW$53, DW_AT_bit_offset(0x02)
    1069                      .dwattr $C$DW$53, DW_AT_bit_size(0x01)
    1070                      .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1071                      .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
    1072              
    1073              $C$DW$54        .dwtag  DW_TAG_member
    1074                      .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$19)
    1075                      .dwattr $C$DW$54, DW_AT_name("GPIO14")
    1076                      .dwattr $C$DW$54, DW_AT_TI_symbol_name("_GPIO14")
    1077                      .dwattr $C$DW$54, DW_AT_bit_offset(0x01)
    1078                      .dwattr $C$DW$54, DW_AT_bit_size(0x01)
    1079                      .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1080                      .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
    1081              
    1082              $C$DW$55        .dwtag  DW_TAG_member
    1083                      .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$19)
    1084                      .dwattr $C$DW$55, DW_AT_name("GPIO15")
    1085                      .dwattr $C$DW$55, DW_AT_TI_symbol_name("_GPIO15")
    1086                      .dwattr $C$DW$55, DW_AT_bit_offset(0x00)
    1087                      .dwattr $C$DW$55, DW_AT_bit_size(0x01)
    1088                      .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1089                      .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
    1090              
    1091              $C$DW$56        .dwtag  DW_TAG_member
    1092                      .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$19)
    1093                      .dwattr $C$DW$56, DW_AT_name("GPIO16")
    1094                      .dwattr $C$DW$56, DW_AT_TI_symbol_name("_GPIO16")
    1095                      .dwattr $C$DW$56, DW_AT_bit_offset(0x0f)
    1096                      .dwattr $C$DW$56, DW_AT_bit_size(0x01)
    1097                      .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1098                      .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
    1099              
    1100              $C$DW$57        .dwtag  DW_TAG_member
    1101                      .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$19)
    1102                      .dwattr $C$DW$57, DW_AT_name("GPIO17")
    1103                      .dwattr $C$DW$57, DW_AT_TI_symbol_name("_GPIO17")
    1104                      .dwattr $C$DW$57, DW_AT_bit_offset(0x0e)
    1105                      .dwattr $C$DW$57, DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v15.12.1 Sun Feb 26 22:53:24 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_EPwm.asm                                                     PAGE   23

    1106                      .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1107                      .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
    1108              
    1109              $C$DW$58        .dwtag  DW_TAG_member
    1110                      .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$19)
    1111                      .dwattr $C$DW$58, DW_AT_name("GPIO18")
    1112                      .dwattr $C$DW$58, DW_AT_TI_symbol_name("_GPIO18")
    1113                      .dwattr $C$DW$58, DW_AT_bit_offset(0x0d)
    1114                      .dwattr $C$DW$58, DW_AT_bit_size(0x01)
    1115                      .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1116                      .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
    1117              
    1118              $C$DW$59        .dwtag  DW_TAG_member
    1119                      .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$19)
    1120                      .dwattr $C$DW$59, DW_AT_name("GPIO19")
    1121                      .dwattr $C$DW$59, DW_AT_TI_symbol_name("_GPIO19")
    1122                      .dwattr $C$DW$59, DW_AT_bit_offset(0x0c)
    1123                      .dwattr $C$DW$59, DW_AT_bit_size(0x01)
    1124                      .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1125                      .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
    1126              
    1127              $C$DW$60        .dwtag  DW_TAG_member
    1128                      .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$19)
    1129                      .dwattr $C$DW$60, DW_AT_name("GPIO20")
    1130                      .dwattr $C$DW$60, DW_AT_TI_symbol_name("_GPIO20")
    1131                      .dwattr $C$DW$60, DW_AT_bit_offset(0x0b)
    1132                      .dwattr $C$DW$60, DW_AT_bit_size(0x01)
    1133                      .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1134                      .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
    1135              
    1136              $C$DW$61        .dwtag  DW_TAG_member
    1137                      .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$19)
    1138                      .dwattr $C$DW$61, DW_AT_name("GPIO21")
    1139                      .dwattr $C$DW$61, DW_AT_TI_symbol_name("_GPIO21")
    1140                      .dwattr $C$DW$61, DW_AT_bit_offset(0x0a)
    1141                      .dwattr $C$DW$61, DW_AT_bit_size(0x01)
    1142                      .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1143                      .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
    1144              
    1145              $C$DW$62        .dwtag  DW_TAG_member
    1146                      .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$19)
    1147                      .dwattr $C$DW$62, DW_AT_name("GPIO22")
    1148                      .dwattr $C$DW$62, DW_AT_TI_symbol_name("_GPIO22")
    1149                      .dwattr $C$DW$62, DW_AT_bit_offset(0x09)
    1150                      .dwattr $C$DW$62, DW_AT_bit_size(0x01)
    1151                      .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1152                      .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
    1153              
    1154              $C$DW$63        .dwtag  DW_TAG_member
    1155                      .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$19)
    1156                      .dwattr $C$DW$63, DW_AT_name("GPIO23")
    1157                      .dwattr $C$DW$63, DW_AT_TI_symbol_name("_GPIO23")
    1158                      .dwattr $C$DW$63, DW_AT_bit_offset(0x08)
    1159                      .dwattr $C$DW$63, DW_AT_bit_size(0x01)
    1160                      .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
TMS320C2000 Assembler PC v15.12.1 Sun Feb 26 22:53:24 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_EPwm.asm                                                     PAGE   24

    1161                      .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
    1162              
    1163              $C$DW$64        .dwtag  DW_TAG_member
    1164                      .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$19)
    1165                      .dwattr $C$DW$64, DW_AT_name("GPIO24")
    1166                      .dwattr $C$DW$64, DW_AT_TI_symbol_name("_GPIO24")
    1167                      .dwattr $C$DW$64, DW_AT_bit_offset(0x07)
    1168                      .dwattr $C$DW$64, DW_AT_bit_size(0x01)
    1169                      .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1170                      .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
    1171              
    1172              $C$DW$65        .dwtag  DW_TAG_member
    1173                      .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$19)
    1174                      .dwattr $C$DW$65, DW_AT_name("GPIO25")
    1175                      .dwattr $C$DW$65, DW_AT_TI_symbol_name("_GPIO25")
    1176                      .dwattr $C$DW$65, DW_AT_bit_offset(0x06)
    1177                      .dwattr $C$DW$65, DW_AT_bit_size(0x01)
    1178                      .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1179                      .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
    1180              
    1181              $C$DW$66        .dwtag  DW_TAG_member
    1182                      .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$19)
    1183                      .dwattr $C$DW$66, DW_AT_name("GPIO26")
    1184                      .dwattr $C$DW$66, DW_AT_TI_symbol_name("_GPIO26")
    1185                      .dwattr $C$DW$66, DW_AT_bit_offset(0x05)
    1186                      .dwattr $C$DW$66, DW_AT_bit_size(0x01)
    1187                      .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1188                      .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
    1189              
    1190              $C$DW$67        .dwtag  DW_TAG_member
    1191                      .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$19)
    1192                      .dwattr $C$DW$67, DW_AT_name("GPIO27")
    1193                      .dwattr $C$DW$67, DW_AT_TI_symbol_name("_GPIO27")
    1194                      .dwattr $C$DW$67, DW_AT_bit_offset(0x04)
    1195                      .dwattr $C$DW$67, DW_AT_bit_size(0x01)
    1196                      .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1197                      .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
    1198              
    1199              $C$DW$68        .dwtag  DW_TAG_member
    1200                      .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$19)
    1201                      .dwattr $C$DW$68, DW_AT_name("GPIO28")
    1202                      .dwattr $C$DW$68, DW_AT_TI_symbol_name("_GPIO28")
    1203                      .dwattr $C$DW$68, DW_AT_bit_offset(0x03)
    1204                      .dwattr $C$DW$68, DW_AT_bit_size(0x01)
    1205                      .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1206                      .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
    1207              
    1208              $C$DW$69        .dwtag  DW_TAG_member
    1209                      .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$19)
    1210                      .dwattr $C$DW$69, DW_AT_name("GPIO29")
    1211                      .dwattr $C$DW$69, DW_AT_TI_symbol_name("_GPIO29")
    1212                      .dwattr $C$DW$69, DW_AT_bit_offset(0x02)
    1213                      .dwattr $C$DW$69, DW_AT_bit_size(0x01)
    1214                      .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1215                      .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.1 Sun Feb 26 22:53:24 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_EPwm.asm                                                     PAGE   25

    1216              
    1217              $C$DW$70        .dwtag  DW_TAG_member
    1218                      .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$19)
    1219                      .dwattr $C$DW$70, DW_AT_name("GPIO30")
    1220                      .dwattr $C$DW$70, DW_AT_TI_symbol_name("_GPIO30")
    1221                      .dwattr $C$DW$70, DW_AT_bit_offset(0x01)
    1222                      .dwattr $C$DW$70, DW_AT_bit_size(0x01)
    1223                      .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1224                      .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
    1225              
    1226              $C$DW$71        .dwtag  DW_TAG_member
    1227                      .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$19)
    1228                      .dwattr $C$DW$71, DW_AT_name("GPIO31")
    1229                      .dwattr $C$DW$71, DW_AT_TI_symbol_name("_GPIO31")
    1230                      .dwattr $C$DW$71, DW_AT_bit_offset(0x00)
    1231                      .dwattr $C$DW$71, DW_AT_bit_size(0x01)
    1232                      .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1233                      .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
    1234              
    1235                      .dwendtag $C$DW$T$20
    1236              
    1237              
    1238              $C$DW$T$22      .dwtag  DW_TAG_union_type
    1239                      .dwattr $C$DW$T$22, DW_AT_name("GPACR_REG")
    1240                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x02)
    1241              $C$DW$72        .dwtag  DW_TAG_member
    1242                      .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$21)
    1243                      .dwattr $C$DW$72, DW_AT_name("all")
    1244                      .dwattr $C$DW$72, DW_AT_TI_symbol_name("_all")
    1245                      .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1246                      .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
    1247              
    1248              $C$DW$73        .dwtag  DW_TAG_member
    1249                      .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$20)
    1250                      .dwattr $C$DW$73, DW_AT_name("bit")
    1251                      .dwattr $C$DW$73, DW_AT_TI_symbol_name("_bit")
    1252                      .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1253                      .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
    1254              
    1255                      .dwendtag $C$DW$T$22
    1256              
    1257              
    1258              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    1259                      .dwattr $C$DW$T$23, DW_AT_name("GPACSEL1_BITS")
    1260                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x02)
    1261              $C$DW$74        .dwtag  DW_TAG_member
    1262                      .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$19)
    1263                      .dwattr $C$DW$74, DW_AT_name("GPIO0")
    1264                      .dwattr $C$DW$74, DW_AT_TI_symbol_name("_GPIO0")
    1265                      .dwattr $C$DW$74, DW_AT_bit_offset(0x0c)
    1266                      .dwattr $C$DW$74, DW_AT_bit_size(0x04)
    1267                      .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1268                      .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
    1269              
    1270              $C$DW$75        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v15.12.1 Sun Feb 26 22:53:24 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_EPwm.asm                                                     PAGE   26

    1271                      .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$19)
    1272                      .dwattr $C$DW$75, DW_AT_name("GPIO1")
    1273                      .dwattr $C$DW$75, DW_AT_TI_symbol_name("_GPIO1")
    1274                      .dwattr $C$DW$75, DW_AT_bit_offset(0x08)
    1275                      .dwattr $C$DW$75, DW_AT_bit_size(0x04)
    1276                      .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1277                      .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
    1278              
    1279              $C$DW$76        .dwtag  DW_TAG_member
    1280                      .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$19)
    1281                      .dwattr $C$DW$76, DW_AT_name("GPIO2")
    1282                      .dwattr $C$DW$76, DW_AT_TI_symbol_name("_GPIO2")
    1283                      .dwattr $C$DW$76, DW_AT_bit_offset(0x04)
    1284                      .dwattr $C$DW$76, DW_AT_bit_size(0x04)
    1285                      .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1286                      .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
    1287              
    1288              $C$DW$77        .dwtag  DW_TAG_member
    1289                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$19)
    1290                      .dwattr $C$DW$77, DW_AT_name("GPIO3")
    1291                      .dwattr $C$DW$77, DW_AT_TI_symbol_name("_GPIO3")
    1292                      .dwattr $C$DW$77, DW_AT_bit_offset(0x00)
    1293                      .dwattr $C$DW$77, DW_AT_bit_size(0x04)
    1294                      .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1295                      .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
    1296              
    1297              $C$DW$78        .dwtag  DW_TAG_member
    1298                      .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$19)
    1299                      .dwattr $C$DW$78, DW_AT_name("GPIO4")
    1300                      .dwattr $C$DW$78, DW_AT_TI_symbol_name("_GPIO4")
    1301                      .dwattr $C$DW$78, DW_AT_bit_offset(0x0c)
    1302                      .dwattr $C$DW$78, DW_AT_bit_size(0x04)
    1303                      .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1304                      .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
    1305              
    1306              $C$DW$79        .dwtag  DW_TAG_member
    1307                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$19)
    1308                      .dwattr $C$DW$79, DW_AT_name("GPIO5")
    1309                      .dwattr $C$DW$79, DW_AT_TI_symbol_name("_GPIO5")
    1310                      .dwattr $C$DW$79, DW_AT_bit_offset(0x08)
    1311                      .dwattr $C$DW$79, DW_AT_bit_size(0x04)
    1312                      .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1313                      .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    1314              
    1315              $C$DW$80        .dwtag  DW_TAG_member
    1316                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$19)
    1317                      .dwattr $C$DW$80, DW_AT_name("GPIO6")
    1318                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_GPIO6")
    1319                      .dwattr $C$DW$80, DW_AT_bit_offset(0x04)
    1320                      .dwattr $C$DW$80, DW_AT_bit_size(0x04)
    1321                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1322                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    1323              
    1324              $C$DW$81        .dwtag  DW_TAG_member
    1325                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v15.12.1 Sun Feb 26 22:53:24 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_EPwm.asm                                                     PAGE   27

    1326                      .dwattr $C$DW$81, DW_AT_name("GPIO7")
    1327                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_GPIO7")
    1328                      .dwattr $C$DW$81, DW_AT_bit_offset(0x00)
    1329                      .dwattr $C$DW$81, DW_AT_bit_size(0x04)
    1330                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1331                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1332              
    1333                      .dwendtag $C$DW$T$23
    1334              
    1335              
    1336              $C$DW$T$24      .dwtag  DW_TAG_union_type
    1337                      .dwattr $C$DW$T$24, DW_AT_name("GPACSEL1_REG")
    1338                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x02)
    1339              $C$DW$82        .dwtag  DW_TAG_member
    1340                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$21)
    1341                      .dwattr $C$DW$82, DW_AT_name("all")
    1342                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_all")
    1343                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1344                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1345              
    1346              $C$DW$83        .dwtag  DW_TAG_member
    1347                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$23)
    1348                      .dwattr $C$DW$83, DW_AT_name("bit")
    1349                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_bit")
    1350                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1351                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1352              
    1353                      .dwendtag $C$DW$T$24
    1354              
    1355              
    1356              $C$DW$T$25      .dwtag  DW_TAG_structure_type
    1357                      .dwattr $C$DW$T$25, DW_AT_name("GPACSEL2_BITS")
    1358                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x02)
    1359              $C$DW$84        .dwtag  DW_TAG_member
    1360                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$19)
    1361                      .dwattr $C$DW$84, DW_AT_name("GPIO8")
    1362                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_GPIO8")
    1363                      .dwattr $C$DW$84, DW_AT_bit_offset(0x0c)
    1364                      .dwattr $C$DW$84, DW_AT_bit_size(0x04)
    1365                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1366                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1367              
    1368              $C$DW$85        .dwtag  DW_TAG_member
    1369                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$19)
    1370                      .dwattr $C$DW$85, DW_AT_name("GPIO9")
    1371                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_GPIO9")
    1372                      .dwattr $C$DW$85, DW_AT_bit_offset(0x08)
    1373                      .dwattr $C$DW$85, DW_AT_bit_size(0x04)
    1374                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1375                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1376              
    1377              $C$DW$86        .dwtag  DW_TAG_member
    1378                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$19)
    1379                      .dwattr $C$DW$86, DW_AT_name("GPIO10")
    1380                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_GPIO10")
TMS320C2000 Assembler PC v15.12.1 Sun Feb 26 22:53:24 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_EPwm.asm                                                     PAGE   28

    1381                      .dwattr $C$DW$86, DW_AT_bit_offset(0x04)
    1382                      .dwattr $C$DW$86, DW_AT_bit_size(0x04)
    1383                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1384                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1385              
    1386              $C$DW$87        .dwtag  DW_TAG_member
    1387                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$19)
    1388                      .dwattr $C$DW$87, DW_AT_name("GPIO11")
    1389                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_GPIO11")
    1390                      .dwattr $C$DW$87, DW_AT_bit_offset(0x00)
    1391                      .dwattr $C$DW$87, DW_AT_bit_size(0x04)
    1392                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1393                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1394              
    1395              $C$DW$88        .dwtag  DW_TAG_member
    1396                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$19)
    1397                      .dwattr $C$DW$88, DW_AT_name("GPIO12")
    1398                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_GPIO12")
    1399                      .dwattr $C$DW$88, DW_AT_bit_offset(0x0c)
    1400                      .dwattr $C$DW$88, DW_AT_bit_size(0x04)
    1401                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1402                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1403              
    1404              $C$DW$89        .dwtag  DW_TAG_member
    1405                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$19)
    1406                      .dwattr $C$DW$89, DW_AT_name("GPIO13")
    1407                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_GPIO13")
    1408                      .dwattr $C$DW$89, DW_AT_bit_offset(0x08)
    1409                      .dwattr $C$DW$89, DW_AT_bit_size(0x04)
    1410                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1411                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1412              
    1413              $C$DW$90        .dwtag  DW_TAG_member
    1414                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$19)
    1415                      .dwattr $C$DW$90, DW_AT_name("GPIO14")
    1416                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_GPIO14")
    1417                      .dwattr $C$DW$90, DW_AT_bit_offset(0x04)
    1418                      .dwattr $C$DW$90, DW_AT_bit_size(0x04)
    1419                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1420                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1421              
    1422              $C$DW$91        .dwtag  DW_TAG_member
    1423                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$19)
    1424                      .dwattr $C$DW$91, DW_AT_name("GPIO15")
    1425                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_GPIO15")
    1426                      .dwattr $C$DW$91, DW_AT_bit_offset(0x00)
    1427                      .dwattr $C$DW$91, DW_AT_bit_size(0x04)
    1428                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1429                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1430              
    1431                      .dwendtag $C$DW$T$25
    1432              
    1433              
    1434              $C$DW$T$26      .dwtag  DW_TAG_union_type
    1435                      .dwattr $C$DW$T$26, DW_AT_name("GPACSEL2_REG")
TMS320C2000 Assembler PC v15.12.1 Sun Feb 26 22:53:24 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_EPwm.asm                                                     PAGE   29

    1436                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x02)
    1437              $C$DW$92        .dwtag  DW_TAG_member
    1438                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$21)
    1439                      .dwattr $C$DW$92, DW_AT_name("all")
    1440                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_all")
    1441                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1442                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1443              
    1444              $C$DW$93        .dwtag  DW_TAG_member
    1445                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$25)
    1446                      .dwattr $C$DW$93, DW_AT_name("bit")
    1447                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_bit")
    1448                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1449                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1450              
    1451                      .dwendtag $C$DW$T$26
    1452              
    1453              
    1454              $C$DW$T$27      .dwtag  DW_TAG_structure_type
    1455                      .dwattr $C$DW$T$27, DW_AT_name("GPACSEL3_BITS")
    1456                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x02)
    1457              $C$DW$94        .dwtag  DW_TAG_member
    1458                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$19)
    1459                      .dwattr $C$DW$94, DW_AT_name("GPIO16")
    1460                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_GPIO16")
    1461                      .dwattr $C$DW$94, DW_AT_bit_offset(0x0c)
    1462                      .dwattr $C$DW$94, DW_AT_bit_size(0x04)
    1463                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1464                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1465              
    1466              $C$DW$95        .dwtag  DW_TAG_member
    1467                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$19)
    1468                      .dwattr $C$DW$95, DW_AT_name("GPIO17")
    1469                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_GPIO17")
    1470                      .dwattr $C$DW$95, DW_AT_bit_offset(0x08)
    1471                      .dwattr $C$DW$95, DW_AT_bit_size(0x04)
    1472                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1473                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1474              
    1475              $C$DW$96        .dwtag  DW_TAG_member
    1476                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$19)
    1477                      .dwattr $C$DW$96, DW_AT_name("GPIO18")
    1478                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_GPIO18")
    1479                      .dwattr $C$DW$96, DW_AT_bit_offset(0x04)
    1480                      .dwattr $C$DW$96, DW_AT_bit_size(0x04)
    1481                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1482                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1483              
    1484              $C$DW$97        .dwtag  DW_TAG_member
    1485                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$19)
    1486                      .dwattr $C$DW$97, DW_AT_name("GPIO19")
    1487                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_GPIO19")
    1488                      .dwattr $C$DW$97, DW_AT_bit_offset(0x00)
    1489                      .dwattr $C$DW$97, DW_AT_bit_size(0x04)
    1490                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v15.12.1 Sun Feb 26 22:53:24 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_EPwm.asm                                                     PAGE   30

    1491                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1492              
    1493              $C$DW$98        .dwtag  DW_TAG_member
    1494                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$19)
    1495                      .dwattr $C$DW$98, DW_AT_name("GPIO20")
    1496                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_GPIO20")
    1497                      .dwattr $C$DW$98, DW_AT_bit_offset(0x0c)
    1498                      .dwattr $C$DW$98, DW_AT_bit_size(0x04)
    1499                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1500                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1501              
    1502              $C$DW$99        .dwtag  DW_TAG_member
    1503                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$19)
    1504                      .dwattr $C$DW$99, DW_AT_name("GPIO21")
    1505                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_GPIO21")
    1506                      .dwattr $C$DW$99, DW_AT_bit_offset(0x08)
    1507                      .dwattr $C$DW$99, DW_AT_bit_size(0x04)
    1508                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1509                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1510              
    1511              $C$DW$100       .dwtag  DW_TAG_member
    1512                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$19)
    1513                      .dwattr $C$DW$100, DW_AT_name("GPIO22")
    1514                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_GPIO22")
    1515                      .dwattr $C$DW$100, DW_AT_bit_offset(0x04)
    1516                      .dwattr $C$DW$100, DW_AT_bit_size(0x04)
    1517                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1518                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1519              
    1520              $C$DW$101       .dwtag  DW_TAG_member
    1521                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$19)
    1522                      .dwattr $C$DW$101, DW_AT_name("GPIO23")
    1523                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_GPIO23")
    1524                      .dwattr $C$DW$101, DW_AT_bit_offset(0x00)
    1525                      .dwattr $C$DW$101, DW_AT_bit_size(0x04)
    1526                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1527                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1528              
    1529                      .dwendtag $C$DW$T$27
    1530              
    1531              
    1532              $C$DW$T$28      .dwtag  DW_TAG_union_type
    1533                      .dwattr $C$DW$T$28, DW_AT_name("GPACSEL3_REG")
    1534                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x02)
    1535              $C$DW$102       .dwtag  DW_TAG_member
    1536                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$21)
    1537                      .dwattr $C$DW$102, DW_AT_name("all")
    1538                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_all")
    1539                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1540                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1541              
    1542              $C$DW$103       .dwtag  DW_TAG_member
    1543                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$27)
    1544                      .dwattr $C$DW$103, DW_AT_name("bit")
    1545                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_bit")
TMS320C2000 Assembler PC v15.12.1 Sun Feb 26 22:53:24 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_EPwm.asm                                                     PAGE   31

    1546                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1547                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1548              
    1549                      .dwendtag $C$DW$T$28
    1550              
    1551              
    1552              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    1553                      .dwattr $C$DW$T$29, DW_AT_name("GPACSEL4_BITS")
    1554                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x02)
    1555              $C$DW$104       .dwtag  DW_TAG_member
    1556                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$19)
    1557                      .dwattr $C$DW$104, DW_AT_name("GPIO24")
    1558                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_GPIO24")
    1559                      .dwattr $C$DW$104, DW_AT_bit_offset(0x0c)
    1560                      .dwattr $C$DW$104, DW_AT_bit_size(0x04)
    1561                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1562                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1563              
    1564              $C$DW$105       .dwtag  DW_TAG_member
    1565                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$19)
    1566                      .dwattr $C$DW$105, DW_AT_name("GPIO25")
    1567                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_GPIO25")
    1568                      .dwattr $C$DW$105, DW_AT_bit_offset(0x08)
    1569                      .dwattr $C$DW$105, DW_AT_bit_size(0x04)
    1570                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1571                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1572              
    1573              $C$DW$106       .dwtag  DW_TAG_member
    1574                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$19)
    1575                      .dwattr $C$DW$106, DW_AT_name("GPIO26")
    1576                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_GPIO26")
    1577                      .dwattr $C$DW$106, DW_AT_bit_offset(0x04)
    1578                      .dwattr $C$DW$106, DW_AT_bit_size(0x04)
    1579                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1580                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1581              
    1582              $C$DW$107       .dwtag  DW_TAG_member
    1583                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$19)
    1584                      .dwattr $C$DW$107, DW_AT_name("GPIO27")
    1585                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_GPIO27")
    1586                      .dwattr $C$DW$107, DW_AT_bit_offset(0x00)
    1587                      .dwattr $C$DW$107, DW_AT_bit_size(0x04)
    1588                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1589                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1590              
    1591              $C$DW$108       .dwtag  DW_TAG_member
    1592                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$19)
    1593                      .dwattr $C$DW$108, DW_AT_name("GPIO28")
    1594                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_GPIO28")
    1595                      .dwattr $C$DW$108, DW_AT_bit_offset(0x0c)
    1596                      .dwattr $C$DW$108, DW_AT_bit_size(0x04)
    1597                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1598                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1599              
    1600              $C$DW$109       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v15.12.1 Sun Feb 26 22:53:24 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_EPwm.asm                                                     PAGE   32

    1601                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$19)
    1602                      .dwattr $C$DW$109, DW_AT_name("GPIO29")
    1603                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_GPIO29")
    1604                      .dwattr $C$DW$109, DW_AT_bit_offset(0x08)
    1605                      .dwattr $C$DW$109, DW_AT_bit_size(0x04)
    1606                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1607                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1608              
    1609              $C$DW$110       .dwtag  DW_TAG_member
    1610                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$19)
    1611                      .dwattr $C$DW$110, DW_AT_name("GPIO30")
    1612                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_GPIO30")
    1613                      .dwattr $C$DW$110, DW_AT_bit_offset(0x04)
    1614                      .dwattr $C$DW$110, DW_AT_bit_size(0x04)
    1615                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1616                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1617              
    1618              $C$DW$111       .dwtag  DW_TAG_member
    1619                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$19)
    1620                      .dwattr $C$DW$111, DW_AT_name("GPIO31")
    1621                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_GPIO31")
    1622                      .dwattr $C$DW$111, DW_AT_bit_offset(0x00)
    1623                      .dwattr $C$DW$111, DW_AT_bit_size(0x04)
    1624                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1625                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1626              
    1627                      .dwendtag $C$DW$T$29
    1628              
    1629              
    1630              $C$DW$T$30      .dwtag  DW_TAG_union_type
    1631                      .dwattr $C$DW$T$30, DW_AT_name("GPACSEL4_REG")
    1632                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x02)
    1633              $C$DW$112       .dwtag  DW_TAG_member
    1634                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$21)
    1635                      .dwattr $C$DW$112, DW_AT_name("all")
    1636                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_all")
    1637                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1638                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1639              
    1640              $C$DW$113       .dwtag  DW_TAG_member
    1641                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$29)
    1642                      .dwattr $C$DW$113, DW_AT_name("bit")
    1643                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_bit")
    1644                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1645                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1646              
    1647                      .dwendtag $C$DW$T$30
    1648              
    1649              
    1650              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    1651                      .dwattr $C$DW$T$31, DW_AT_name("GPACTRL_BITS")
    1652                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x02)
    1653              $C$DW$114       .dwtag  DW_TAG_member
    1654                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$19)
    1655                      .dwattr $C$DW$114, DW_AT_name("QUALPRD0")
TMS320C2000 Assembler PC v15.12.1 Sun Feb 26 22:53:24 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_EPwm.asm                                                     PAGE   33

    1656                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_QUALPRD0")
    1657                      .dwattr $C$DW$114, DW_AT_bit_offset(0x08)
    1658                      .dwattr $C$DW$114, DW_AT_bit_size(0x08)
    1659                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1660                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1661              
    1662              $C$DW$115       .dwtag  DW_TAG_member
    1663                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$19)
    1664                      .dwattr $C$DW$115, DW_AT_name("QUALPRD1")
    1665                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_QUALPRD1")
    1666                      .dwattr $C$DW$115, DW_AT_bit_offset(0x00)
    1667                      .dwattr $C$DW$115, DW_AT_bit_size(0x08)
    1668                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1669                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1670              
    1671              $C$DW$116       .dwtag  DW_TAG_member
    1672                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$19)
    1673                      .dwattr $C$DW$116, DW_AT_name("QUALPRD2")
    1674                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_QUALPRD2")
    1675                      .dwattr $C$DW$116, DW_AT_bit_offset(0x08)
    1676                      .dwattr $C$DW$116, DW_AT_bit_size(0x08)
    1677                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1678                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1679              
    1680              $C$DW$117       .dwtag  DW_TAG_member
    1681                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$19)
    1682                      .dwattr $C$DW$117, DW_AT_name("QUALPRD3")
    1683                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_QUALPRD3")
    1684                      .dwattr $C$DW$117, DW_AT_bit_offset(0x00)
    1685                      .dwattr $C$DW$117, DW_AT_bit_size(0x08)
    1686                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1687                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1688              
    1689                      .dwendtag $C$DW$T$31
    1690              
    1691              
    1692              $C$DW$T$32      .dwtag  DW_TAG_union_type
    1693                      .dwattr $C$DW$T$32, DW_AT_name("GPACTRL_REG")
    1694                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x02)
    1695              $C$DW$118       .dwtag  DW_TAG_member
    1696                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$21)
    1697                      .dwattr $C$DW$118, DW_AT_name("all")
    1698                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_all")
    1699                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1700                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1701              
    1702              $C$DW$119       .dwtag  DW_TAG_member
    1703                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$31)
    1704                      .dwattr $C$DW$119, DW_AT_name("bit")
    1705                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_bit")
    1706                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1707                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1708              
    1709                      .dwendtag $C$DW$T$32
    1710              
TMS320C2000 Assembler PC v15.12.1 Sun Feb 26 22:53:24 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_EPwm.asm                                                     PAGE   34

    1711              
    1712              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    1713                      .dwattr $C$DW$T$33, DW_AT_name("GPADIR_BITS")
    1714                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x02)
    1715              $C$DW$120       .dwtag  DW_TAG_member
    1716                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$19)
    1717                      .dwattr $C$DW$120, DW_AT_name("GPIO0")
    1718                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_GPIO0")
    1719                      .dwattr $C$DW$120, DW_AT_bit_offset(0x0f)
    1720                      .dwattr $C$DW$120, DW_AT_bit_size(0x01)
    1721                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1722                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1723              
    1724              $C$DW$121       .dwtag  DW_TAG_member
    1725                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$19)
    1726                      .dwattr $C$DW$121, DW_AT_name("GPIO1")
    1727                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_GPIO1")
    1728                      .dwattr $C$DW$121, DW_AT_bit_offset(0x0e)
    1729                      .dwattr $C$DW$121, DW_AT_bit_size(0x01)
    1730                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1731                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1732              
    1733              $C$DW$122       .dwtag  DW_TAG_member
    1734                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$19)
    1735                      .dwattr $C$DW$122, DW_AT_name("GPIO2")
    1736                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_GPIO2")
    1737                      .dwattr $C$DW$122, DW_AT_bit_offset(0x0d)
    1738                      .dwattr $C$DW$122, DW_AT_bit_size(0x01)
    1739                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1740                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1741              
    1742              $C$DW$123       .dwtag  DW_TAG_member
    1743                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$19)
    1744                      .dwattr $C$DW$123, DW_AT_name("GPIO3")
    1745                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_GPIO3")
    1746                      .dwattr $C$DW$123, DW_AT_bit_offset(0x0c)
    1747                      .dwattr $C$DW$123, DW_AT_bit_size(0x01)
    1748                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1749                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1750              
    1751              $C$DW$124       .dwtag  DW_TAG_member
    1752                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$19)
    1753                      .dwattr $C$DW$124, DW_AT_name("GPIO4")
    1754                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_GPIO4")
    1755                      .dwattr $C$DW$124, DW_AT_bit_offset(0x0b)
    1756                      .dwattr $C$DW$124, DW_AT_bit_size(0x01)
    1757                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1758                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1759              
    1760              $C$DW$125       .dwtag  DW_TAG_member
    1761                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$19)
    1762                      .dwattr $C$DW$125, DW_AT_name("GPIO5")
    1763                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_GPIO5")
    1764                      .dwattr $C$DW$125, DW_AT_bit_offset(0x0a)
    1765                      .dwattr $C$DW$125, DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v15.12.1 Sun Feb 26 22:53:24 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_EPwm.asm                                                     PAGE   35

    1766                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1767                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1768              
    1769              $C$DW$126       .dwtag  DW_TAG_member
    1770                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$19)
    1771                      .dwattr $C$DW$126, DW_AT_name("GPIO6")
    1772                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_GPIO6")
    1773                      .dwattr $C$DW$126, DW_AT_bit_offset(0x09)
    1774                      .dwattr $C$DW$126, DW_AT_bit_size(0x01)
    1775                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1776                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1777              
    1778              $C$DW$127       .dwtag  DW_TAG_member
    1779                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$19)
    1780                      .dwattr $C$DW$127, DW_AT_name("GPIO7")
    1781                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_GPIO7")
    1782                      .dwattr $C$DW$127, DW_AT_bit_offset(0x08)
    1783                      .dwattr $C$DW$127, DW_AT_bit_size(0x01)
    1784                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1785                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1786              
    1787              $C$DW$128       .dwtag  DW_TAG_member
    1788                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$19)
    1789                      .dwattr $C$DW$128, DW_AT_name("GPIO8")
    1790                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_GPIO8")
    1791                      .dwattr $C$DW$128, DW_AT_bit_offset(0x07)
    1792                      .dwattr $C$DW$128, DW_AT_bit_size(0x01)
    1793                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1794                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1795              
    1796              $C$DW$129       .dwtag  DW_TAG_member
    1797                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$19)
    1798                      .dwattr $C$DW$129, DW_AT_name("GPIO9")
    1799                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_GPIO9")
    1800                      .dwattr $C$DW$129, DW_AT_bit_offset(0x06)
    1801                      .dwattr $C$DW$129, DW_AT_bit_size(0x01)
    1802                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1803                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1804              
    1805              $C$DW$130       .dwtag  DW_TAG_member
    1806                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$19)
    1807                      .dwattr $C$DW$130, DW_AT_name("GPIO10")
    1808                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_GPIO10")
    1809                      .dwattr $C$DW$130, DW_AT_bit_offset(0x05)
    1810                      .dwattr $C$DW$130, DW_AT_bit_size(0x01)
    1811                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1812                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1813              
    1814              $C$DW$131       .dwtag  DW_TAG_member
    1815                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$19)
    1816                      .dwattr $C$DW$131, DW_AT_name("GPIO11")
    1817                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_GPIO11")
    1818                      .dwattr $C$DW$131, DW_AT_bit_offset(0x04)
    1819                      .dwattr $C$DW$131, DW_AT_bit_size(0x01)
    1820                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v15.12.1 Sun Feb 26 22:53:24 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_EPwm.asm                                                     PAGE   36

    1821                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1822              
    1823              $C$DW$132       .dwtag  DW_TAG_member
    1824                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$19)
    1825                      .dwattr $C$DW$132, DW_AT_name("GPIO12")
    1826                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_GPIO12")
    1827                      .dwattr $C$DW$132, DW_AT_bit_offset(0x03)
    1828                      .dwattr $C$DW$132, DW_AT_bit_size(0x01)
    1829                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1830                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1831              
    1832              $C$DW$133       .dwtag  DW_TAG_member
    1833                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$19)
    1834                      .dwattr $C$DW$133, DW_AT_name("GPIO13")
    1835                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_GPIO13")
    1836                      .dwattr $C$DW$133, DW_AT_bit_offset(0x02)
    1837                      .dwattr $C$DW$133, DW_AT_bit_size(0x01)
    1838                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1839                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1840              
    1841              $C$DW$134       .dwtag  DW_TAG_member
    1842                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$19)
    1843                      .dwattr $C$DW$134, DW_AT_name("GPIO14")
    1844                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_GPIO14")
    1845                      .dwattr $C$DW$134, DW_AT_bit_offset(0x01)
    1846                      .dwattr $C$DW$134, DW_AT_bit_size(0x01)
    1847                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1848                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1849              
    1850              $C$DW$135       .dwtag  DW_TAG_member
    1851                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$19)
    1852                      .dwattr $C$DW$135, DW_AT_name("GPIO15")
    1853                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_GPIO15")
    1854                      .dwattr $C$DW$135, DW_AT_bit_offset(0x00)
    1855                      .dwattr $C$DW$135, DW_AT_bit_size(0x01)
    1856                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1857                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1858              
    1859              $C$DW$136       .dwtag  DW_TAG_member
    1860                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$19)
    1861                      .dwattr $C$DW$136, DW_AT_name("GPIO16")
    1862                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_GPIO16")
    1863                      .dwattr $C$DW$136, DW_AT_bit_offset(0x0f)
    1864                      .dwattr $C$DW$136, DW_AT_bit_size(0x01)
    1865                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1866                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1867              
    1868              $C$DW$137       .dwtag  DW_TAG_member
    1869                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$19)
    1870                      .dwattr $C$DW$137, DW_AT_name("GPIO17")
    1871                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_GPIO17")
    1872                      .dwattr $C$DW$137, DW_AT_bit_offset(0x0e)
    1873                      .dwattr $C$DW$137, DW_AT_bit_size(0x01)
    1874                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1875                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.1 Sun Feb 26 22:53:24 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_EPwm.asm                                                     PAGE   37

    1876              
    1877              $C$DW$138       .dwtag  DW_TAG_member
    1878                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$19)
    1879                      .dwattr $C$DW$138, DW_AT_name("GPIO18")
    1880                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_GPIO18")
    1881                      .dwattr $C$DW$138, DW_AT_bit_offset(0x0d)
    1882                      .dwattr $C$DW$138, DW_AT_bit_size(0x01)
    1883                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1884                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1885              
    1886              $C$DW$139       .dwtag  DW_TAG_member
    1887                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$19)
    1888                      .dwattr $C$DW$139, DW_AT_name("GPIO19")
    1889                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_GPIO19")
    1890                      .dwattr $C$DW$139, DW_AT_bit_offset(0x0c)
    1891                      .dwattr $C$DW$139, DW_AT_bit_size(0x01)
    1892                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1893                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1894              
    1895              $C$DW$140       .dwtag  DW_TAG_member
    1896                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$19)
    1897                      .dwattr $C$DW$140, DW_AT_name("GPIO20")
    1898                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_GPIO20")
    1899                      .dwattr $C$DW$140, DW_AT_bit_offset(0x0b)
    1900                      .dwattr $C$DW$140, DW_AT_bit_size(0x01)
    1901                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1902                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1903              
    1904              $C$DW$141       .dwtag  DW_TAG_member
    1905                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$19)
    1906                      .dwattr $C$DW$141, DW_AT_name("GPIO21")
    1907                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_GPIO21")
    1908                      .dwattr $C$DW$141, DW_AT_bit_offset(0x0a)
    1909                      .dwattr $C$DW$141, DW_AT_bit_size(0x01)
    1910                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1911                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1912              
    1913              $C$DW$142       .dwtag  DW_TAG_member
    1914                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$19)
    1915                      .dwattr $C$DW$142, DW_AT_name("GPIO22")
    1916                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_GPIO22")
    1917                      .dwattr $C$DW$142, DW_AT_bit_offset(0x09)
    1918                      .dwattr $C$DW$142, DW_AT_bit_size(0x01)
    1919                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1920                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1921              
    1922              $C$DW$143       .dwtag  DW_TAG_member
    1923                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$19)
    1924                      .dwattr $C$DW$143, DW_AT_name("GPIO23")
    1925                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_GPIO23")
    1926                      .dwattr $C$DW$143, DW_AT_bit_offset(0x08)
    1927                      .dwattr $C$DW$143, DW_AT_bit_size(0x01)
    1928                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1929                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1930              
TMS320C2000 Assembler PC v15.12.1 Sun Feb 26 22:53:24 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_EPwm.asm                                                     PAGE   38

    1931              $C$DW$144       .dwtag  DW_TAG_member
    1932                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$19)
    1933                      .dwattr $C$DW$144, DW_AT_name("GPIO24")
    1934                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_GPIO24")
    1935                      .dwattr $C$DW$144, DW_AT_bit_offset(0x07)
    1936                      .dwattr $C$DW$144, DW_AT_bit_size(0x01)
    1937                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1938                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1939              
    1940              $C$DW$145       .dwtag  DW_TAG_member
    1941                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$19)
    1942                      .dwattr $C$DW$145, DW_AT_name("GPIO25")
    1943                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_GPIO25")
    1944                      .dwattr $C$DW$145, DW_AT_bit_offset(0x06)
    1945                      .dwattr $C$DW$145, DW_AT_bit_size(0x01)
    1946                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1947                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1948              
    1949              $C$DW$146       .dwtag  DW_TAG_member
    1950                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$19)
    1951                      .dwattr $C$DW$146, DW_AT_name("GPIO26")
    1952                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_GPIO26")
    1953                      .dwattr $C$DW$146, DW_AT_bit_offset(0x05)
    1954                      .dwattr $C$DW$146, DW_AT_bit_size(0x01)
    1955                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1956                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    1957              
    1958              $C$DW$147       .dwtag  DW_TAG_member
    1959                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$19)
    1960                      .dwattr $C$DW$147, DW_AT_name("GPIO27")
    1961                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_GPIO27")
    1962                      .dwattr $C$DW$147, DW_AT_bit_offset(0x04)
    1963                      .dwattr $C$DW$147, DW_AT_bit_size(0x01)
    1964                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1965                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    1966              
    1967              $C$DW$148       .dwtag  DW_TAG_member
    1968                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$19)
    1969                      .dwattr $C$DW$148, DW_AT_name("GPIO28")
    1970                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_GPIO28")
    1971                      .dwattr $C$DW$148, DW_AT_bit_offset(0x03)
    1972                      .dwattr $C$DW$148, DW_AT_bit_size(0x01)
    1973                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1974                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1975              
    1976              $C$DW$149       .dwtag  DW_TAG_member
    1977                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$19)
    1978                      .dwattr $C$DW$149, DW_AT_name("GPIO29")
    1979                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_GPIO29")
    1980                      .dwattr $C$DW$149, DW_AT_bit_offset(0x02)
    1981                      .dwattr $C$DW$149, DW_AT_bit_size(0x01)
    1982                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1983                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1984              
    1985              $C$DW$150       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v15.12.1 Sun Feb 26 22:53:24 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_EPwm.asm                                                     PAGE   39

    1986                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$19)
    1987                      .dwattr $C$DW$150, DW_AT_name("GPIO30")
    1988                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_GPIO30")
    1989                      .dwattr $C$DW$150, DW_AT_bit_offset(0x01)
    1990                      .dwattr $C$DW$150, DW_AT_bit_size(0x01)
    1991                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1992                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    1993              
    1994              $C$DW$151       .dwtag  DW_TAG_member
    1995                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$19)
    1996                      .dwattr $C$DW$151, DW_AT_name("GPIO31")
    1997                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_GPIO31")
    1998                      .dwattr $C$DW$151, DW_AT_bit_offset(0x00)
    1999                      .dwattr $C$DW$151, DW_AT_bit_size(0x01)
    2000                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2001                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    2002              
    2003                      .dwendtag $C$DW$T$33
    2004              
    2005              
    2006              $C$DW$T$34      .dwtag  DW_TAG_union_type
    2007                      .dwattr $C$DW$T$34, DW_AT_name("GPADIR_REG")
    2008                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x02)
    2009              $C$DW$152       .dwtag  DW_TAG_member
    2010                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$21)
    2011                      .dwattr $C$DW$152, DW_AT_name("all")
    2012                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_all")
    2013                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2014                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    2015              
    2016              $C$DW$153       .dwtag  DW_TAG_member
    2017                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$33)
    2018                      .dwattr $C$DW$153, DW_AT_name("bit")
    2019                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_bit")
    2020                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2021                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    2022              
    2023                      .dwendtag $C$DW$T$34
    2024              
    2025              
    2026              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    2027                      .dwattr $C$DW$T$35, DW_AT_name("GPAGMUX1_BITS")
    2028                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x02)
    2029              $C$DW$154       .dwtag  DW_TAG_member
    2030                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$19)
    2031                      .dwattr $C$DW$154, DW_AT_name("GPIO0")
    2032                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_GPIO0")
    2033                      .dwattr $C$DW$154, DW_AT_bit_offset(0x0e)
    2034                      .dwattr $C$DW$154, DW_AT_bit_size(0x02)
    2035                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2036                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    2037              
    2038              $C$DW$155       .dwtag  DW_TAG_member
    2039                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$19)
    2040                      .dwattr $C$DW$155, DW_AT_name("GPIO1")
TMS320C2000 Assembler PC v15.12.1 Sun Feb 26 22:53:24 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_EPwm.asm                                                     PAGE   40

    2041                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_GPIO1")
    2042                      .dwattr $C$DW$155, DW_AT_bit_offset(0x0c)
    2043                      .dwattr $C$DW$155, DW_AT_bit_size(0x02)
    2044                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2045                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    2046              
    2047              $C$DW$156       .dwtag  DW_TAG_member
    2048                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$19)
    2049                      .dwattr $C$DW$156, DW_AT_name("GPIO2")
    2050                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_GPIO2")
    2051                      .dwattr $C$DW$156, DW_AT_bit_offset(0x0a)
    2052                      .dwattr $C$DW$156, DW_AT_bit_size(0x02)
    2053                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2054                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    2055              
    2056              $C$DW$157       .dwtag  DW_TAG_member
    2057                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$19)
    2058                      .dwattr $C$DW$157, DW_AT_name("GPIO3")
    2059                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_GPIO3")
    2060                      .dwattr $C$DW$157, DW_AT_bit_offset(0x08)
    2061                      .dwattr $C$DW$157, DW_AT_bit_size(0x02)
    2062                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2063                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    2064              
    2065              $C$DW$158       .dwtag  DW_TAG_member
    2066                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$19)
    2067                      .dwattr $C$DW$158, DW_AT_name("GPIO4")
    2068                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_GPIO4")
    2069                      .dwattr $C$DW$158, DW_AT_bit_offset(0x06)
    2070                      .dwattr $C$DW$158, DW_AT_bit_size(0x02)
    2071                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2072                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    2073              
    2074              $C$DW$159       .dwtag  DW_TAG_member
    2075                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$19)
    2076                      .dwattr $C$DW$159, DW_AT_name("GPIO5")
    2077                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_GPIO5")
    2078                      .dwattr $C$DW$159, DW_AT_bit_offset(0x04)
    2079                      .dwattr $C$DW$159, DW_AT_bit_size(0x02)
    2080                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2081                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    2082              
    2083              $C$DW$160       .dwtag  DW_TAG_member
    2084                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$19)
    2085                      .dwattr $C$DW$160, DW_AT_name("GPIO6")
    2086                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_GPIO6")
    2087                      .dwattr $C$DW$160, DW_AT_bit_offset(0x02)
    2088                      .dwattr $C$DW$160, DW_AT_bit_size(0x02)
    2089                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2090                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    2091              
    2092              $C$DW$161       .dwtag  DW_TAG_member
    2093                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$19)
    2094                      .dwattr $C$DW$161, DW_AT_name("GPIO7")
    2095                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_GPIO7")
TMS320C2000 Assembler PC v15.12.1 Sun Feb 26 22:53:24 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_EPwm.asm                                                     PAGE   41

    2096                      .dwattr $C$DW$161, DW_AT_bit_offset(0x00)
    2097                      .dwattr $C$DW$161, DW_AT_bit_size(0x02)
    2098                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2099                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    2100              
    2101              $C$DW$162       .dwtag  DW_TAG_member
    2102                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$19)
    2103                      .dwattr $C$DW$162, DW_AT_name("GPIO8")
    2104                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_GPIO8")
    2105                      .dwattr $C$DW$162, DW_AT_bit_offset(0x0e)
    2106                      .dwattr $C$DW$162, DW_AT_bit_size(0x02)
    2107                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2108                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    2109              
    2110              $C$DW$163       .dwtag  DW_TAG_member
    2111                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$19)
    2112                      .dwattr $C$DW$163, DW_AT_name("GPIO9")
    2113                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_GPIO9")
    2114                      .dwattr $C$DW$163, DW_AT_bit_offset(0x0c)
    2115                      .dwattr $C$DW$163, DW_AT_bit_size(0x02)
    2116                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2117                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    2118              
    2119              $C$DW$164       .dwtag  DW_TAG_member
    2120                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$19)
    2121                      .dwattr $C$DW$164, DW_AT_name("GPIO10")
    2122                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_GPIO10")
    2123                      .dwattr $C$DW$164, DW_AT_bit_offset(0x0a)
    2124                      .dwattr $C$DW$164, DW_AT_bit_size(0x02)
    2125                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2126                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    2127              
    2128              $C$DW$165       .dwtag  DW_TAG_member
    2129                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$19)
    2130                      .dwattr $C$DW$165, DW_AT_name("GPIO11")
    2131                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_GPIO11")
    2132                      .dwattr $C$DW$165, DW_AT_bit_offset(0x08)
    2133                      .dwattr $C$DW$165, DW_AT_bit_size(0x02)
    2134                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2135                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    2136              
    2137              $C$DW$166       .dwtag  DW_TAG_member
    2138                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$19)
    2139                      .dwattr $C$DW$166, DW_AT_name("GPIO12")
    2140                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_GPIO12")
    2141                      .dwattr $C$DW$166, DW_AT_bit_offset(0x06)
    2142                      .dwattr $C$DW$166, DW_AT_bit_size(0x02)
    2143                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2144                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    2145              
    2146              $C$DW$167       .dwtag  DW_TAG_member
    2147                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$19)
    2148                      .dwattr $C$DW$167, DW_AT_name("GPIO13")
    2149                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_GPIO13")
    2150                      .dwattr $C$DW$167, DW_AT_bit_offset(0x04)
TMS320C2000 Assembler PC v15.12.1 Sun Feb 26 22:53:24 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_EPwm.asm                                                     PAGE   42

    2151                      .dwattr $C$DW$167, DW_AT_bit_size(0x02)
    2152                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2153                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    2154              
    2155              $C$DW$168       .dwtag  DW_TAG_member
    2156                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$19)
    2157                      .dwattr $C$DW$168, DW_AT_name("GPIO14")
    2158                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_GPIO14")
    2159                      .dwattr $C$DW$168, DW_AT_bit_offset(0x02)
    2160                      .dwattr $C$DW$168, DW_AT_bit_size(0x02)
    2161                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2162                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    2163              
    2164              $C$DW$169       .dwtag  DW_TAG_member
    2165                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$19)
    2166                      .dwattr $C$DW$169, DW_AT_name("GPIO15")
    2167                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_GPIO15")
    2168                      .dwattr $C$DW$169, DW_AT_bit_offset(0x00)
    2169                      .dwattr $C$DW$169, DW_AT_bit_size(0x02)
    2170                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2171                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    2172              
    2173                      .dwendtag $C$DW$T$35
    2174              
    2175              
    2176              $C$DW$T$36      .dwtag  DW_TAG_union_type
    2177                      .dwattr $C$DW$T$36, DW_AT_name("GPAGMUX1_REG")
    2178                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x02)
    2179              $C$DW$170       .dwtag  DW_TAG_member
    2180                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$21)
    2181                      .dwattr $C$DW$170, DW_AT_name("all")
    2182                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_all")
    2183                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2184                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    2185              
    2186              $C$DW$171       .dwtag  DW_TAG_member
    2187                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$35)
    2188                      .dwattr $C$DW$171, DW_AT_name("bit")
    2189                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_bit")
    2190                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2191                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    2192              
    2193                      .dwendtag $C$DW$T$36
    2194              
    2195              
    2196              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    2197                      .dwattr $C$DW$T$37, DW_AT_name("GPAGMUX2_BITS")
    2198                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x02)
    2199              $C$DW$172       .dwtag  DW_TAG_member
    2200                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$19)
    2201                      .dwattr $C$DW$172, DW_AT_name("GPIO16")
    2202                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_GPIO16")
    2203                      .dwattr $C$DW$172, DW_AT_bit_offset(0x0e)
    2204                      .dwattr $C$DW$172, DW_AT_bit_size(0x02)
    2205                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v15.12.1 Sun Feb 26 22:53:24 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_EPwm.asm                                                     PAGE   43

    2206                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    2207              
    2208              $C$DW$173       .dwtag  DW_TAG_member
    2209                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$19)
    2210                      .dwattr $C$DW$173, DW_AT_name("GPIO17")
    2211                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_GPIO17")
