TMS320C2000 Assembler PC v15.12.1 Sun Feb 26 22:53:23 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_Adc.asm                                                      PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                   PC v15.12.1.LTS *
       3              ;* Date/Time created: Sun Feb 26 22:53:23 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --cla_support=cla0 --float_support=fpu32 --hll_source=on --mem_model:cod
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/controlSUITE/device_support/F2837xD/v170/F2837xD_common/source/F2
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v15.12.1.LTS Copyright (c) 1996-201
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Keith\workspace_v6_1_3\IDDK_PM_Servo_F2837x-v2\F2837x_RAM"
      13              $C$DW$1 .dwtag  DW_TAG_variable
      14                      .dwattr $C$DW$1, DW_AT_name("AdccRegs")

     410 000000bd 3E67          LCR       *XAR7                 ; [CPU_] |126| 
     411                      ; call occurs [XAR7] ; [] |126| 
     412                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xD/v170/F2837xD_common/source/F2837xD_Adc.c",lin
     413 000000be 6F18          B         $C$L10,UNC            ; [CPU_] |127| 
     414                      ; branch occurs ; [] |127| 
     415 000000bf       $C$L8:    
     416                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xD/v170/F2837xD_common/source/F2837xD_Adc.c",lin
     417 000000bf 8F07          MOVL      XAR4,#459698          ; [CPU_U] |115| 
         000000c0 03B2 
     418 000000c1 88C4          MOVZ      AR6,*+XAR4[0]         ; [CPU_] |115| 
     419 000000c2 8F00          MOVL      XAR4,#65535           ; [CPU_U] |115| 
         000000c3 FFFF 
     420 000000c4 A8A9          MOVL      ACC,XAR4              ; [CPU_] |115| 
     421 000000c5 0FA6          CMPL      ACC,XAR6              ; [CPU_] |115| 
     422 000000c6 6110          B         $C$L10,EQ             ; [CPU_] |115| 
     423                      ; branchcc occurs ; [] |115| 
     424                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xD/v170/F2837xD_common/source/F2837xD_Adc.c",lin
     425 000000c7 76C7          MOVL      XAR7,#459698          ; [CPU_U] |117| 
         000000c8 03B2 
     426              $C$DW$20        .dwtag  DW_TAG_TI_branch
     427                      .dwattr $C$DW$20, DW_AT_low_pc(0x00)
     428                      .dwattr $C$DW$20, DW_AT_TI_call
     429                      .dwattr $C$DW$20, DW_AT_TI_indirect
     430              
     431 000000c9 3E67          LCR       *XAR7                 ; [CPU_] |117| 
     432                      ; call occurs [XAR7] ; [] |117| 
     433                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xD/v170/F2837xD_common/source/F2837xD_Adc.c",lin
     434 000000ca 6F0C          B         $C$L10,UNC            ; [CPU_] |118| 
     435                      ; branch occurs ; [] |118| 
     436 000000cb       $C$L9:    
     437                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xD/v170/F2837xD_common/source/F2837xD_Adc.c",lin
     438 000000cb 8F07          MOVL      XAR4,#459700          ; [CPU_U] |106| 
         000000cc 03B4 
     439 000000cd 88C4          MOVZ      AR6,*+XAR4[0]         ; [CPU_] |106| 
     440 000000ce 8F00          MOVL      XAR4,#65535           ; [CPU_U] |106| 
         000000cf FFFF 
     441 000000d0 A8A9          MOVL      ACC,XAR4              ; [CPU_] |106| 
     442 000000d1 0FA6          CMPL      ACC,XAR6              ; [CPU_] |106| 
TMS320C2000 Assembler PC v15.12.1 Sun Feb 26 22:53:23 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_Adc.asm                                                      PAGE   10

     443 000000d2 6104          B         $C$L10,EQ             ; [CPU_] |106| 
     444                      ; branchcc occurs ; [] |106| 
     445                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xD/v170/F2837xD_common/source/F2837xD_Adc.c",lin
     446 000000d3 76C7          MOVL      XAR7,#459700          ; [CPU_U] |108| 
         000000d4 03B4 
     447              $C$DW$21        .dwtag  DW_TAG_TI_branch
     448                      .dwattr $C$DW$21, DW_AT_low_pc(0x00)
     449                      .dwattr $C$DW$21, DW_AT_TI_call
     450                      .dwattr $C$DW$21, DW_AT_TI_indirect
     451              
     452 000000d5 3E67          LCR       *XAR7                 ; [CPU_] |108| 
     453                      ; call occurs [XAR7] ; [] |108| 
     454              $C$L10:    
     455              $C$DW$22        .dwtag  DW_TAG_TI_branch
     456                      .dwattr $C$DW$22, DW_AT_low_pc(0x00)
     457                      .dwattr $C$DW$22, DW_AT_TI_return
     458              
     459 000000d6 0006          LRETR     ; [CPU_] 
     460                      ; return occurs ; [] 
     461                      .dwattr $C$DW$16, DW_AT_TI_end_file("C:/ti/controlSUITE/device_support/F2837xD/v170/F2837xD_common/so
     462                      .dwattr $C$DW$16, DW_AT_TI_end_line(0x8e)
     463                      .dwattr $C$DW$16, DW_AT_TI_end_column(0x01)
     464                      .dwendentry
     465                      .dwendtag $C$DW$16
     466              
     467              ;**************************************************************
     468              ;* UNDEFINED EXTERNAL REFERENCES                              *
     469              ;**************************************************************
     470                      .global _AdccRegs
     471                      .global _AdcdRegs
     472                      .global _AdcaRegs
     473                      .global _AdcbRegs
     474              
     475              ;***************************************************************
     476              ;* TYPE INFORMATION                                            *
     477              ;***************************************************************
     478              
     479              $C$DW$T$20      .dwtag  DW_TAG_structure_type
     480                      .dwattr $C$DW$T$20, DW_AT_name("ADCBURSTCTL_BITS")
     481                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x01)
     482              $C$DW$23        .dwtag  DW_TAG_member
     483                      .dwattr $C$DW$23, DW_AT_type(*$C$DW$T$19)
     484                      .dwattr $C$DW$23, DW_AT_name("BURSTTRIGSEL")
     485                      .dwattr $C$DW$23, DW_AT_TI_symbol_name("_BURSTTRIGSEL")
     486                      .dwattr $C$DW$23, DW_AT_bit_offset(0x0a)
     487                      .dwattr $C$DW$23, DW_AT_bit_size(0x06)
     488                      .dwattr $C$DW$23, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     489                      .dwattr $C$DW$23, DW_AT_accessibility(DW_ACCESS_public)
     490              
     491              $C$DW$24        .dwtag  DW_TAG_member
     492                      .dwattr $C$DW$24, DW_AT_type(*$C$DW$T$19)
     493                      .dwattr $C$DW$24, DW_AT_name("rsvd1")
     494                      .dwattr $C$DW$24, DW_AT_TI_symbol_name("_rsvd1")
     495                      .dwattr $C$DW$24, DW_AT_bit_offset(0x08)
     496                      .dwattr $C$DW$24, DW_AT_bit_size(0x02)
TMS320C2000 Assembler PC v15.12.1 Sun Feb 26 22:53:23 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_Adc.asm                                                      PAGE   11

     497                      .dwattr $C$DW$24, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     498                      .dwattr $C$DW$24, DW_AT_accessibility(DW_ACCESS_public)
     499              
     500              $C$DW$25        .dwtag  DW_TAG_member
     501                      .dwattr $C$DW$25, DW_AT_type(*$C$DW$T$19)
     502                      .dwattr $C$DW$25, DW_AT_name("BURSTSIZE")
     503                      .dwattr $C$DW$25, DW_AT_TI_symbol_name("_BURSTSIZE")
     504                      .dwattr $C$DW$25, DW_AT_bit_offset(0x04)
     505                      .dwattr $C$DW$25, DW_AT_bit_size(0x04)
     506                      .dwattr $C$DW$25, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     507                      .dwattr $C$DW$25, DW_AT_accessibility(DW_ACCESS_public)
     508              
     509              $C$DW$26        .dwtag  DW_TAG_member
     510                      .dwattr $C$DW$26, DW_AT_type(*$C$DW$T$19)
     511                      .dwattr $C$DW$26, DW_AT_name("rsvd2")
     512                      .dwattr $C$DW$26, DW_AT_TI_symbol_name("_rsvd2")
     513                      .dwattr $C$DW$26, DW_AT_bit_offset(0x01)
     514                      .dwattr $C$DW$26, DW_AT_bit_size(0x03)
     515                      .dwattr $C$DW$26, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     516                      .dwattr $C$DW$26, DW_AT_accessibility(DW_ACCESS_public)
     517              
     518              $C$DW$27        .dwtag  DW_TAG_member
     519                      .dwattr $C$DW$27, DW_AT_type(*$C$DW$T$19)
     520                      .dwattr $C$DW$27, DW_AT_name("BURSTEN")
     521                      .dwattr $C$DW$27, DW_AT_TI_symbol_name("_BURSTEN")
     522                      .dwattr $C$DW$27, DW_AT_bit_offset(0x00)
     523                      .dwattr $C$DW$27, DW_AT_bit_size(0x01)
     524                      .dwattr $C$DW$27, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     525                      .dwattr $C$DW$27, DW_AT_accessibility(DW_ACCESS_public)
     526              
     527                      .dwendtag $C$DW$T$20
     528              
     529              
     530              $C$DW$T$21      .dwtag  DW_TAG_union_type
     531                      .dwattr $C$DW$T$21, DW_AT_name("ADCBURSTCTL_REG")
     532                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x01)
     533              $C$DW$28        .dwtag  DW_TAG_member
     534                      .dwattr $C$DW$28, DW_AT_type(*$C$DW$T$19)
     535                      .dwattr $C$DW$28, DW_AT_name("all")
     536                      .dwattr $C$DW$28, DW_AT_TI_symbol_name("_all")
     537                      .dwattr $C$DW$28, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     538                      .dwattr $C$DW$28, DW_AT_accessibility(DW_ACCESS_public)
     539              
     540              $C$DW$29        .dwtag  DW_TAG_member
     541                      .dwattr $C$DW$29, DW_AT_type(*$C$DW$T$20)
     542                      .dwattr $C$DW$29, DW_AT_name("bit")
     543                      .dwattr $C$DW$29, DW_AT_TI_symbol_name("_bit")
     544                      .dwattr $C$DW$29, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     545                      .dwattr $C$DW$29, DW_AT_accessibility(DW_ACCESS_public)
     546              
     547                      .dwendtag $C$DW$T$21
     548              
     549              
     550              $C$DW$T$22      .dwtag  DW_TAG_structure_type
     551                      .dwattr $C$DW$T$22, DW_AT_name("ADCCOUNTER_BITS")
TMS320C2000 Assembler PC v15.12.1 Sun Feb 26 22:53:23 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_Adc.asm                                                      PAGE   12

     552                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x01)
     553              $C$DW$30        .dwtag  DW_TAG_member
     554                      .dwattr $C$DW$30, DW_AT_type(*$C$DW$T$19)
     555                      .dwattr $C$DW$30, DW_AT_name("FREECOUNT")
     556                      .dwattr $C$DW$30, DW_AT_TI_symbol_name("_FREECOUNT")
     557                      .dwattr $C$DW$30, DW_AT_bit_offset(0x04)
     558                      .dwattr $C$DW$30, DW_AT_bit_size(0x0c)
     559                      .dwattr $C$DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     560                      .dwattr $C$DW$30, DW_AT_accessibility(DW_ACCESS_public)
     561              
     562              $C$DW$31        .dwtag  DW_TAG_member
     563                      .dwattr $C$DW$31, DW_AT_type(*$C$DW$T$19)
     564                      .dwattr $C$DW$31, DW_AT_name("rsvd1")
     565                      .dwattr $C$DW$31, DW_AT_TI_symbol_name("_rsvd1")
     566                      .dwattr $C$DW$31, DW_AT_bit_offset(0x00)
     567                      .dwattr $C$DW$31, DW_AT_bit_size(0x04)
     568                      .dwattr $C$DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     569                      .dwattr $C$DW$31, DW_AT_accessibility(DW_ACCESS_public)
     570              
     571                      .dwendtag $C$DW$T$22
     572              
     573              
     574              $C$DW$T$23      .dwtag  DW_TAG_union_type
     575                      .dwattr $C$DW$T$23, DW_AT_name("ADCCOUNTER_REG")
     576                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x01)
     577              $C$DW$32        .dwtag  DW_TAG_member
     578                      .dwattr $C$DW$32, DW_AT_type(*$C$DW$T$19)
     579                      .dwattr $C$DW$32, DW_AT_name("all")
     580                      .dwattr $C$DW$32, DW_AT_TI_symbol_name("_all")
     581                      .dwattr $C$DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     582                      .dwattr $C$DW$32, DW_AT_accessibility(DW_ACCESS_public)
     583              
     584              $C$DW$33        .dwtag  DW_TAG_member
     585                      .dwattr $C$DW$33, DW_AT_type(*$C$DW$T$22)
     586                      .dwattr $C$DW$33, DW_AT_name("bit")
     587                      .dwattr $C$DW$33, DW_AT_TI_symbol_name("_bit")
     588                      .dwattr $C$DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     589                      .dwattr $C$DW$33, DW_AT_accessibility(DW_ACCESS_public)
     590              
     591                      .dwendtag $C$DW$T$23
     592              
     593              
     594              $C$DW$T$24      .dwtag  DW_TAG_structure_type
     595                      .dwattr $C$DW$T$24, DW_AT_name("ADCCTL1_BITS")
     596                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x01)
     597              $C$DW$34        .dwtag  DW_TAG_member
     598                      .dwattr $C$DW$34, DW_AT_type(*$C$DW$T$19)
     599                      .dwattr $C$DW$34, DW_AT_name("rsvd1")
     600                      .dwattr $C$DW$34, DW_AT_TI_symbol_name("_rsvd1")
     601                      .dwattr $C$DW$34, DW_AT_bit_offset(0x0e)
     602                      .dwattr $C$DW$34, DW_AT_bit_size(0x02)
     603                      .dwattr $C$DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     604                      .dwattr $C$DW$34, DW_AT_accessibility(DW_ACCESS_public)
     605              
     606              $C$DW$35        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v15.12.1 Sun Feb 26 22:53:23 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_Adc.asm                                                      PAGE   13

     607                      .dwattr $C$DW$35, DW_AT_type(*$C$DW$T$19)
     608                      .dwattr $C$DW$35, DW_AT_name("INTPULSEPOS")
     609                      .dwattr $C$DW$35, DW_AT_TI_symbol_name("_INTPULSEPOS")
     610                      .dwattr $C$DW$35, DW_AT_bit_offset(0x0d)
     611                      .dwattr $C$DW$35, DW_AT_bit_size(0x01)
     612                      .dwattr $C$DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     613                      .dwattr $C$DW$35, DW_AT_accessibility(DW_ACCESS_public)
     614              
     615              $C$DW$36        .dwtag  DW_TAG_member
     616                      .dwattr $C$DW$36, DW_AT_type(*$C$DW$T$19)
     617                      .dwattr $C$DW$36, DW_AT_name("rsvd2")
     618                      .dwattr $C$DW$36, DW_AT_TI_symbol_name("_rsvd2")
     619                      .dwattr $C$DW$36, DW_AT_bit_offset(0x09)
     620                      .dwattr $C$DW$36, DW_AT_bit_size(0x04)
     621                      .dwattr $C$DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     622                      .dwattr $C$DW$36, DW_AT_accessibility(DW_ACCESS_public)
     623              
     624              $C$DW$37        .dwtag  DW_TAG_member
     625                      .dwattr $C$DW$37, DW_AT_type(*$C$DW$T$19)
     626                      .dwattr $C$DW$37, DW_AT_name("ADCPWDNZ")
     627                      .dwattr $C$DW$37, DW_AT_TI_symbol_name("_ADCPWDNZ")
     628                      .dwattr $C$DW$37, DW_AT_bit_offset(0x08)
     629                      .dwattr $C$DW$37, DW_AT_bit_size(0x01)
     630                      .dwattr $C$DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     631                      .dwattr $C$DW$37, DW_AT_accessibility(DW_ACCESS_public)
     632              
     633              $C$DW$38        .dwtag  DW_TAG_member
     634                      .dwattr $C$DW$38, DW_AT_type(*$C$DW$T$19)
     635                      .dwattr $C$DW$38, DW_AT_name("ADCBSYCHN")
     636                      .dwattr $C$DW$38, DW_AT_TI_symbol_name("_ADCBSYCHN")
     637                      .dwattr $C$DW$38, DW_AT_bit_offset(0x04)
     638                      .dwattr $C$DW$38, DW_AT_bit_size(0x04)
     639                      .dwattr $C$DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     640                      .dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)
     641              
     642              $C$DW$39        .dwtag  DW_TAG_member
     643                      .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$19)
     644                      .dwattr $C$DW$39, DW_AT_name("rsvd3")
     645                      .dwattr $C$DW$39, DW_AT_TI_symbol_name("_rsvd3")
     646                      .dwattr $C$DW$39, DW_AT_bit_offset(0x03)
     647                      .dwattr $C$DW$39, DW_AT_bit_size(0x01)
     648                      .dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     649                      .dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
     650              
     651              $C$DW$40        .dwtag  DW_TAG_member
     652                      .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$19)
     653                      .dwattr $C$DW$40, DW_AT_name("ADCBSY")
     654                      .dwattr $C$DW$40, DW_AT_TI_symbol_name("_ADCBSY")
     655                      .dwattr $C$DW$40, DW_AT_bit_offset(0x02)
     656                      .dwattr $C$DW$40, DW_AT_bit_size(0x01)
     657                      .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     658                      .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
     659              
     660              $C$DW$41        .dwtag  DW_TAG_member
     661                      .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v15.12.1 Sun Feb 26 22:53:23 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_Adc.asm                                                      PAGE   14

     662                      .dwattr $C$DW$41, DW_AT_name("rsvd4")
     663                      .dwattr $C$DW$41, DW_AT_TI_symbol_name("_rsvd4")
     664                      .dwattr $C$DW$41, DW_AT_bit_offset(0x00)
     665                      .dwattr $C$DW$41, DW_AT_bit_size(0x02)
     666                      .dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     667                      .dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
     668              
     669                      .dwendtag $C$DW$T$24
     670              
     671              
     672              $C$DW$T$25      .dwtag  DW_TAG_union_type
     673                      .dwattr $C$DW$T$25, DW_AT_name("ADCCTL1_REG")
     674                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x01)
     675              $C$DW$42        .dwtag  DW_TAG_member
     676                      .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$19)
     677                      .dwattr $C$DW$42, DW_AT_name("all")
     678                      .dwattr $C$DW$42, DW_AT_TI_symbol_name("_all")
     679                      .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     680                      .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
     681              
     682              $C$DW$43        .dwtag  DW_TAG_member
     683                      .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$24)
     684                      .dwattr $C$DW$43, DW_AT_name("bit")
     685                      .dwattr $C$DW$43, DW_AT_TI_symbol_name("_bit")
     686                      .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     687                      .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
     688              
     689                      .dwendtag $C$DW$T$25
     690              
     691              
     692              $C$DW$T$26      .dwtag  DW_TAG_structure_type
     693                      .dwattr $C$DW$T$26, DW_AT_name("ADCCTL2_BITS")
     694                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x01)
     695              $C$DW$44        .dwtag  DW_TAG_member
     696                      .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$19)
     697                      .dwattr $C$DW$44, DW_AT_name("PRESCALE")
     698                      .dwattr $C$DW$44, DW_AT_TI_symbol_name("_PRESCALE")
     699                      .dwattr $C$DW$44, DW_AT_bit_offset(0x0c)
     700                      .dwattr $C$DW$44, DW_AT_bit_size(0x04)
     701                      .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     702                      .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
     703              
     704              $C$DW$45        .dwtag  DW_TAG_member
     705                      .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$19)
     706                      .dwattr $C$DW$45, DW_AT_name("rsvd1")
     707                      .dwattr $C$DW$45, DW_AT_TI_symbol_name("_rsvd1")
     708                      .dwattr $C$DW$45, DW_AT_bit_offset(0x0a)
     709                      .dwattr $C$DW$45, DW_AT_bit_size(0x02)
     710                      .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     711                      .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
     712              
     713              $C$DW$46        .dwtag  DW_TAG_member
     714                      .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$19)
     715                      .dwattr $C$DW$46, DW_AT_name("RESOLUTION")
     716                      .dwattr $C$DW$46, DW_AT_TI_symbol_name("_RESOLUTION")
TMS320C2000 Assembler PC v15.12.1 Sun Feb 26 22:53:23 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_Adc.asm                                                      PAGE   15

     717                      .dwattr $C$DW$46, DW_AT_bit_offset(0x09)
     718                      .dwattr $C$DW$46, DW_AT_bit_size(0x01)
     719                      .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     720                      .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
     721              
     722              $C$DW$47        .dwtag  DW_TAG_member
     723                      .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$19)
     724                      .dwattr $C$DW$47, DW_AT_name("SIGNALMODE")
     725                      .dwattr $C$DW$47, DW_AT_TI_symbol_name("_SIGNALMODE")
     726                      .dwattr $C$DW$47, DW_AT_bit_offset(0x08)
     727                      .dwattr $C$DW$47, DW_AT_bit_size(0x01)
     728                      .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     729                      .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
     730              
     731              $C$DW$48        .dwtag  DW_TAG_member
     732                      .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$19)
     733                      .dwattr $C$DW$48, DW_AT_name("rsvd2")
     734                      .dwattr $C$DW$48, DW_AT_TI_symbol_name("_rsvd2")
     735                      .dwattr $C$DW$48, DW_AT_bit_offset(0x03)
     736                      .dwattr $C$DW$48, DW_AT_bit_size(0x05)
     737                      .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     738                      .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     739              
     740              $C$DW$49        .dwtag  DW_TAG_member
     741                      .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$19)
     742                      .dwattr $C$DW$49, DW_AT_name("rsvd3")
     743                      .dwattr $C$DW$49, DW_AT_TI_symbol_name("_rsvd3")
     744                      .dwattr $C$DW$49, DW_AT_bit_offset(0x00)
     745                      .dwattr $C$DW$49, DW_AT_bit_size(0x03)
     746                      .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     747                      .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
     748              
     749                      .dwendtag $C$DW$T$26
     750              
     751              
     752              $C$DW$T$27      .dwtag  DW_TAG_union_type
     753                      .dwattr $C$DW$T$27, DW_AT_name("ADCCTL2_REG")
     754                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x01)
     755              $C$DW$50        .dwtag  DW_TAG_member
     756                      .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$19)
     757                      .dwattr $C$DW$50, DW_AT_name("all")
     758                      .dwattr $C$DW$50, DW_AT_TI_symbol_name("_all")
     759                      .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     760                      .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     761              
     762              $C$DW$51        .dwtag  DW_TAG_member
     763                      .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$26)
     764                      .dwattr $C$DW$51, DW_AT_name("bit")
     765                      .dwattr $C$DW$51, DW_AT_TI_symbol_name("_bit")
     766                      .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     767                      .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
     768              
     769                      .dwendtag $C$DW$T$27
     770              
     771              
TMS320C2000 Assembler PC v15.12.1 Sun Feb 26 22:53:23 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_Adc.asm                                                      PAGE   16

     772              $C$DW$T$28      .dwtag  DW_TAG_structure_type
     773                      .dwattr $C$DW$T$28, DW_AT_name("ADCEVTCLR_BITS")
     774                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x01)
     775              $C$DW$52        .dwtag  DW_TAG_member
     776                      .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$19)
     777                      .dwattr $C$DW$52, DW_AT_name("PPB1TRIPHI")
     778                      .dwattr $C$DW$52, DW_AT_TI_symbol_name("_PPB1TRIPHI")
     779                      .dwattr $C$DW$52, DW_AT_bit_offset(0x0f)
     780                      .dwattr $C$DW$52, DW_AT_bit_size(0x01)
     781                      .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     782                      .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     783              
     784              $C$DW$53        .dwtag  DW_TAG_member
     785                      .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$19)
     786                      .dwattr $C$DW$53, DW_AT_name("PPB1TRIPLO")
     787                      .dwattr $C$DW$53, DW_AT_TI_symbol_name("_PPB1TRIPLO")
     788                      .dwattr $C$DW$53, DW_AT_bit_offset(0x0e)
     789                      .dwattr $C$DW$53, DW_AT_bit_size(0x01)
     790                      .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     791                      .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     792              
     793              $C$DW$54        .dwtag  DW_TAG_member
     794                      .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$19)
     795                      .dwattr $C$DW$54, DW_AT_name("PPB1ZERO")
     796                      .dwattr $C$DW$54, DW_AT_TI_symbol_name("_PPB1ZERO")
     797                      .dwattr $C$DW$54, DW_AT_bit_offset(0x0d)
     798                      .dwattr $C$DW$54, DW_AT_bit_size(0x01)
     799                      .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     800                      .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     801              
     802              $C$DW$55        .dwtag  DW_TAG_member
     803                      .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$19)
     804                      .dwattr $C$DW$55, DW_AT_name("rsvd1")
     805                      .dwattr $C$DW$55, DW_AT_TI_symbol_name("_rsvd1")
     806                      .dwattr $C$DW$55, DW_AT_bit_offset(0x0c)
     807                      .dwattr $C$DW$55, DW_AT_bit_size(0x01)
     808                      .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     809                      .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     810              
     811              $C$DW$56        .dwtag  DW_TAG_member
     812                      .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$19)
     813                      .dwattr $C$DW$56, DW_AT_name("PPB2TRIPHI")
     814                      .dwattr $C$DW$56, DW_AT_TI_symbol_name("_PPB2TRIPHI")
     815                      .dwattr $C$DW$56, DW_AT_bit_offset(0x0b)
     816                      .dwattr $C$DW$56, DW_AT_bit_size(0x01)
     817                      .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     818                      .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     819              
     820              $C$DW$57        .dwtag  DW_TAG_member
     821                      .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$19)
     822                      .dwattr $C$DW$57, DW_AT_name("PPB2TRIPLO")
     823                      .dwattr $C$DW$57, DW_AT_TI_symbol_name("_PPB2TRIPLO")
     824                      .dwattr $C$DW$57, DW_AT_bit_offset(0x0a)
     825                      .dwattr $C$DW$57, DW_AT_bit_size(0x01)
     826                      .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v15.12.1 Sun Feb 26 22:53:23 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_Adc.asm                                                      PAGE   17

     827                      .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
     828              
     829              $C$DW$58        .dwtag  DW_TAG_member
     830                      .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$19)
     831                      .dwattr $C$DW$58, DW_AT_name("PPB2ZERO")
     832                      .dwattr $C$DW$58, DW_AT_TI_symbol_name("_PPB2ZERO")
     833                      .dwattr $C$DW$58, DW_AT_bit_offset(0x09)
     834                      .dwattr $C$DW$58, DW_AT_bit_size(0x01)
     835                      .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     836                      .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
     837              
     838              $C$DW$59        .dwtag  DW_TAG_member
     839                      .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$19)
     840                      .dwattr $C$DW$59, DW_AT_name("rsvd2")
     841                      .dwattr $C$DW$59, DW_AT_TI_symbol_name("_rsvd2")
     842                      .dwattr $C$DW$59, DW_AT_bit_offset(0x08)
     843                      .dwattr $C$DW$59, DW_AT_bit_size(0x01)
     844                      .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     845                      .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
     846              
     847              $C$DW$60        .dwtag  DW_TAG_member
     848                      .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$19)
     849                      .dwattr $C$DW$60, DW_AT_name("PPB3TRIPHI")
     850                      .dwattr $C$DW$60, DW_AT_TI_symbol_name("_PPB3TRIPHI")
     851                      .dwattr $C$DW$60, DW_AT_bit_offset(0x07)
     852                      .dwattr $C$DW$60, DW_AT_bit_size(0x01)
     853                      .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     854                      .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
     855              
     856              $C$DW$61        .dwtag  DW_TAG_member
     857                      .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$19)
     858                      .dwattr $C$DW$61, DW_AT_name("PPB3TRIPLO")
     859                      .dwattr $C$DW$61, DW_AT_TI_symbol_name("_PPB3TRIPLO")
     860                      .dwattr $C$DW$61, DW_AT_bit_offset(0x06)
     861                      .dwattr $C$DW$61, DW_AT_bit_size(0x01)
     862                      .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     863                      .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
     864              
     865              $C$DW$62        .dwtag  DW_TAG_member
     866                      .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$19)
     867                      .dwattr $C$DW$62, DW_AT_name("PPB3ZERO")
     868                      .dwattr $C$DW$62, DW_AT_TI_symbol_name("_PPB3ZERO")
     869                      .dwattr $C$DW$62, DW_AT_bit_offset(0x05)
     870                      .dwattr $C$DW$62, DW_AT_bit_size(0x01)
     871                      .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     872                      .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
     873              
     874              $C$DW$63        .dwtag  DW_TAG_member
     875                      .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$19)
     876                      .dwattr $C$DW$63, DW_AT_name("rsvd3")
     877                      .dwattr $C$DW$63, DW_AT_TI_symbol_name("_rsvd3")
     878                      .dwattr $C$DW$63, DW_AT_bit_offset(0x04)
     879                      .dwattr $C$DW$63, DW_AT_bit_size(0x01)
     880                      .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     881                      .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.1 Sun Feb 26 22:53:23 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_Adc.asm                                                      PAGE   18

     882              
     883              $C$DW$64        .dwtag  DW_TAG_member
     884                      .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$19)
     885                      .dwattr $C$DW$64, DW_AT_name("PPB4TRIPHI")
     886                      .dwattr $C$DW$64, DW_AT_TI_symbol_name("_PPB4TRIPHI")
     887                      .dwattr $C$DW$64, DW_AT_bit_offset(0x03)
     888                      .dwattr $C$DW$64, DW_AT_bit_size(0x01)
     889                      .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     890                      .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
     891              
     892              $C$DW$65        .dwtag  DW_TAG_member
     893                      .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$19)
     894                      .dwattr $C$DW$65, DW_AT_name("PPB4TRIPLO")
     895                      .dwattr $C$DW$65, DW_AT_TI_symbol_name("_PPB4TRIPLO")
     896                      .dwattr $C$DW$65, DW_AT_bit_offset(0x02)
     897                      .dwattr $C$DW$65, DW_AT_bit_size(0x01)
     898                      .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     899                      .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
     900              
     901              $C$DW$66        .dwtag  DW_TAG_member
     902                      .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$19)
     903                      .dwattr $C$DW$66, DW_AT_name("PPB4ZERO")
     904                      .dwattr $C$DW$66, DW_AT_TI_symbol_name("_PPB4ZERO")
     905                      .dwattr $C$DW$66, DW_AT_bit_offset(0x01)
     906                      .dwattr $C$DW$66, DW_AT_bit_size(0x01)
     907                      .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     908                      .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
     909              
     910              $C$DW$67        .dwtag  DW_TAG_member
     911                      .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$19)
     912                      .dwattr $C$DW$67, DW_AT_name("rsvd4")
     913                      .dwattr $C$DW$67, DW_AT_TI_symbol_name("_rsvd4")
     914                      .dwattr $C$DW$67, DW_AT_bit_offset(0x00)
     915                      .dwattr $C$DW$67, DW_AT_bit_size(0x01)
     916                      .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     917                      .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
     918              
     919                      .dwendtag $C$DW$T$28
     920              
     921              
     922              $C$DW$T$29      .dwtag  DW_TAG_union_type
     923                      .dwattr $C$DW$T$29, DW_AT_name("ADCEVTCLR_REG")
     924                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x01)
     925              $C$DW$68        .dwtag  DW_TAG_member
     926                      .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$19)
     927                      .dwattr $C$DW$68, DW_AT_name("all")
     928                      .dwattr $C$DW$68, DW_AT_TI_symbol_name("_all")
     929                      .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     930                      .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
     931              
     932              $C$DW$69        .dwtag  DW_TAG_member
     933                      .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$28)
     934                      .dwattr $C$DW$69, DW_AT_name("bit")
     935                      .dwattr $C$DW$69, DW_AT_TI_symbol_name("_bit")
     936                      .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v15.12.1 Sun Feb 26 22:53:23 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_Adc.asm                                                      PAGE   19

     937                      .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
     938              
     939                      .dwendtag $C$DW$T$29
     940              
     941              
     942              $C$DW$T$30      .dwtag  DW_TAG_structure_type
     943                      .dwattr $C$DW$T$30, DW_AT_name("ADCEVTINTSEL_BITS")
     944                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x01)
     945              $C$DW$70        .dwtag  DW_TAG_member
     946                      .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$19)
     947                      .dwattr $C$DW$70, DW_AT_name("PPB1TRIPHI")
     948                      .dwattr $C$DW$70, DW_AT_TI_symbol_name("_PPB1TRIPHI")
     949                      .dwattr $C$DW$70, DW_AT_bit_offset(0x0f)
     950                      .dwattr $C$DW$70, DW_AT_bit_size(0x01)
     951                      .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     952                      .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
     953              
     954              $C$DW$71        .dwtag  DW_TAG_member
     955                      .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$19)
     956                      .dwattr $C$DW$71, DW_AT_name("PPB1TRIPLO")
     957                      .dwattr $C$DW$71, DW_AT_TI_symbol_name("_PPB1TRIPLO")
     958                      .dwattr $C$DW$71, DW_AT_bit_offset(0x0e)
     959                      .dwattr $C$DW$71, DW_AT_bit_size(0x01)
     960                      .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     961                      .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
     962              
     963              $C$DW$72        .dwtag  DW_TAG_member
     964                      .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$19)
     965                      .dwattr $C$DW$72, DW_AT_name("PPB1ZERO")
     966                      .dwattr $C$DW$72, DW_AT_TI_symbol_name("_PPB1ZERO")
     967                      .dwattr $C$DW$72, DW_AT_bit_offset(0x0d)
     968                      .dwattr $C$DW$72, DW_AT_bit_size(0x01)
     969                      .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     970                      .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
     971              
     972              $C$DW$73        .dwtag  DW_TAG_member
     973                      .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$19)
     974                      .dwattr $C$DW$73, DW_AT_name("rsvd1")
     975                      .dwattr $C$DW$73, DW_AT_TI_symbol_name("_rsvd1")
     976                      .dwattr $C$DW$73, DW_AT_bit_offset(0x0c)
     977                      .dwattr $C$DW$73, DW_AT_bit_size(0x01)
     978                      .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     979                      .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
     980              
     981              $C$DW$74        .dwtag  DW_TAG_member
     982                      .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$19)
     983                      .dwattr $C$DW$74, DW_AT_name("PPB2TRIPHI")
     984                      .dwattr $C$DW$74, DW_AT_TI_symbol_name("_PPB2TRIPHI")
     985                      .dwattr $C$DW$74, DW_AT_bit_offset(0x0b)
     986                      .dwattr $C$DW$74, DW_AT_bit_size(0x01)
     987                      .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     988                      .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
     989              
     990              $C$DW$75        .dwtag  DW_TAG_member
     991                      .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v15.12.1 Sun Feb 26 22:53:23 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_Adc.asm                                                      PAGE   20

     992                      .dwattr $C$DW$75, DW_AT_name("PPB2TRIPLO")
     993                      .dwattr $C$DW$75, DW_AT_TI_symbol_name("_PPB2TRIPLO")
     994                      .dwattr $C$DW$75, DW_AT_bit_offset(0x0a)
     995                      .dwattr $C$DW$75, DW_AT_bit_size(0x01)
     996                      .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     997                      .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
     998              
     999              $C$DW$76        .dwtag  DW_TAG_member
    1000                      .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$19)
    1001                      .dwattr $C$DW$76, DW_AT_name("PPB2ZERO")
    1002                      .dwattr $C$DW$76, DW_AT_TI_symbol_name("_PPB2ZERO")
    1003                      .dwattr $C$DW$76, DW_AT_bit_offset(0x09)
    1004                      .dwattr $C$DW$76, DW_AT_bit_size(0x01)
    1005                      .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1006                      .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
    1007              
    1008              $C$DW$77        .dwtag  DW_TAG_member
    1009                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$19)
    1010                      .dwattr $C$DW$77, DW_AT_name("rsvd2")
    1011                      .dwattr $C$DW$77, DW_AT_TI_symbol_name("_rsvd2")
    1012                      .dwattr $C$DW$77, DW_AT_bit_offset(0x08)
    1013                      .dwattr $C$DW$77, DW_AT_bit_size(0x01)
    1014                      .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1015                      .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
    1016              
    1017              $C$DW$78        .dwtag  DW_TAG_member
    1018                      .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$19)
    1019                      .dwattr $C$DW$78, DW_AT_name("PPB3TRIPHI")
    1020                      .dwattr $C$DW$78, DW_AT_TI_symbol_name("_PPB3TRIPHI")
    1021                      .dwattr $C$DW$78, DW_AT_bit_offset(0x07)
    1022                      .dwattr $C$DW$78, DW_AT_bit_size(0x01)
    1023                      .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1024                      .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
    1025              
    1026              $C$DW$79        .dwtag  DW_TAG_member
    1027                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$19)
    1028                      .dwattr $C$DW$79, DW_AT_name("PPB3TRIPLO")
    1029                      .dwattr $C$DW$79, DW_AT_TI_symbol_name("_PPB3TRIPLO")
    1030                      .dwattr $C$DW$79, DW_AT_bit_offset(0x06)
    1031                      .dwattr $C$DW$79, DW_AT_bit_size(0x01)
    1032                      .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1033                      .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    1034              
    1035              $C$DW$80        .dwtag  DW_TAG_member
    1036                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$19)
    1037                      .dwattr $C$DW$80, DW_AT_name("PPB3ZERO")
    1038                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_PPB3ZERO")
    1039                      .dwattr $C$DW$80, DW_AT_bit_offset(0x05)
    1040                      .dwattr $C$DW$80, DW_AT_bit_size(0x01)
    1041                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1042                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    1043              
    1044              $C$DW$81        .dwtag  DW_TAG_member
    1045                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$19)
    1046                      .dwattr $C$DW$81, DW_AT_name("rsvd3")
TMS320C2000 Assembler PC v15.12.1 Sun Feb 26 22:53:23 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_Adc.asm                                                      PAGE   21

    1047                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_rsvd3")
    1048                      .dwattr $C$DW$81, DW_AT_bit_offset(0x04)
    1049                      .dwattr $C$DW$81, DW_AT_bit_size(0x01)
    1050                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1051                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1052              
    1053              $C$DW$82        .dwtag  DW_TAG_member
    1054                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$19)
    1055                      .dwattr $C$DW$82, DW_AT_name("PPB4TRIPHI")
    1056                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_PPB4TRIPHI")
    1057                      .dwattr $C$DW$82, DW_AT_bit_offset(0x03)
    1058                      .dwattr $C$DW$82, DW_AT_bit_size(0x01)
    1059                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1060                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1061              
    1062              $C$DW$83        .dwtag  DW_TAG_member
    1063                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$19)
    1064                      .dwattr $C$DW$83, DW_AT_name("PPB4TRIPLO")
    1065                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_PPB4TRIPLO")
    1066                      .dwattr $C$DW$83, DW_AT_bit_offset(0x02)
    1067                      .dwattr $C$DW$83, DW_AT_bit_size(0x01)
    1068                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1069                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1070              
    1071              $C$DW$84        .dwtag  DW_TAG_member
    1072                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$19)
    1073                      .dwattr $C$DW$84, DW_AT_name("PPB4ZERO")
    1074                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_PPB4ZERO")
    1075                      .dwattr $C$DW$84, DW_AT_bit_offset(0x01)
    1076                      .dwattr $C$DW$84, DW_AT_bit_size(0x01)
    1077                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1078                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1079              
    1080              $C$DW$85        .dwtag  DW_TAG_member
    1081                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$19)
    1082                      .dwattr $C$DW$85, DW_AT_name("rsvd4")
    1083                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_rsvd4")
    1084                      .dwattr $C$DW$85, DW_AT_bit_offset(0x00)
    1085                      .dwattr $C$DW$85, DW_AT_bit_size(0x01)
    1086                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1087                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1088              
    1089                      .dwendtag $C$DW$T$30
    1090              
    1091              
    1092              $C$DW$T$31      .dwtag  DW_TAG_union_type
    1093                      .dwattr $C$DW$T$31, DW_AT_name("ADCEVTINTSEL_REG")
    1094                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x01)
    1095              $C$DW$86        .dwtag  DW_TAG_member
    1096                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$19)
    1097                      .dwattr $C$DW$86, DW_AT_name("all")
    1098                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_all")
    1099                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1100                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1101              
TMS320C2000 Assembler PC v15.12.1 Sun Feb 26 22:53:23 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_Adc.asm                                                      PAGE   22

    1102              $C$DW$87        .dwtag  DW_TAG_member
    1103                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$30)
    1104                      .dwattr $C$DW$87, DW_AT_name("bit")
    1105                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_bit")
    1106                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1107                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1108              
    1109                      .dwendtag $C$DW$T$31
    1110              
    1111              
    1112              $C$DW$T$32      .dwtag  DW_TAG_structure_type
    1113                      .dwattr $C$DW$T$32, DW_AT_name("ADCEVTSEL_BITS")
    1114                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x01)
    1115              $C$DW$88        .dwtag  DW_TAG_member
    1116                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$19)
    1117                      .dwattr $C$DW$88, DW_AT_name("PPB1TRIPHI")
    1118                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_PPB1TRIPHI")
    1119                      .dwattr $C$DW$88, DW_AT_bit_offset(0x0f)
    1120                      .dwattr $C$DW$88, DW_AT_bit_size(0x01)
    1121                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1122                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1123              
    1124              $C$DW$89        .dwtag  DW_TAG_member
    1125                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$19)
    1126                      .dwattr $C$DW$89, DW_AT_name("PPB1TRIPLO")
    1127                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_PPB1TRIPLO")
    1128                      .dwattr $C$DW$89, DW_AT_bit_offset(0x0e)
    1129                      .dwattr $C$DW$89, DW_AT_bit_size(0x01)
    1130                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1131                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1132              
    1133              $C$DW$90        .dwtag  DW_TAG_member
    1134                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$19)
    1135                      .dwattr $C$DW$90, DW_AT_name("PPB1ZERO")
    1136                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_PPB1ZERO")
    1137                      .dwattr $C$DW$90, DW_AT_bit_offset(0x0d)
    1138                      .dwattr $C$DW$90, DW_AT_bit_size(0x01)
    1139                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1140                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1141              
    1142              $C$DW$91        .dwtag  DW_TAG_member
    1143                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$19)
    1144                      .dwattr $C$DW$91, DW_AT_name("rsvd1")
    1145                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_rsvd1")
    1146                      .dwattr $C$DW$91, DW_AT_bit_offset(0x0c)
    1147                      .dwattr $C$DW$91, DW_AT_bit_size(0x01)
    1148                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1149                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1150              
    1151              $C$DW$92        .dwtag  DW_TAG_member
    1152                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$19)
    1153                      .dwattr $C$DW$92, DW_AT_name("PPB2TRIPHI")
    1154                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_PPB2TRIPHI")
    1155                      .dwattr $C$DW$92, DW_AT_bit_offset(0x0b)
    1156                      .dwattr $C$DW$92, DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v15.12.1 Sun Feb 26 22:53:23 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_Adc.asm                                                      PAGE   23

    1157                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1158                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1159              
    1160              $C$DW$93        .dwtag  DW_TAG_member
    1161                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$19)
    1162                      .dwattr $C$DW$93, DW_AT_name("PPB2TRIPLO")
    1163                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_PPB2TRIPLO")
    1164                      .dwattr $C$DW$93, DW_AT_bit_offset(0x0a)
    1165                      .dwattr $C$DW$93, DW_AT_bit_size(0x01)
    1166                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1167                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1168              
    1169              $C$DW$94        .dwtag  DW_TAG_member
    1170                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$19)
    1171                      .dwattr $C$DW$94, DW_AT_name("PPB2ZERO")
    1172                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_PPB2ZERO")
    1173                      .dwattr $C$DW$94, DW_AT_bit_offset(0x09)
    1174                      .dwattr $C$DW$94, DW_AT_bit_size(0x01)
    1175                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1176                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1177              
    1178              $C$DW$95        .dwtag  DW_TAG_member
    1179                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$19)
    1180                      .dwattr $C$DW$95, DW_AT_name("rsvd2")
    1181                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_rsvd2")
    1182                      .dwattr $C$DW$95, DW_AT_bit_offset(0x08)
    1183                      .dwattr $C$DW$95, DW_AT_bit_size(0x01)
    1184                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1185                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1186              
    1187              $C$DW$96        .dwtag  DW_TAG_member
    1188                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$19)
    1189                      .dwattr $C$DW$96, DW_AT_name("PPB3TRIPHI")
    1190                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_PPB3TRIPHI")
    1191                      .dwattr $C$DW$96, DW_AT_bit_offset(0x07)
    1192                      .dwattr $C$DW$96, DW_AT_bit_size(0x01)
    1193                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1194                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1195              
    1196              $C$DW$97        .dwtag  DW_TAG_member
    1197                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$19)
    1198                      .dwattr $C$DW$97, DW_AT_name("PPB3TRIPLO")
    1199                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_PPB3TRIPLO")
    1200                      .dwattr $C$DW$97, DW_AT_bit_offset(0x06)
    1201                      .dwattr $C$DW$97, DW_AT_bit_size(0x01)
    1202                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1203                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1204              
    1205              $C$DW$98        .dwtag  DW_TAG_member
    1206                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$19)
    1207                      .dwattr $C$DW$98, DW_AT_name("PPB3ZERO")
    1208                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_PPB3ZERO")
    1209                      .dwattr $C$DW$98, DW_AT_bit_offset(0x05)
    1210                      .dwattr $C$DW$98, DW_AT_bit_size(0x01)
    1211                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v15.12.1 Sun Feb 26 22:53:23 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_Adc.asm                                                      PAGE   24

    1212                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1213              
    1214              $C$DW$99        .dwtag  DW_TAG_member
    1215                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$19)
    1216                      .dwattr $C$DW$99, DW_AT_name("rsvd3")
    1217                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_rsvd3")
    1218                      .dwattr $C$DW$99, DW_AT_bit_offset(0x04)
    1219                      .dwattr $C$DW$99, DW_AT_bit_size(0x01)
    1220                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1221                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1222              
    1223              $C$DW$100       .dwtag  DW_TAG_member
    1224                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$19)
    1225                      .dwattr $C$DW$100, DW_AT_name("PPB4TRIPHI")
    1226                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_PPB4TRIPHI")
    1227                      .dwattr $C$DW$100, DW_AT_bit_offset(0x03)
    1228                      .dwattr $C$DW$100, DW_AT_bit_size(0x01)
    1229                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1230                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1231              
    1232              $C$DW$101       .dwtag  DW_TAG_member
    1233                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$19)
    1234                      .dwattr $C$DW$101, DW_AT_name("PPB4TRIPLO")
    1235                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_PPB4TRIPLO")
    1236                      .dwattr $C$DW$101, DW_AT_bit_offset(0x02)
    1237                      .dwattr $C$DW$101, DW_AT_bit_size(0x01)
    1238                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1239                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1240              
    1241              $C$DW$102       .dwtag  DW_TAG_member
    1242                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$19)
    1243                      .dwattr $C$DW$102, DW_AT_name("PPB4ZERO")
    1244                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_PPB4ZERO")
    1245                      .dwattr $C$DW$102, DW_AT_bit_offset(0x01)
    1246                      .dwattr $C$DW$102, DW_AT_bit_size(0x01)
    1247                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1248                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1249              
    1250              $C$DW$103       .dwtag  DW_TAG_member
    1251                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$19)
    1252                      .dwattr $C$DW$103, DW_AT_name("rsvd4")
    1253                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_rsvd4")
    1254                      .dwattr $C$DW$103, DW_AT_bit_offset(0x00)
    1255                      .dwattr $C$DW$103, DW_AT_bit_size(0x01)
    1256                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1257                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1258              
    1259                      .dwendtag $C$DW$T$32
    1260              
    1261              
    1262              $C$DW$T$33      .dwtag  DW_TAG_union_type
    1263                      .dwattr $C$DW$T$33, DW_AT_name("ADCEVTSEL_REG")
    1264                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
    1265              $C$DW$104       .dwtag  DW_TAG_member
    1266                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v15.12.1 Sun Feb 26 22:53:23 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_Adc.asm                                                      PAGE   25

    1267                      .dwattr $C$DW$104, DW_AT_name("all")
    1268                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_all")
    1269                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1270                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1271              
    1272              $C$DW$105       .dwtag  DW_TAG_member
    1273                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$32)
    1274                      .dwattr $C$DW$105, DW_AT_name("bit")
    1275                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_bit")
    1276                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1277                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1278              
    1279                      .dwendtag $C$DW$T$33
    1280              
    1281              
    1282              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    1283                      .dwattr $C$DW$T$34, DW_AT_name("ADCEVTSTAT_BITS")
    1284                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
    1285              $C$DW$106       .dwtag  DW_TAG_member
    1286                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$19)
    1287                      .dwattr $C$DW$106, DW_AT_name("PPB1TRIPHI")
    1288                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_PPB1TRIPHI")
    1289                      .dwattr $C$DW$106, DW_AT_bit_offset(0x0f)
    1290                      .dwattr $C$DW$106, DW_AT_bit_size(0x01)
    1291                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1292                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1293              
    1294              $C$DW$107       .dwtag  DW_TAG_member
    1295                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$19)
    1296                      .dwattr $C$DW$107, DW_AT_name("PPB1TRIPLO")
    1297                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_PPB1TRIPLO")
    1298                      .dwattr $C$DW$107, DW_AT_bit_offset(0x0e)
    1299                      .dwattr $C$DW$107, DW_AT_bit_size(0x01)
    1300                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1301                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1302              
    1303              $C$DW$108       .dwtag  DW_TAG_member
    1304                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$19)
    1305                      .dwattr $C$DW$108, DW_AT_name("PPB1ZERO")
    1306                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_PPB1ZERO")
    1307                      .dwattr $C$DW$108, DW_AT_bit_offset(0x0d)
    1308                      .dwattr $C$DW$108, DW_AT_bit_size(0x01)
    1309                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1310                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1311              
    1312              $C$DW$109       .dwtag  DW_TAG_member
    1313                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$19)
    1314                      .dwattr $C$DW$109, DW_AT_name("rsvd1")
    1315                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_rsvd1")
    1316                      .dwattr $C$DW$109, DW_AT_bit_offset(0x0c)
    1317                      .dwattr $C$DW$109, DW_AT_bit_size(0x01)
    1318                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1319                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1320              
    1321              $C$DW$110       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v15.12.1 Sun Feb 26 22:53:23 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_Adc.asm                                                      PAGE   26

    1322                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$19)
    1323                      .dwattr $C$DW$110, DW_AT_name("PPB2TRIPHI")
    1324                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_PPB2TRIPHI")
    1325                      .dwattr $C$DW$110, DW_AT_bit_offset(0x0b)
    1326                      .dwattr $C$DW$110, DW_AT_bit_size(0x01)
    1327                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1328                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1329              
    1330              $C$DW$111       .dwtag  DW_TAG_member
    1331                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$19)
    1332                      .dwattr $C$DW$111, DW_AT_name("PPB2TRIPLO")
    1333                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_PPB2TRIPLO")
    1334                      .dwattr $C$DW$111, DW_AT_bit_offset(0x0a)
    1335                      .dwattr $C$DW$111, DW_AT_bit_size(0x01)
    1336                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1337                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1338              
    1339              $C$DW$112       .dwtag  DW_TAG_member
    1340                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$19)
    1341                      .dwattr $C$DW$112, DW_AT_name("PPB2ZERO")
    1342                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_PPB2ZERO")
    1343                      .dwattr $C$DW$112, DW_AT_bit_offset(0x09)
    1344                      .dwattr $C$DW$112, DW_AT_bit_size(0x01)
    1345                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1346                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1347              
    1348              $C$DW$113       .dwtag  DW_TAG_member
    1349                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$19)
    1350                      .dwattr $C$DW$113, DW_AT_name("rsvd2")
    1351                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_rsvd2")
    1352                      .dwattr $C$DW$113, DW_AT_bit_offset(0x08)
    1353                      .dwattr $C$DW$113, DW_AT_bit_size(0x01)
    1354                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1355                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1356              
    1357              $C$DW$114       .dwtag  DW_TAG_member
    1358                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$19)
    1359                      .dwattr $C$DW$114, DW_AT_name("PPB3TRIPHI")
    1360                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_PPB3TRIPHI")
    1361                      .dwattr $C$DW$114, DW_AT_bit_offset(0x07)
    1362                      .dwattr $C$DW$114, DW_AT_bit_size(0x01)
    1363                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1364                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1365              
    1366              $C$DW$115       .dwtag  DW_TAG_member
    1367                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$19)
    1368                      .dwattr $C$DW$115, DW_AT_name("PPB3TRIPLO")
    1369                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_PPB3TRIPLO")
    1370                      .dwattr $C$DW$115, DW_AT_bit_offset(0x06)
    1371                      .dwattr $C$DW$115, DW_AT_bit_size(0x01)
    1372                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1373                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1374              
    1375              $C$DW$116       .dwtag  DW_TAG_member
    1376                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v15.12.1 Sun Feb 26 22:53:23 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_Adc.asm                                                      PAGE   27

    1377                      .dwattr $C$DW$116, DW_AT_name("PPB3ZERO")
    1378                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_PPB3ZERO")
    1379                      .dwattr $C$DW$116, DW_AT_bit_offset(0x05)
    1380                      .dwattr $C$DW$116, DW_AT_bit_size(0x01)
    1381                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1382                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1383              
    1384              $C$DW$117       .dwtag  DW_TAG_member
    1385                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$19)
    1386                      .dwattr $C$DW$117, DW_AT_name("rsvd3")
    1387                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_rsvd3")
    1388                      .dwattr $C$DW$117, DW_AT_bit_offset(0x04)
    1389                      .dwattr $C$DW$117, DW_AT_bit_size(0x01)
    1390                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1391                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1392              
    1393              $C$DW$118       .dwtag  DW_TAG_member
    1394                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$19)
    1395                      .dwattr $C$DW$118, DW_AT_name("PPB4TRIPHI")
    1396                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_PPB4TRIPHI")
    1397                      .dwattr $C$DW$118, DW_AT_bit_offset(0x03)
    1398                      .dwattr $C$DW$118, DW_AT_bit_size(0x01)
    1399                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1400                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1401              
    1402              $C$DW$119       .dwtag  DW_TAG_member
    1403                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$19)
    1404                      .dwattr $C$DW$119, DW_AT_name("PPB4TRIPLO")
    1405                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_PPB4TRIPLO")
    1406                      .dwattr $C$DW$119, DW_AT_bit_offset(0x02)
    1407                      .dwattr $C$DW$119, DW_AT_bit_size(0x01)
    1408                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1409                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1410              
    1411              $C$DW$120       .dwtag  DW_TAG_member
    1412                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$19)
    1413                      .dwattr $C$DW$120, DW_AT_name("PPB4ZERO")
    1414                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_PPB4ZERO")
    1415                      .dwattr $C$DW$120, DW_AT_bit_offset(0x01)
    1416                      .dwattr $C$DW$120, DW_AT_bit_size(0x01)
    1417                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1418                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1419              
    1420              $C$DW$121       .dwtag  DW_TAG_member
    1421                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$19)
    1422                      .dwattr $C$DW$121, DW_AT_name("rsvd4")
    1423                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_rsvd4")
    1424                      .dwattr $C$DW$121, DW_AT_bit_offset(0x00)
    1425                      .dwattr $C$DW$121, DW_AT_bit_size(0x01)
    1426                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1427                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1428              
    1429                      .dwendtag $C$DW$T$34
    1430              
    1431              
TMS320C2000 Assembler PC v15.12.1 Sun Feb 26 22:53:23 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_Adc.asm                                                      PAGE   28

    1432              $C$DW$T$35      .dwtag  DW_TAG_union_type
    1433                      .dwattr $C$DW$T$35, DW_AT_name("ADCEVTSTAT_REG")
    1434                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x01)
    1435              $C$DW$122       .dwtag  DW_TAG_member
    1436                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$19)
    1437                      .dwattr $C$DW$122, DW_AT_name("all")
    1438                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_all")
    1439                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1440                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1441              
    1442              $C$DW$123       .dwtag  DW_TAG_member
    1443                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$34)
    1444                      .dwattr $C$DW$123, DW_AT_name("bit")
    1445                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_bit")
    1446                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1447                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1448              
    1449                      .dwendtag $C$DW$T$35
    1450              
    1451              
    1452              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    1453                      .dwattr $C$DW$T$36, DW_AT_name("ADCINTFLGCLR_BITS")
    1454                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x01)
    1455              $C$DW$124       .dwtag  DW_TAG_member
    1456                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$19)
    1457                      .dwattr $C$DW$124, DW_AT_name("ADCINT1")
    1458                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_ADCINT1")
    1459                      .dwattr $C$DW$124, DW_AT_bit_offset(0x0f)
    1460                      .dwattr $C$DW$124, DW_AT_bit_size(0x01)
    1461                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1462                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1463              
    1464              $C$DW$125       .dwtag  DW_TAG_member
    1465                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$19)
    1466                      .dwattr $C$DW$125, DW_AT_name("ADCINT2")
    1467                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_ADCINT2")
    1468                      .dwattr $C$DW$125, DW_AT_bit_offset(0x0e)
    1469                      .dwattr $C$DW$125, DW_AT_bit_size(0x01)
    1470                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1471                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1472              
    1473              $C$DW$126       .dwtag  DW_TAG_member
    1474                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$19)
    1475                      .dwattr $C$DW$126, DW_AT_name("ADCINT3")
    1476                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_ADCINT3")
    1477                      .dwattr $C$DW$126, DW_AT_bit_offset(0x0d)
    1478                      .dwattr $C$DW$126, DW_AT_bit_size(0x01)
    1479                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1480                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1481              
    1482              $C$DW$127       .dwtag  DW_TAG_member
    1483                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$19)
    1484                      .dwattr $C$DW$127, DW_AT_name("ADCINT4")
    1485                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_ADCINT4")
    1486                      .dwattr $C$DW$127, DW_AT_bit_offset(0x0c)
TMS320C2000 Assembler PC v15.12.1 Sun Feb 26 22:53:23 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_Adc.asm                                                      PAGE   29

    1487                      .dwattr $C$DW$127, DW_AT_bit_size(0x01)
    1488                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1489                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1490              
    1491              $C$DW$128       .dwtag  DW_TAG_member
    1492                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$19)
    1493                      .dwattr $C$DW$128, DW_AT_name("rsvd1")
    1494                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_rsvd1")
    1495                      .dwattr $C$DW$128, DW_AT_bit_offset(0x00)
    1496                      .dwattr $C$DW$128, DW_AT_bit_size(0x0c)
    1497                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1498                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1499              
    1500                      .dwendtag $C$DW$T$36
    1501              
    1502              
    1503              $C$DW$T$37      .dwtag  DW_TAG_union_type
    1504                      .dwattr $C$DW$T$37, DW_AT_name("ADCINTFLGCLR_REG")
    1505                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x01)
    1506              $C$DW$129       .dwtag  DW_TAG_member
    1507                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$19)
    1508                      .dwattr $C$DW$129, DW_AT_name("all")
    1509                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_all")
    1510                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1511                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1512              
    1513              $C$DW$130       .dwtag  DW_TAG_member
    1514                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$36)
    1515                      .dwattr $C$DW$130, DW_AT_name("bit")
    1516                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_bit")
    1517                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1518                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1519              
    1520                      .dwendtag $C$DW$T$37
    1521              
    1522              
    1523              $C$DW$T$38      .dwtag  DW_TAG_structure_type
    1524                      .dwattr $C$DW$T$38, DW_AT_name("ADCINTFLG_BITS")
    1525                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x01)
    1526              $C$DW$131       .dwtag  DW_TAG_member
    1527                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$19)
    1528                      .dwattr $C$DW$131, DW_AT_name("ADCINT1")
    1529                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_ADCINT1")
    1530                      .dwattr $C$DW$131, DW_AT_bit_offset(0x0f)
    1531                      .dwattr $C$DW$131, DW_AT_bit_size(0x01)
    1532                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1533                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1534              
    1535              $C$DW$132       .dwtag  DW_TAG_member
    1536                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$19)
    1537                      .dwattr $C$DW$132, DW_AT_name("ADCINT2")
    1538                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_ADCINT2")
    1539                      .dwattr $C$DW$132, DW_AT_bit_offset(0x0e)
    1540                      .dwattr $C$DW$132, DW_AT_bit_size(0x01)
    1541                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v15.12.1 Sun Feb 26 22:53:23 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_Adc.asm                                                      PAGE   30

    1542                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1543              
    1544              $C$DW$133       .dwtag  DW_TAG_member
    1545                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$19)
    1546                      .dwattr $C$DW$133, DW_AT_name("ADCINT3")
    1547                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_ADCINT3")
    1548                      .dwattr $C$DW$133, DW_AT_bit_offset(0x0d)
    1549                      .dwattr $C$DW$133, DW_AT_bit_size(0x01)
    1550                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1551                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1552              
    1553              $C$DW$134       .dwtag  DW_TAG_member
    1554                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$19)
    1555                      .dwattr $C$DW$134, DW_AT_name("ADCINT4")
    1556                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_ADCINT4")
    1557                      .dwattr $C$DW$134, DW_AT_bit_offset(0x0c)
    1558                      .dwattr $C$DW$134, DW_AT_bit_size(0x01)
    1559                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1560                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1561              
    1562              $C$DW$135       .dwtag  DW_TAG_member
    1563                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$19)
    1564                      .dwattr $C$DW$135, DW_AT_name("rsvd1")
    1565                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_rsvd1")
    1566                      .dwattr $C$DW$135, DW_AT_bit_offset(0x00)
    1567                      .dwattr $C$DW$135, DW_AT_bit_size(0x0c)
    1568                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1569                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1570              
    1571                      .dwendtag $C$DW$T$38
    1572              
    1573              
    1574              $C$DW$T$39      .dwtag  DW_TAG_union_type
    1575                      .dwattr $C$DW$T$39, DW_AT_name("ADCINTFLG_REG")
    1576                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x01)
    1577              $C$DW$136       .dwtag  DW_TAG_member
    1578                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$19)
    1579                      .dwattr $C$DW$136, DW_AT_name("all")
    1580                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_all")
    1581                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1582                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1583              
    1584              $C$DW$137       .dwtag  DW_TAG_member
    1585                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$38)
    1586                      .dwattr $C$DW$137, DW_AT_name("bit")
    1587                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_bit")
    1588                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1589                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1590              
    1591                      .dwendtag $C$DW$T$39
    1592              
    1593              
    1594              $C$DW$T$40      .dwtag  DW_TAG_structure_type
    1595                      .dwattr $C$DW$T$40, DW_AT_name("ADCINTOVFCLR_BITS")
    1596                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x01)
TMS320C2000 Assembler PC v15.12.1 Sun Feb 26 22:53:23 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_Adc.asm                                                      PAGE   31

    1597              $C$DW$138       .dwtag  DW_TAG_member
    1598                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$19)
    1599                      .dwattr $C$DW$138, DW_AT_name("ADCINT1")
    1600                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_ADCINT1")
    1601                      .dwattr $C$DW$138, DW_AT_bit_offset(0x0f)
    1602                      .dwattr $C$DW$138, DW_AT_bit_size(0x01)
    1603                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1604                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1605              
    1606              $C$DW$139       .dwtag  DW_TAG_member
    1607                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$19)
    1608                      .dwattr $C$DW$139, DW_AT_name("ADCINT2")
    1609                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_ADCINT2")
    1610                      .dwattr $C$DW$139, DW_AT_bit_offset(0x0e)
    1611                      .dwattr $C$DW$139, DW_AT_bit_size(0x01)
    1612                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1613                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1614              
    1615              $C$DW$140       .dwtag  DW_TAG_member
    1616                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$19)
    1617                      .dwattr $C$DW$140, DW_AT_name("ADCINT3")
    1618                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_ADCINT3")
    1619                      .dwattr $C$DW$140, DW_AT_bit_offset(0x0d)
    1620                      .dwattr $C$DW$140, DW_AT_bit_size(0x01)
    1621                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1622                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1623              
    1624              $C$DW$141       .dwtag  DW_TAG_member
    1625                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$19)
    1626                      .dwattr $C$DW$141, DW_AT_name("ADCINT4")
    1627                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_ADCINT4")
    1628                      .dwattr $C$DW$141, DW_AT_bit_offset(0x0c)
    1629                      .dwattr $C$DW$141, DW_AT_bit_size(0x01)
    1630                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1631                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1632              
    1633              $C$DW$142       .dwtag  DW_TAG_member
    1634                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$19)
    1635                      .dwattr $C$DW$142, DW_AT_name("rsvd1")
    1636                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_rsvd1")
    1637                      .dwattr $C$DW$142, DW_AT_bit_offset(0x00)
    1638                      .dwattr $C$DW$142, DW_AT_bit_size(0x0c)
    1639                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1640                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1641              
    1642                      .dwendtag $C$DW$T$40
    1643              
    1644              
    1645              $C$DW$T$41      .dwtag  DW_TAG_union_type
    1646                      .dwattr $C$DW$T$41, DW_AT_name("ADCINTOVFCLR_REG")
    1647                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x01)
    1648              $C$DW$143       .dwtag  DW_TAG_member
    1649                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$19)
    1650                      .dwattr $C$DW$143, DW_AT_name("all")
    1651                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_all")
TMS320C2000 Assembler PC v15.12.1 Sun Feb 26 22:53:23 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_Adc.asm                                                      PAGE   32

    1652                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1653                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1654              
    1655              $C$DW$144       .dwtag  DW_TAG_member
    1656                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$40)
    1657                      .dwattr $C$DW$144, DW_AT_name("bit")
    1658                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_bit")
    1659                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1660                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1661              
    1662                      .dwendtag $C$DW$T$41
    1663              
    1664              
    1665              $C$DW$T$42      .dwtag  DW_TAG_structure_type
    1666                      .dwattr $C$DW$T$42, DW_AT_name("ADCINTOVF_BITS")
    1667                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x01)
    1668              $C$DW$145       .dwtag  DW_TAG_member
    1669                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$19)
    1670                      .dwattr $C$DW$145, DW_AT_name("ADCINT1")
    1671                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_ADCINT1")
    1672                      .dwattr $C$DW$145, DW_AT_bit_offset(0x0f)
    1673                      .dwattr $C$DW$145, DW_AT_bit_size(0x01)
    1674                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1675                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1676              
    1677              $C$DW$146       .dwtag  DW_TAG_member
    1678                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$19)
    1679                      .dwattr $C$DW$146, DW_AT_name("ADCINT2")
    1680                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_ADCINT2")
    1681                      .dwattr $C$DW$146, DW_AT_bit_offset(0x0e)
    1682                      .dwattr $C$DW$146, DW_AT_bit_size(0x01)
    1683                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1684                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    1685              
    1686              $C$DW$147       .dwtag  DW_TAG_member
    1687                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$19)
    1688                      .dwattr $C$DW$147, DW_AT_name("ADCINT3")
    1689                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_ADCINT3")
    1690                      .dwattr $C$DW$147, DW_AT_bit_offset(0x0d)
    1691                      .dwattr $C$DW$147, DW_AT_bit_size(0x01)
    1692                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1693                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    1694              
    1695              $C$DW$148       .dwtag  DW_TAG_member
    1696                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$19)
    1697                      .dwattr $C$DW$148, DW_AT_name("ADCINT4")
    1698                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_ADCINT4")
    1699                      .dwattr $C$DW$148, DW_AT_bit_offset(0x0c)
    1700                      .dwattr $C$DW$148, DW_AT_bit_size(0x01)
    1701                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1702                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1703              
    1704              $C$DW$149       .dwtag  DW_TAG_member
    1705                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$19)
    1706                      .dwattr $C$DW$149, DW_AT_name("rsvd1")
TMS320C2000 Assembler PC v15.12.1 Sun Feb 26 22:53:23 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_Adc.asm                                                      PAGE   33

    1707                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_rsvd1")
    1708                      .dwattr $C$DW$149, DW_AT_bit_offset(0x00)
    1709                      .dwattr $C$DW$149, DW_AT_bit_size(0x0c)
    1710                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1711                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1712              
    1713                      .dwendtag $C$DW$T$42
    1714              
    1715              
    1716              $C$DW$T$43      .dwtag  DW_TAG_union_type
    1717                      .dwattr $C$DW$T$43, DW_AT_name("ADCINTOVF_REG")
    1718                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x01)
    1719              $C$DW$150       .dwtag  DW_TAG_member
    1720                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$19)
    1721                      .dwattr $C$DW$150, DW_AT_name("all")
    1722                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_all")
    1723                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1724                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    1725              
    1726              $C$DW$151       .dwtag  DW_TAG_member
    1727                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$42)
    1728                      .dwattr $C$DW$151, DW_AT_name("bit")
    1729                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_bit")
    1730                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1731                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    1732              
    1733                      .dwendtag $C$DW$T$43
    1734              
    1735              
    1736              $C$DW$T$44      .dwtag  DW_TAG_structure_type
    1737                      .dwattr $C$DW$T$44, DW_AT_name("ADCINTSEL1N2_BITS")
    1738                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x01)
    1739              $C$DW$152       .dwtag  DW_TAG_member
    1740                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$19)
    1741                      .dwattr $C$DW$152, DW_AT_name("INT1SEL")
    1742                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_INT1SEL")
    1743                      .dwattr $C$DW$152, DW_AT_bit_offset(0x0c)
    1744                      .dwattr $C$DW$152, DW_AT_bit_size(0x04)
    1745                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1746                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    1747              
    1748              $C$DW$153       .dwtag  DW_TAG_member
    1749                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$19)
    1750                      .dwattr $C$DW$153, DW_AT_name("rsvd1")
    1751                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_rsvd1")
    1752                      .dwattr $C$DW$153, DW_AT_bit_offset(0x0b)
    1753                      .dwattr $C$DW$153, DW_AT_bit_size(0x01)
    1754                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1755                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
