TMS320C2000 Assembler PC v15.12.1 Sun Feb 26 22:53:28 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_PieVect.asm                                                  PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                   PC v15.12.1.LTS *
       3              ;* Date/Time created: Sun Feb 26 22:53:28 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --cla_support=cla0 --float_support=fpu32 --hll_source=on --mem_model:cod
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/controlSUITE/device_support/F2837xD/v170/F2837xD_common/source/F2
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v15.12.1.LTS Copyright (c) 1996-201
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Keith\workspace_v6_1_3\IDDK_PM_Servo_F2837x-v2\F2837x_RAM"
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram
      15                      .dwattr $C$DW$1, DW_AT_name("CLA1_3_ISR")

    1518                      .global _RAM_ACCESS_VIOLATION_ISR
    1519                      .global _EPWM11_TZ_ISR
    1520                      .global _EPWM10_TZ_ISR
    1521                      .global _EPWM9_ISR
    1522                      .global _EPWM12_TZ_ISR
    1523                      .global _IPC2_ISR
    1524                      .global _IPC1_ISR
    1525                      .global _EPWM9_TZ_ISR
    1526                      .global _IPC3_ISR
    1527                      .global _EPWM10_ISR
    1528                      .global _SPIC_TX_ISR
    1529                      .global _SPIC_RX_ISR
    1530                      .global _USBA_ISR
    1531                      .global _UPPA_ISR
    1532                      .global _EPWM12_ISR
TMS320C2000 Assembler PC v15.12.1 Sun Feb 26 22:53:28 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_PieVect.asm                                                  PAGE   33

    1533                      .global _EPWM11_ISR
    1534                      .global _SD2_ISR
    1535                      .global _SD1_ISR
    1536                      .global _XINT1_ISR
    1537                      .global _ADCC1_ISR
    1538                      .global _ADCD1_ISR
    1539                      .global _XINT2_ISR
    1540                      .global _USER12_ISR
    1541                      .global _USER11_ISR
    1542                      .global _ADCB1_ISR
    1543                      .global _ADCA1_ISR
    1544                      .global _TIMER0_ISR
    1545                      .global _EPWM5_TZ_ISR
    1546                      .global _EPWM4_TZ_ISR
    1547                      .global _EPWM7_TZ_ISR
    1548                      .global _EPWM6_TZ_ISR
    1549                      .global _EPWM1_TZ_ISR
    1550                      .global _WAKE_ISR
    1551                      .global _EPWM3_TZ_ISR
    1552                      .global _EPWM2_TZ_ISR
    1553                      .global _NMI_ISR
    1554                      .global _EMU_ISR
    1555                      .global _USER1_ISR
    1556                      .global _ILLEGAL_ISR
    1557                      .global _TIMER2_ISR
    1558                      .global _TIMER1_ISR
    1559                      .global _RTOS_ISR
    1560                      .global _DATALOG_ISR
    1561                      .global _USER2_ISR
    1562                      .global _USER8_ISR
    1563                      .global _USER7_ISR
    1564                      .global _USER10_ISR
    1565                      .global _USER9_ISR
    1566                      .global _USER4_ISR
    1567                      .global _USER3_ISR
    1568                      .global _USER6_ISR
    1569                      .global _USER5_ISR
    1570                      .global _EPWM8_TZ_ISR
    1571                      .global _MCBSPA_TX_ISR
    1572                      .global _MCBSPA_RX_ISR
    1573                      .global _MCBSPB_TX_ISR
    1574                      .global _MCBSPB_RX_ISR
    1575                      .global _SPIA_TX_ISR
    1576                      .global _SPIA_RX_ISR
    1577                      .global _SPIB_TX_ISR
    1578                      .global _SPIB_RX_ISR
    1579                      .global _DMA_CH1_ISR
    1580                      .global _I2CA_ISR
    1581                      .global _DMA_CH6_ISR
    1582                      .global _I2CB_ISR
    1583                      .global _I2CA_FIFO_ISR
    1584                      .global _DMA_CH3_ISR
    1585                      .global _DMA_CH2_ISR
    1586                      .global _DMA_CH5_ISR
    1587                      .global _DMA_CH4_ISR
TMS320C2000 Assembler PC v15.12.1 Sun Feb 26 22:53:28 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_PieVect.asm                                                  PAGE   34

    1588                      .global _EPWM6_ISR
    1589                      .global _EPWM5_ISR
    1590                      .global _EPWM8_ISR
    1591                      .global _EPWM7_ISR
    1592                      .global _EPWM2_ISR
    1593                      .global _EPWM1_ISR
    1594                      .global _EPWM4_ISR
    1595                      .global _EPWM3_ISR
    1596                      .global _ECAP1_ISR
    1597                      .global _EQEP1_ISR
    1598                      .global _ECAP6_ISR
    1599                      .global _EQEP3_ISR
    1600                      .global _EQEP2_ISR
    1601                      .global _ECAP3_ISR
    1602                      .global _ECAP2_ISR
    1603                      .global _ECAP5_ISR
    1604                      .global _ECAP4_ISR
    1605                      .global _I2CB_FIFO_ISR
    1606                      .global _PieCtrlRegs
    1607                      .global _PieVectTable
    1608              
    1609              ;***************************************************************
    1610              ;* TYPE INFORMATION                                            *
    1611              ;***************************************************************
    1612              
    1613              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    1614                      .dwattr $C$DW$T$20, DW_AT_name("PIEACK_BITS")
    1615                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x01)
    1616              $C$DW$148       .dwtag  DW_TAG_member
    1617                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$19)
    1618                      .dwattr $C$DW$148, DW_AT_name("ACK1")
    1619                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_ACK1")
    1620                      .dwattr $C$DW$148, DW_AT_bit_offset(0x0f)
    1621                      .dwattr $C$DW$148, DW_AT_bit_size(0x01)
    1622                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1623                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1624              
    1625              $C$DW$149       .dwtag  DW_TAG_member
    1626                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$19)
    1627                      .dwattr $C$DW$149, DW_AT_name("ACK2")
    1628                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_ACK2")
    1629                      .dwattr $C$DW$149, DW_AT_bit_offset(0x0e)
    1630                      .dwattr $C$DW$149, DW_AT_bit_size(0x01)
    1631                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1632                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1633              
    1634              $C$DW$150       .dwtag  DW_TAG_member
    1635                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$19)
    1636                      .dwattr $C$DW$150, DW_AT_name("ACK3")
    1637                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_ACK3")
    1638                      .dwattr $C$DW$150, DW_AT_bit_offset(0x0d)
    1639                      .dwattr $C$DW$150, DW_AT_bit_size(0x01)
    1640                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1641                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    1642              
TMS320C2000 Assembler PC v15.12.1 Sun Feb 26 22:53:28 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_PieVect.asm                                                  PAGE   35

    1643              $C$DW$151       .dwtag  DW_TAG_member
    1644                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$19)
    1645                      .dwattr $C$DW$151, DW_AT_name("ACK4")
    1646                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_ACK4")
    1647                      .dwattr $C$DW$151, DW_AT_bit_offset(0x0c)
    1648                      .dwattr $C$DW$151, DW_AT_bit_size(0x01)
    1649                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1650                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    1651              
    1652              $C$DW$152       .dwtag  DW_TAG_member
    1653                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$19)
    1654                      .dwattr $C$DW$152, DW_AT_name("ACK5")
    1655                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_ACK5")
    1656                      .dwattr $C$DW$152, DW_AT_bit_offset(0x0b)
    1657                      .dwattr $C$DW$152, DW_AT_bit_size(0x01)
    1658                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1659                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    1660              
    1661              $C$DW$153       .dwtag  DW_TAG_member
    1662                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$19)
    1663                      .dwattr $C$DW$153, DW_AT_name("ACK6")
    1664                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_ACK6")
    1665                      .dwattr $C$DW$153, DW_AT_bit_offset(0x0a)
    1666                      .dwattr $C$DW$153, DW_AT_bit_size(0x01)
    1667                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1668                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    1669              
    1670              $C$DW$154       .dwtag  DW_TAG_member
    1671                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$19)
    1672                      .dwattr $C$DW$154, DW_AT_name("ACK7")
    1673                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_ACK7")
    1674                      .dwattr $C$DW$154, DW_AT_bit_offset(0x09)
    1675                      .dwattr $C$DW$154, DW_AT_bit_size(0x01)
    1676                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1677                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    1678              
    1679              $C$DW$155       .dwtag  DW_TAG_member
    1680                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$19)
    1681                      .dwattr $C$DW$155, DW_AT_name("ACK8")
    1682                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_ACK8")
    1683                      .dwattr $C$DW$155, DW_AT_bit_offset(0x08)
    1684                      .dwattr $C$DW$155, DW_AT_bit_size(0x01)
    1685                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1686                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    1687              
    1688              $C$DW$156       .dwtag  DW_TAG_member
    1689                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$19)
    1690                      .dwattr $C$DW$156, DW_AT_name("ACK9")
    1691                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_ACK9")
    1692                      .dwattr $C$DW$156, DW_AT_bit_offset(0x07)
    1693                      .dwattr $C$DW$156, DW_AT_bit_size(0x01)
    1694                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1695                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    1696              
    1697              $C$DW$157       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v15.12.1 Sun Feb 26 22:53:28 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_PieVect.asm                                                  PAGE   36

    1698                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$19)
    1699                      .dwattr $C$DW$157, DW_AT_name("ACK10")
    1700                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_ACK10")
    1701                      .dwattr $C$DW$157, DW_AT_bit_offset(0x06)
    1702                      .dwattr $C$DW$157, DW_AT_bit_size(0x01)
    1703                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1704                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    1705              
    1706              $C$DW$158       .dwtag  DW_TAG_member
    1707                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$19)
    1708                      .dwattr $C$DW$158, DW_AT_name("ACK11")
    1709                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_ACK11")
    1710                      .dwattr $C$DW$158, DW_AT_bit_offset(0x05)
    1711                      .dwattr $C$DW$158, DW_AT_bit_size(0x01)
    1712                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1713                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    1714              
    1715              $C$DW$159       .dwtag  DW_TAG_member
    1716                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$19)
    1717                      .dwattr $C$DW$159, DW_AT_name("ACK12")
    1718                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_ACK12")
    1719                      .dwattr $C$DW$159, DW_AT_bit_offset(0x04)
    1720                      .dwattr $C$DW$159, DW_AT_bit_size(0x01)
    1721                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1722                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    1723              
    1724              $C$DW$160       .dwtag  DW_TAG_member
    1725                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$19)
    1726                      .dwattr $C$DW$160, DW_AT_name("rsvd1")
    1727                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_rsvd1")
    1728                      .dwattr $C$DW$160, DW_AT_bit_offset(0x00)
    1729                      .dwattr $C$DW$160, DW_AT_bit_size(0x04)
    1730                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1731                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    1732              
    1733                      .dwendtag $C$DW$T$20
    1734              
    1735              
    1736              $C$DW$T$21      .dwtag  DW_TAG_union_type
    1737                      .dwattr $C$DW$T$21, DW_AT_name("PIEACK_REG")
    1738                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x01)
    1739              $C$DW$161       .dwtag  DW_TAG_member
    1740                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$19)
    1741                      .dwattr $C$DW$161, DW_AT_name("all")
    1742                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_all")
    1743                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1744                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    1745              
    1746              $C$DW$162       .dwtag  DW_TAG_member
    1747                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$20)
    1748                      .dwattr $C$DW$162, DW_AT_name("bit")
    1749                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_bit")
    1750                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1751                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    1752              
TMS320C2000 Assembler PC v15.12.1 Sun Feb 26 22:53:28 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_PieVect.asm                                                  PAGE   37

    1753                      .dwendtag $C$DW$T$21
    1754              
    1755              
    1756              $C$DW$T$22      .dwtag  DW_TAG_structure_type
    1757                      .dwattr $C$DW$T$22, DW_AT_name("PIECTRL_BITS")
    1758                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x01)
    1759              $C$DW$163       .dwtag  DW_TAG_member
    1760                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$19)
    1761                      .dwattr $C$DW$163, DW_AT_name("ENPIE")
    1762                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_ENPIE")
    1763                      .dwattr $C$DW$163, DW_AT_bit_offset(0x0f)
    1764                      .dwattr $C$DW$163, DW_AT_bit_size(0x01)
    1765                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1766                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    1767              
    1768              $C$DW$164       .dwtag  DW_TAG_member
    1769                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$19)
    1770                      .dwattr $C$DW$164, DW_AT_name("PIEVECT")
    1771                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_PIEVECT")
    1772                      .dwattr $C$DW$164, DW_AT_bit_offset(0x00)
    1773                      .dwattr $C$DW$164, DW_AT_bit_size(0x0f)
    1774                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1775                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    1776              
    1777                      .dwendtag $C$DW$T$22
    1778              
    1779              
    1780              $C$DW$T$23      .dwtag  DW_TAG_union_type
    1781                      .dwattr $C$DW$T$23, DW_AT_name("PIECTRL_REG")
    1782                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x01)
    1783              $C$DW$165       .dwtag  DW_TAG_member
    1784                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$19)
    1785                      .dwattr $C$DW$165, DW_AT_name("all")
    1786                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_all")
    1787                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1788                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    1789              
    1790              $C$DW$166       .dwtag  DW_TAG_member
    1791                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$22)
    1792                      .dwattr $C$DW$166, DW_AT_name("bit")
    1793                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_bit")
    1794                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1795                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    1796              
    1797                      .dwendtag $C$DW$T$23
    1798              
    1799              
    1800              $C$DW$T$24      .dwtag  DW_TAG_structure_type
    1801                      .dwattr $C$DW$T$24, DW_AT_name("PIEIER10_BITS")
    1802                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x01)
    1803              $C$DW$167       .dwtag  DW_TAG_member
    1804                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$19)
    1805                      .dwattr $C$DW$167, DW_AT_name("INTx1")
    1806                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_INTx1")
    1807                      .dwattr $C$DW$167, DW_AT_bit_offset(0x0f)
TMS320C2000 Assembler PC v15.12.1 Sun Feb 26 22:53:28 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_PieVect.asm                                                  PAGE   38

    1808                      .dwattr $C$DW$167, DW_AT_bit_size(0x01)
    1809                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1810                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    1811              
    1812              $C$DW$168       .dwtag  DW_TAG_member
    1813                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$19)
    1814                      .dwattr $C$DW$168, DW_AT_name("INTx2")
    1815                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_INTx2")
    1816                      .dwattr $C$DW$168, DW_AT_bit_offset(0x0e)
    1817                      .dwattr $C$DW$168, DW_AT_bit_size(0x01)
    1818                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1819                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    1820              
    1821              $C$DW$169       .dwtag  DW_TAG_member
    1822                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$19)
    1823                      .dwattr $C$DW$169, DW_AT_name("INTx3")
    1824                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_INTx3")
    1825                      .dwattr $C$DW$169, DW_AT_bit_offset(0x0d)
    1826                      .dwattr $C$DW$169, DW_AT_bit_size(0x01)
    1827                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1828                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    1829              
    1830              $C$DW$170       .dwtag  DW_TAG_member
    1831                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$19)
    1832                      .dwattr $C$DW$170, DW_AT_name("INTx4")
    1833                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_INTx4")
    1834                      .dwattr $C$DW$170, DW_AT_bit_offset(0x0c)
    1835                      .dwattr $C$DW$170, DW_AT_bit_size(0x01)
    1836                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1837                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    1838              
    1839              $C$DW$171       .dwtag  DW_TAG_member
    1840                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$19)
    1841                      .dwattr $C$DW$171, DW_AT_name("INTx5")
    1842                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_INTx5")
    1843                      .dwattr $C$DW$171, DW_AT_bit_offset(0x0b)
    1844                      .dwattr $C$DW$171, DW_AT_bit_size(0x01)
    1845                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1846                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    1847              
    1848              $C$DW$172       .dwtag  DW_TAG_member
    1849                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$19)
    1850                      .dwattr $C$DW$172, DW_AT_name("INTx6")
    1851                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_INTx6")
    1852                      .dwattr $C$DW$172, DW_AT_bit_offset(0x0a)
    1853                      .dwattr $C$DW$172, DW_AT_bit_size(0x01)
    1854                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1855                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    1856              
    1857              $C$DW$173       .dwtag  DW_TAG_member
    1858                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$19)
    1859                      .dwattr $C$DW$173, DW_AT_name("INTx7")
    1860                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_INTx7")
    1861                      .dwattr $C$DW$173, DW_AT_bit_offset(0x09)
    1862                      .dwattr $C$DW$173, DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v15.12.1 Sun Feb 26 22:53:28 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_PieVect.asm                                                  PAGE   39

    1863                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1864                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    1865              
    1866              $C$DW$174       .dwtag  DW_TAG_member
    1867                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$19)
    1868                      .dwattr $C$DW$174, DW_AT_name("INTx8")
    1869                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_INTx8")
    1870                      .dwattr $C$DW$174, DW_AT_bit_offset(0x08)
    1871                      .dwattr $C$DW$174, DW_AT_bit_size(0x01)
    1872                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1873                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    1874              
    1875              $C$DW$175       .dwtag  DW_TAG_member
    1876                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$19)
    1877                      .dwattr $C$DW$175, DW_AT_name("INTx9")
    1878                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_INTx9")
    1879                      .dwattr $C$DW$175, DW_AT_bit_offset(0x07)
    1880                      .dwattr $C$DW$175, DW_AT_bit_size(0x01)
    1881                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1882                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    1883              
    1884              $C$DW$176       .dwtag  DW_TAG_member
    1885                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$19)
    1886                      .dwattr $C$DW$176, DW_AT_name("INTx10")
    1887                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_INTx10")
    1888                      .dwattr $C$DW$176, DW_AT_bit_offset(0x06)
    1889                      .dwattr $C$DW$176, DW_AT_bit_size(0x01)
    1890                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1891                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    1892              
    1893              $C$DW$177       .dwtag  DW_TAG_member
    1894                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$19)
    1895                      .dwattr $C$DW$177, DW_AT_name("INTx11")
    1896                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_INTx11")
    1897                      .dwattr $C$DW$177, DW_AT_bit_offset(0x05)
    1898                      .dwattr $C$DW$177, DW_AT_bit_size(0x01)
    1899                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1900                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    1901              
    1902              $C$DW$178       .dwtag  DW_TAG_member
    1903                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$19)
    1904                      .dwattr $C$DW$178, DW_AT_name("INTx12")
    1905                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_INTx12")
    1906                      .dwattr $C$DW$178, DW_AT_bit_offset(0x04)
    1907                      .dwattr $C$DW$178, DW_AT_bit_size(0x01)
    1908                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1909                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    1910              
    1911              $C$DW$179       .dwtag  DW_TAG_member
    1912                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$19)
    1913                      .dwattr $C$DW$179, DW_AT_name("INTx13")
    1914                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_INTx13")
    1915                      .dwattr $C$DW$179, DW_AT_bit_offset(0x03)
    1916                      .dwattr $C$DW$179, DW_AT_bit_size(0x01)
    1917                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v15.12.1 Sun Feb 26 22:53:28 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_PieVect.asm                                                  PAGE   40

    1918                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    1919              
    1920              $C$DW$180       .dwtag  DW_TAG_member
    1921                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$19)
    1922                      .dwattr $C$DW$180, DW_AT_name("INTx14")
    1923                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_INTx14")
    1924                      .dwattr $C$DW$180, DW_AT_bit_offset(0x02)
    1925                      .dwattr $C$DW$180, DW_AT_bit_size(0x01)
    1926                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1927                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    1928              
    1929              $C$DW$181       .dwtag  DW_TAG_member
    1930                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$19)
    1931                      .dwattr $C$DW$181, DW_AT_name("INTx15")
    1932                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_INTx15")
    1933                      .dwattr $C$DW$181, DW_AT_bit_offset(0x01)
    1934                      .dwattr $C$DW$181, DW_AT_bit_size(0x01)
    1935                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1936                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    1937              
    1938              $C$DW$182       .dwtag  DW_TAG_member
    1939                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$19)
    1940                      .dwattr $C$DW$182, DW_AT_name("INTx16")
    1941                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_INTx16")
    1942                      .dwattr $C$DW$182, DW_AT_bit_offset(0x00)
    1943                      .dwattr $C$DW$182, DW_AT_bit_size(0x01)
    1944                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1945                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    1946              
    1947                      .dwendtag $C$DW$T$24
    1948              
    1949              
    1950              $C$DW$T$25      .dwtag  DW_TAG_union_type
    1951                      .dwattr $C$DW$T$25, DW_AT_name("PIEIER10_REG")
    1952                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x01)
    1953              $C$DW$183       .dwtag  DW_TAG_member
    1954                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$19)
    1955                      .dwattr $C$DW$183, DW_AT_name("all")
    1956                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_all")
    1957                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1958                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    1959              
    1960              $C$DW$184       .dwtag  DW_TAG_member
    1961                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$24)
    1962                      .dwattr $C$DW$184, DW_AT_name("bit")
    1963                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_bit")
    1964                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1965                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    1966              
    1967                      .dwendtag $C$DW$T$25
    1968              
    1969              
    1970              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    1971                      .dwattr $C$DW$T$26, DW_AT_name("PIEIER11_BITS")
    1972                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x01)
TMS320C2000 Assembler PC v15.12.1 Sun Feb 26 22:53:28 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_PieVect.asm                                                  PAGE   41

    1973              $C$DW$185       .dwtag  DW_TAG_member
    1974                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$19)
    1975                      .dwattr $C$DW$185, DW_AT_name("INTx1")
    1976                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_INTx1")
    1977                      .dwattr $C$DW$185, DW_AT_bit_offset(0x0f)
    1978                      .dwattr $C$DW$185, DW_AT_bit_size(0x01)
    1979                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1980                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    1981              
    1982              $C$DW$186       .dwtag  DW_TAG_member
    1983                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$19)
    1984                      .dwattr $C$DW$186, DW_AT_name("INTx2")
    1985                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_INTx2")
    1986                      .dwattr $C$DW$186, DW_AT_bit_offset(0x0e)
    1987                      .dwattr $C$DW$186, DW_AT_bit_size(0x01)
    1988                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1989                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    1990              
    1991              $C$DW$187       .dwtag  DW_TAG_member
    1992                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$19)
    1993                      .dwattr $C$DW$187, DW_AT_name("INTx3")
    1994                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_INTx3")
    1995                      .dwattr $C$DW$187, DW_AT_bit_offset(0x0d)
    1996                      .dwattr $C$DW$187, DW_AT_bit_size(0x01)
    1997                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1998                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    1999              
    2000              $C$DW$188       .dwtag  DW_TAG_member
    2001                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$19)
    2002                      .dwattr $C$DW$188, DW_AT_name("INTx4")
    2003                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_INTx4")
    2004                      .dwattr $C$DW$188, DW_AT_bit_offset(0x0c)
    2005                      .dwattr $C$DW$188, DW_AT_bit_size(0x01)
    2006                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2007                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    2008              
    2009              $C$DW$189       .dwtag  DW_TAG_member
    2010                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$19)
    2011                      .dwattr $C$DW$189, DW_AT_name("INTx5")
    2012                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_INTx5")
    2013                      .dwattr $C$DW$189, DW_AT_bit_offset(0x0b)
    2014                      .dwattr $C$DW$189, DW_AT_bit_size(0x01)
    2015                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2016                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    2017              
    2018              $C$DW$190       .dwtag  DW_TAG_member
    2019                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$19)
    2020                      .dwattr $C$DW$190, DW_AT_name("INTx6")
    2021                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_INTx6")
    2022                      .dwattr $C$DW$190, DW_AT_bit_offset(0x0a)
    2023                      .dwattr $C$DW$190, DW_AT_bit_size(0x01)
    2024                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2025                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    2026              
    2027              $C$DW$191       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v15.12.1 Sun Feb 26 22:53:28 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_PieVect.asm                                                  PAGE   42

    2028                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$19)
    2029                      .dwattr $C$DW$191, DW_AT_name("INTx7")
    2030                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_INTx7")
    2031                      .dwattr $C$DW$191, DW_AT_bit_offset(0x09)
    2032                      .dwattr $C$DW$191, DW_AT_bit_size(0x01)
    2033                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2034                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    2035              
    2036              $C$DW$192       .dwtag  DW_TAG_member
    2037                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$19)
    2038                      .dwattr $C$DW$192, DW_AT_name("INTx8")
    2039                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_INTx8")
    2040                      .dwattr $C$DW$192, DW_AT_bit_offset(0x08)
    2041                      .dwattr $C$DW$192, DW_AT_bit_size(0x01)
    2042                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2043                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    2044              
    2045              $C$DW$193       .dwtag  DW_TAG_member
    2046                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$19)
    2047                      .dwattr $C$DW$193, DW_AT_name("INTx9")
    2048                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_INTx9")
    2049                      .dwattr $C$DW$193, DW_AT_bit_offset(0x07)
    2050                      .dwattr $C$DW$193, DW_AT_bit_size(0x01)
    2051                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2052                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    2053              
    2054              $C$DW$194       .dwtag  DW_TAG_member
    2055                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$19)
    2056                      .dwattr $C$DW$194, DW_AT_name("INTx10")
    2057                      .dwattr $C$DW$194, DW_AT_TI_symbol_name("_INTx10")
    2058                      .dwattr $C$DW$194, DW_AT_bit_offset(0x06)
    2059                      .dwattr $C$DW$194, DW_AT_bit_size(0x01)
    2060                      .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2061                      .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    2062              
    2063              $C$DW$195       .dwtag  DW_TAG_member
    2064                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$19)
    2065                      .dwattr $C$DW$195, DW_AT_name("INTx11")
    2066                      .dwattr $C$DW$195, DW_AT_TI_symbol_name("_INTx11")
    2067                      .dwattr $C$DW$195, DW_AT_bit_offset(0x05)
    2068                      .dwattr $C$DW$195, DW_AT_bit_size(0x01)
    2069                      .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2070                      .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    2071              
    2072              $C$DW$196       .dwtag  DW_TAG_member
    2073                      .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$19)
    2074                      .dwattr $C$DW$196, DW_AT_name("INTx12")
    2075                      .dwattr $C$DW$196, DW_AT_TI_symbol_name("_INTx12")
    2076                      .dwattr $C$DW$196, DW_AT_bit_offset(0x04)
    2077                      .dwattr $C$DW$196, DW_AT_bit_size(0x01)
    2078                      .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2079                      .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    2080              
    2081              $C$DW$197       .dwtag  DW_TAG_member
    2082                      .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v15.12.1 Sun Feb 26 22:53:28 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_PieVect.asm                                                  PAGE   43

    2083                      .dwattr $C$DW$197, DW_AT_name("INTx13")
    2084                      .dwattr $C$DW$197, DW_AT_TI_symbol_name("_INTx13")
    2085                      .dwattr $C$DW$197, DW_AT_bit_offset(0x03)
    2086                      .dwattr $C$DW$197, DW_AT_bit_size(0x01)
    2087                      .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2088                      .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    2089              
    2090              $C$DW$198       .dwtag  DW_TAG_member
    2091                      .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$19)
    2092                      .dwattr $C$DW$198, DW_AT_name("INTx14")
    2093                      .dwattr $C$DW$198, DW_AT_TI_symbol_name("_INTx14")
    2094                      .dwattr $C$DW$198, DW_AT_bit_offset(0x02)
    2095                      .dwattr $C$DW$198, DW_AT_bit_size(0x01)
    2096                      .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2097                      .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    2098              
    2099              $C$DW$199       .dwtag  DW_TAG_member
    2100                      .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$19)
    2101                      .dwattr $C$DW$199, DW_AT_name("INTx15")
    2102                      .dwattr $C$DW$199, DW_AT_TI_symbol_name("_INTx15")
    2103                      .dwattr $C$DW$199, DW_AT_bit_offset(0x01)
    2104                      .dwattr $C$DW$199, DW_AT_bit_size(0x01)
    2105                      .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2106                      .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    2107              
    2108              $C$DW$200       .dwtag  DW_TAG_member
    2109                      .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$19)
    2110                      .dwattr $C$DW$200, DW_AT_name("INTx16")
    2111                      .dwattr $C$DW$200, DW_AT_TI_symbol_name("_INTx16")
    2112                      .dwattr $C$DW$200, DW_AT_bit_offset(0x00)
    2113                      .dwattr $C$DW$200, DW_AT_bit_size(0x01)
    2114                      .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2115                      .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    2116              
    2117                      .dwendtag $C$DW$T$26
    2118              
    2119              
    2120              $C$DW$T$27      .dwtag  DW_TAG_union_type
    2121                      .dwattr $C$DW$T$27, DW_AT_name("PIEIER11_REG")
    2122                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x01)
    2123              $C$DW$201       .dwtag  DW_TAG_member
    2124                      .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$19)
    2125                      .dwattr $C$DW$201, DW_AT_name("all")
    2126                      .dwattr $C$DW$201, DW_AT_TI_symbol_name("_all")
    2127                      .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2128                      .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    2129              
    2130              $C$DW$202       .dwtag  DW_TAG_member
    2131                      .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$26)
    2132                      .dwattr $C$DW$202, DW_AT_name("bit")
    2133                      .dwattr $C$DW$202, DW_AT_TI_symbol_name("_bit")
    2134                      .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2135                      .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    2136              
    2137                      .dwendtag $C$DW$T$27
TMS320C2000 Assembler PC v15.12.1 Sun Feb 26 22:53:28 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_PieVect.asm                                                  PAGE   44

    2138              
    2139              
    2140              $C$DW$T$28      .dwtag  DW_TAG_structure_type
    2141                      .dwattr $C$DW$T$28, DW_AT_name("PIEIER12_BITS")
    2142                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x01)
    2143              $C$DW$203       .dwtag  DW_TAG_member
    2144                      .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$19)
    2145                      .dwattr $C$DW$203, DW_AT_name("INTx1")
    2146                      .dwattr $C$DW$203, DW_AT_TI_symbol_name("_INTx1")
    2147                      .dwattr $C$DW$203, DW_AT_bit_offset(0x0f)
    2148                      .dwattr $C$DW$203, DW_AT_bit_size(0x01)
    2149                      .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2150                      .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    2151              
    2152              $C$DW$204       .dwtag  DW_TAG_member
    2153                      .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$19)
    2154                      .dwattr $C$DW$204, DW_AT_name("INTx2")
    2155                      .dwattr $C$DW$204, DW_AT_TI_symbol_name("_INTx2")
    2156                      .dwattr $C$DW$204, DW_AT_bit_offset(0x0e)
    2157                      .dwattr $C$DW$204, DW_AT_bit_size(0x01)
    2158                      .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2159                      .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    2160              
    2161              $C$DW$205       .dwtag  DW_TAG_member
    2162                      .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$19)
    2163                      .dwattr $C$DW$205, DW_AT_name("INTx3")
    2164                      .dwattr $C$DW$205, DW_AT_TI_symbol_name("_INTx3")
    2165                      .dwattr $C$DW$205, DW_AT_bit_offset(0x0d)
    2166                      .dwattr $C$DW$205, DW_AT_bit_size(0x01)
    2167                      .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2168                      .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    2169              
    2170              $C$DW$206       .dwtag  DW_TAG_member
    2171                      .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$19)
    2172                      .dwattr $C$DW$206, DW_AT_name("INTx4")
    2173                      .dwattr $C$DW$206, DW_AT_TI_symbol_name("_INTx4")
    2174                      .dwattr $C$DW$206, DW_AT_bit_offset(0x0c)
    2175                      .dwattr $C$DW$206, DW_AT_bit_size(0x01)
    2176                      .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2177                      .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    2178              
    2179              $C$DW$207       .dwtag  DW_TAG_member
    2180                      .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$19)
    2181                      .dwattr $C$DW$207, DW_AT_name("INTx5")
    2182                      .dwattr $C$DW$207, DW_AT_TI_symbol_name("_INTx5")
    2183                      .dwattr $C$DW$207, DW_AT_bit_offset(0x0b)
    2184                      .dwattr $C$DW$207, DW_AT_bit_size(0x01)
    2185                      .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2186                      .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    2187              
    2188              $C$DW$208       .dwtag  DW_TAG_member
    2189                      .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$19)
    2190                      .dwattr $C$DW$208, DW_AT_name("INTx6")
    2191                      .dwattr $C$DW$208, DW_AT_TI_symbol_name("_INTx6")
    2192                      .dwattr $C$DW$208, DW_AT_bit_offset(0x0a)
TMS320C2000 Assembler PC v15.12.1 Sun Feb 26 22:53:28 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_PieVect.asm                                                  PAGE   45

    2193                      .dwattr $C$DW$208, DW_AT_bit_size(0x01)
    2194                      .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2195                      .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    2196              
    2197              $C$DW$209       .dwtag  DW_TAG_member
    2198                      .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$19)
    2199                      .dwattr $C$DW$209, DW_AT_name("INTx7")
    2200                      .dwattr $C$DW$209, DW_AT_TI_symbol_name("_INTx7")
    2201                      .dwattr $C$DW$209, DW_AT_bit_offset(0x09)
    2202                      .dwattr $C$DW$209, DW_AT_bit_size(0x01)
    2203                      .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2204                      .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    2205              
    2206              $C$DW$210       .dwtag  DW_TAG_member
    2207                      .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$19)
    2208                      .dwattr $C$DW$210, DW_AT_name("INTx8")
    2209                      .dwattr $C$DW$210, DW_AT_TI_symbol_name("_INTx8")
    2210                      .dwattr $C$DW$210, DW_AT_bit_offset(0x08)
    2211                      .dwattr $C$DW$210, DW_AT_bit_size(0x01)
    2212                      .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2213                      .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    2214              
    2215              $C$DW$211       .dwtag  DW_TAG_member
    2216                      .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$19)
    2217                      .dwattr $C$DW$211, DW_AT_name("INTx9")
    2218                      .dwattr $C$DW$211, DW_AT_TI_symbol_name("_INTx9")
    2219                      .dwattr $C$DW$211, DW_AT_bit_offset(0x07)
    2220                      .dwattr $C$DW$211, DW_AT_bit_size(0x01)
    2221                      .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2222                      .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    2223              
    2224              $C$DW$212       .dwtag  DW_TAG_member
    2225                      .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$19)
    2226                      .dwattr $C$DW$212, DW_AT_name("INTx10")
    2227                      .dwattr $C$DW$212, DW_AT_TI_symbol_name("_INTx10")
    2228                      .dwattr $C$DW$212, DW_AT_bit_offset(0x06)
    2229                      .dwattr $C$DW$212, DW_AT_bit_size(0x01)
    2230                      .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2231                      .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    2232              
    2233              $C$DW$213       .dwtag  DW_TAG_member
    2234                      .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$19)
    2235                      .dwattr $C$DW$213, DW_AT_name("INTx11")
    2236                      .dwattr $C$DW$213, DW_AT_TI_symbol_name("_INTx11")
    2237                      .dwattr $C$DW$213, DW_AT_bit_offset(0x05)
    2238                      .dwattr $C$DW$213, DW_AT_bit_size(0x01)
    2239                      .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2240                      .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    2241              
    2242              $C$DW$214       .dwtag  DW_TAG_member
    2243                      .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$19)
    2244                      .dwattr $C$DW$214, DW_AT_name("INTx12")
    2245                      .dwattr $C$DW$214, DW_AT_TI_symbol_name("_INTx12")
    2246                      .dwattr $C$DW$214, DW_AT_bit_offset(0x04)
    2247                      .dwattr $C$DW$214, DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v15.12.1 Sun Feb 26 22:53:28 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_PieVect.asm                                                  PAGE   46

    2248                      .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2249                      .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    2250              
    2251              $C$DW$215       .dwtag  DW_TAG_member
    2252                      .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$19)
    2253                      .dwattr $C$DW$215, DW_AT_name("INTx13")
    2254                      .dwattr $C$DW$215, DW_AT_TI_symbol_name("_INTx13")
    2255                      .dwattr $C$DW$215, DW_AT_bit_offset(0x03)
    2256                      .dwattr $C$DW$215, DW_AT_bit_size(0x01)
    2257                      .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2258                      .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    2259              
    2260              $C$DW$216       .dwtag  DW_TAG_member
    2261                      .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$19)
    2262                      .dwattr $C$DW$216, DW_AT_name("INTx14")
    2263                      .dwattr $C$DW$216, DW_AT_TI_symbol_name("_INTx14")
    2264                      .dwattr $C$DW$216, DW_AT_bit_offset(0x02)
    2265                      .dwattr $C$DW$216, DW_AT_bit_size(0x01)
    2266                      .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2267                      .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    2268              
    2269              $C$DW$217       .dwtag  DW_TAG_member
    2270                      .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$19)
    2271                      .dwattr $C$DW$217, DW_AT_name("INTx15")
    2272                      .dwattr $C$DW$217, DW_AT_TI_symbol_name("_INTx15")
    2273                      .dwattr $C$DW$217, DW_AT_bit_offset(0x01)
    2274                      .dwattr $C$DW$217, DW_AT_bit_size(0x01)
    2275                      .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2276                      .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    2277              
    2278              $C$DW$218       .dwtag  DW_TAG_member
    2279                      .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$19)
    2280                      .dwattr $C$DW$218, DW_AT_name("INTx16")
    2281                      .dwattr $C$DW$218, DW_AT_TI_symbol_name("_INTx16")
    2282                      .dwattr $C$DW$218, DW_AT_bit_offset(0x00)
    2283                      .dwattr $C$DW$218, DW_AT_bit_size(0x01)
    2284                      .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2285                      .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
    2286              
    2287                      .dwendtag $C$DW$T$28
    2288              
    2289              
    2290              $C$DW$T$29      .dwtag  DW_TAG_union_type
    2291                      .dwattr $C$DW$T$29, DW_AT_name("PIEIER12_REG")
    2292                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x01)
    2293              $C$DW$219       .dwtag  DW_TAG_member
    2294                      .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$19)
    2295                      .dwattr $C$DW$219, DW_AT_name("all")
    2296                      .dwattr $C$DW$219, DW_AT_TI_symbol_name("_all")
    2297                      .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2298                      .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    2299              
    2300              $C$DW$220       .dwtag  DW_TAG_member
    2301                      .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$28)
    2302                      .dwattr $C$DW$220, DW_AT_name("bit")
TMS320C2000 Assembler PC v15.12.1 Sun Feb 26 22:53:28 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_PieVect.asm                                                  PAGE   47

    2303                      .dwattr $C$DW$220, DW_AT_TI_symbol_name("_bit")
    2304                      .dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2305                      .dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
    2306              
    2307                      .dwendtag $C$DW$T$29
    2308              
    2309              
    2310              $C$DW$T$30      .dwtag  DW_TAG_structure_type
    2311                      .dwattr $C$DW$T$30, DW_AT_name("PIEIER1_BITS")
    2312                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x01)
    2313              $C$DW$221       .dwtag  DW_TAG_member
    2314                      .dwattr $C$DW$221, DW_AT_type(*$C$DW$T$19)
    2315                      .dwattr $C$DW$221, DW_AT_name("INTx1")
    2316                      .dwattr $C$DW$221, DW_AT_TI_symbol_name("_INTx1")
    2317                      .dwattr $C$DW$221, DW_AT_bit_offset(0x0f)
    2318                      .dwattr $C$DW$221, DW_AT_bit_size(0x01)
    2319                      .dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2320                      .dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
    2321              
    2322              $C$DW$222       .dwtag  DW_TAG_member
    2323                      .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$19)
    2324                      .dwattr $C$DW$222, DW_AT_name("INTx2")
    2325                      .dwattr $C$DW$222, DW_AT_TI_symbol_name("_INTx2")
    2326                      .dwattr $C$DW$222, DW_AT_bit_offset(0x0e)
    2327                      .dwattr $C$DW$222, DW_AT_bit_size(0x01)
    2328                      .dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2329                      .dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
    2330              
    2331              $C$DW$223       .dwtag  DW_TAG_member
    2332                      .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$19)
    2333                      .dwattr $C$DW$223, DW_AT_name("INTx3")
    2334                      .dwattr $C$DW$223, DW_AT_TI_symbol_name("_INTx3")
    2335                      .dwattr $C$DW$223, DW_AT_bit_offset(0x0d)
    2336                      .dwattr $C$DW$223, DW_AT_bit_size(0x01)
    2337                      .dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2338                      .dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
    2339              
    2340              $C$DW$224       .dwtag  DW_TAG_member
    2341                      .dwattr $C$DW$224, DW_AT_type(*$C$DW$T$19)
    2342                      .dwattr $C$DW$224, DW_AT_name("INTx4")
    2343                      .dwattr $C$DW$224, DW_AT_TI_symbol_name("_INTx4")
    2344                      .dwattr $C$DW$224, DW_AT_bit_offset(0x0c)
    2345                      .dwattr $C$DW$224, DW_AT_bit_size(0x01)
    2346                      .dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2347                      .dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
    2348              
    2349              $C$DW$225       .dwtag  DW_TAG_member
    2350                      .dwattr $C$DW$225, DW_AT_type(*$C$DW$T$19)
    2351                      .dwattr $C$DW$225, DW_AT_name("INTx5")
    2352                      .dwattr $C$DW$225, DW_AT_TI_symbol_name("_INTx5")
    2353                      .dwattr $C$DW$225, DW_AT_bit_offset(0x0b)
    2354                      .dwattr $C$DW$225, DW_AT_bit_size(0x01)
    2355                      .dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2356                      .dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
    2357              
TMS320C2000 Assembler PC v15.12.1 Sun Feb 26 22:53:28 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_PieVect.asm                                                  PAGE   48

    2358              $C$DW$226       .dwtag  DW_TAG_member
    2359                      .dwattr $C$DW$226, DW_AT_type(*$C$DW$T$19)
    2360                      .dwattr $C$DW$226, DW_AT_name("INTx6")
    2361                      .dwattr $C$DW$226, DW_AT_TI_symbol_name("_INTx6")
    2362                      .dwattr $C$DW$226, DW_AT_bit_offset(0x0a)
    2363                      .dwattr $C$DW$226, DW_AT_bit_size(0x01)
    2364                      .dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2365                      .dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)
    2366              
    2367              $C$DW$227       .dwtag  DW_TAG_member
    2368                      .dwattr $C$DW$227, DW_AT_type(*$C$DW$T$19)
    2369                      .dwattr $C$DW$227, DW_AT_name("INTx7")
    2370                      .dwattr $C$DW$227, DW_AT_TI_symbol_name("_INTx7")
    2371                      .dwattr $C$DW$227, DW_AT_bit_offset(0x09)
    2372                      .dwattr $C$DW$227, DW_AT_bit_size(0x01)
    2373                      .dwattr $C$DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2374                      .dwattr $C$DW$227, DW_AT_accessibility(DW_ACCESS_public)
    2375              
    2376              $C$DW$228       .dwtag  DW_TAG_member
    2377                      .dwattr $C$DW$228, DW_AT_type(*$C$DW$T$19)
    2378                      .dwattr $C$DW$228, DW_AT_name("INTx8")
    2379                      .dwattr $C$DW$228, DW_AT_TI_symbol_name("_INTx8")
    2380                      .dwattr $C$DW$228, DW_AT_bit_offset(0x08)
    2381                      .dwattr $C$DW$228, DW_AT_bit_size(0x01)
    2382                      .dwattr $C$DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2383                      .dwattr $C$DW$228, DW_AT_accessibility(DW_ACCESS_public)
    2384              
    2385              $C$DW$229       .dwtag  DW_TAG_member
    2386                      .dwattr $C$DW$229, DW_AT_type(*$C$DW$T$19)
    2387                      .dwattr $C$DW$229, DW_AT_name("INTx9")
    2388                      .dwattr $C$DW$229, DW_AT_TI_symbol_name("_INTx9")
    2389                      .dwattr $C$DW$229, DW_AT_bit_offset(0x07)
    2390                      .dwattr $C$DW$229, DW_AT_bit_size(0x01)
    2391                      .dwattr $C$DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2392                      .dwattr $C$DW$229, DW_AT_accessibility(DW_ACCESS_public)
    2393              
    2394              $C$DW$230       .dwtag  DW_TAG_member
    2395                      .dwattr $C$DW$230, DW_AT_type(*$C$DW$T$19)
    2396                      .dwattr $C$DW$230, DW_AT_name("INTx10")
    2397                      .dwattr $C$DW$230, DW_AT_TI_symbol_name("_INTx10")
    2398                      .dwattr $C$DW$230, DW_AT_bit_offset(0x06)
    2399                      .dwattr $C$DW$230, DW_AT_bit_size(0x01)
    2400                      .dwattr $C$DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2401                      .dwattr $C$DW$230, DW_AT_accessibility(DW_ACCESS_public)
    2402              
    2403              $C$DW$231       .dwtag  DW_TAG_member
    2404                      .dwattr $C$DW$231, DW_AT_type(*$C$DW$T$19)
    2405                      .dwattr $C$DW$231, DW_AT_name("INTx11")
    2406                      .dwattr $C$DW$231, DW_AT_TI_symbol_name("_INTx11")
    2407                      .dwattr $C$DW$231, DW_AT_bit_offset(0x05)
    2408                      .dwattr $C$DW$231, DW_AT_bit_size(0x01)
    2409                      .dwattr $C$DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2410                      .dwattr $C$DW$231, DW_AT_accessibility(DW_ACCESS_public)
    2411              
    2412              $C$DW$232       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v15.12.1 Sun Feb 26 22:53:28 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_PieVect.asm                                                  PAGE   49

    2413                      .dwattr $C$DW$232, DW_AT_type(*$C$DW$T$19)
    2414                      .dwattr $C$DW$232, DW_AT_name("INTx12")
    2415                      .dwattr $C$DW$232, DW_AT_TI_symbol_name("_INTx12")
    2416                      .dwattr $C$DW$232, DW_AT_bit_offset(0x04)
    2417                      .dwattr $C$DW$232, DW_AT_bit_size(0x01)
    2418                      .dwattr $C$DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2419                      .dwattr $C$DW$232, DW_AT_accessibility(DW_ACCESS_public)
    2420              
    2421              $C$DW$233       .dwtag  DW_TAG_member
    2422                      .dwattr $C$DW$233, DW_AT_type(*$C$DW$T$19)
    2423                      .dwattr $C$DW$233, DW_AT_name("INTx13")
    2424                      .dwattr $C$DW$233, DW_AT_TI_symbol_name("_INTx13")
    2425                      .dwattr $C$DW$233, DW_AT_bit_offset(0x03)
    2426                      .dwattr $C$DW$233, DW_AT_bit_size(0x01)
    2427                      .dwattr $C$DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2428                      .dwattr $C$DW$233, DW_AT_accessibility(DW_ACCESS_public)
    2429              
    2430              $C$DW$234       .dwtag  DW_TAG_member
    2431                      .dwattr $C$DW$234, DW_AT_type(*$C$DW$T$19)
    2432                      .dwattr $C$DW$234, DW_AT_name("INTx14")
    2433                      .dwattr $C$DW$234, DW_AT_TI_symbol_name("_INTx14")
    2434                      .dwattr $C$DW$234, DW_AT_bit_offset(0x02)
    2435                      .dwattr $C$DW$234, DW_AT_bit_size(0x01)
    2436                      .dwattr $C$DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2437                      .dwattr $C$DW$234, DW_AT_accessibility(DW_ACCESS_public)
    2438              
    2439              $C$DW$235       .dwtag  DW_TAG_member
    2440                      .dwattr $C$DW$235, DW_AT_type(*$C$DW$T$19)
    2441                      .dwattr $C$DW$235, DW_AT_name("INTx15")
    2442                      .dwattr $C$DW$235, DW_AT_TI_symbol_name("_INTx15")
    2443                      .dwattr $C$DW$235, DW_AT_bit_offset(0x01)
    2444                      .dwattr $C$DW$235, DW_AT_bit_size(0x01)
    2445                      .dwattr $C$DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2446                      .dwattr $C$DW$235, DW_AT_accessibility(DW_ACCESS_public)
    2447              
    2448              $C$DW$236       .dwtag  DW_TAG_member
    2449                      .dwattr $C$DW$236, DW_AT_type(*$C$DW$T$19)
    2450                      .dwattr $C$DW$236, DW_AT_name("INTx16")
    2451                      .dwattr $C$DW$236, DW_AT_TI_symbol_name("_INTx16")
    2452                      .dwattr $C$DW$236, DW_AT_bit_offset(0x00)
    2453                      .dwattr $C$DW$236, DW_AT_bit_size(0x01)
    2454                      .dwattr $C$DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2455                      .dwattr $C$DW$236, DW_AT_accessibility(DW_ACCESS_public)
    2456              
    2457                      .dwendtag $C$DW$T$30
    2458              
    2459              
    2460              $C$DW$T$31      .dwtag  DW_TAG_union_type
    2461                      .dwattr $C$DW$T$31, DW_AT_name("PIEIER1_REG")
    2462                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x01)
    2463              $C$DW$237       .dwtag  DW_TAG_member
    2464                      .dwattr $C$DW$237, DW_AT_type(*$C$DW$T$19)
    2465                      .dwattr $C$DW$237, DW_AT_name("all")
    2466                      .dwattr $C$DW$237, DW_AT_TI_symbol_name("_all")
    2467                      .dwattr $C$DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v15.12.1 Sun Feb 26 22:53:28 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_PieVect.asm                                                  PAGE   50

    2468                      .dwattr $C$DW$237, DW_AT_accessibility(DW_ACCESS_public)
    2469              
    2470              $C$DW$238       .dwtag  DW_TAG_member
    2471                      .dwattr $C$DW$238, DW_AT_type(*$C$DW$T$30)
    2472                      .dwattr $C$DW$238, DW_AT_name("bit")
    2473                      .dwattr $C$DW$238, DW_AT_TI_symbol_name("_bit")
    2474                      .dwattr $C$DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2475                      .dwattr $C$DW$238, DW_AT_accessibility(DW_ACCESS_public)
    2476              
    2477                      .dwendtag $C$DW$T$31
    2478              
    2479              
    2480              $C$DW$T$32      .dwtag  DW_TAG_structure_type
    2481                      .dwattr $C$DW$T$32, DW_AT_name("PIEIER2_BITS")
    2482                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x01)
    2483              $C$DW$239       .dwtag  DW_TAG_member
    2484                      .dwattr $C$DW$239, DW_AT_type(*$C$DW$T$19)
    2485                      .dwattr $C$DW$239, DW_AT_name("INTx1")
    2486                      .dwattr $C$DW$239, DW_AT_TI_symbol_name("_INTx1")
    2487                      .dwattr $C$DW$239, DW_AT_bit_offset(0x0f)
    2488                      .dwattr $C$DW$239, DW_AT_bit_size(0x01)
    2489                      .dwattr $C$DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2490                      .dwattr $C$DW$239, DW_AT_accessibility(DW_ACCESS_public)
    2491              
    2492              $C$DW$240       .dwtag  DW_TAG_member
    2493                      .dwattr $C$DW$240, DW_AT_type(*$C$DW$T$19)
    2494                      .dwattr $C$DW$240, DW_AT_name("INTx2")
    2495                      .dwattr $C$DW$240, DW_AT_TI_symbol_name("_INTx2")
    2496                      .dwattr $C$DW$240, DW_AT_bit_offset(0x0e)
    2497                      .dwattr $C$DW$240, DW_AT_bit_size(0x01)
    2498                      .dwattr $C$DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2499                      .dwattr $C$DW$240, DW_AT_accessibility(DW_ACCESS_public)
    2500              
    2501              $C$DW$241       .dwtag  DW_TAG_member
    2502                      .dwattr $C$DW$241, DW_AT_type(*$C$DW$T$19)
    2503                      .dwattr $C$DW$241, DW_AT_name("INTx3")
    2504                      .dwattr $C$DW$241, DW_AT_TI_symbol_name("_INTx3")
    2505                      .dwattr $C$DW$241, DW_AT_bit_offset(0x0d)
    2506                      .dwattr $C$DW$241, DW_AT_bit_size(0x01)
    2507                      .dwattr $C$DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2508                      .dwattr $C$DW$241, DW_AT_accessibility(DW_ACCESS_public)
    2509              
    2510              $C$DW$242       .dwtag  DW_TAG_member
    2511                      .dwattr $C$DW$242, DW_AT_type(*$C$DW$T$19)
    2512                      .dwattr $C$DW$242, DW_AT_name("INTx4")
    2513                      .dwattr $C$DW$242, DW_AT_TI_symbol_name("_INTx4")
    2514                      .dwattr $C$DW$242, DW_AT_bit_offset(0x0c)
    2515                      .dwattr $C$DW$242, DW_AT_bit_size(0x01)
    2516                      .dwattr $C$DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2517                      .dwattr $C$DW$242, DW_AT_accessibility(DW_ACCESS_public)
    2518              
    2519              $C$DW$243       .dwtag  DW_TAG_member
    2520                      .dwattr $C$DW$243, DW_AT_type(*$C$DW$T$19)
    2521                      .dwattr $C$DW$243, DW_AT_name("INTx5")
    2522                      .dwattr $C$DW$243, DW_AT_TI_symbol_name("_INTx5")
TMS320C2000 Assembler PC v15.12.1 Sun Feb 26 22:53:28 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_PieVect.asm                                                  PAGE   51

    2523                      .dwattr $C$DW$243, DW_AT_bit_offset(0x0b)
    2524                      .dwattr $C$DW$243, DW_AT_bit_size(0x01)
    2525                      .dwattr $C$DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2526                      .dwattr $C$DW$243, DW_AT_accessibility(DW_ACCESS_public)
    2527              
    2528              $C$DW$244       .dwtag  DW_TAG_member
    2529                      .dwattr $C$DW$244, DW_AT_type(*$C$DW$T$19)
    2530                      .dwattr $C$DW$244, DW_AT_name("INTx6")
    2531                      .dwattr $C$DW$244, DW_AT_TI_symbol_name("_INTx6")
    2532                      .dwattr $C$DW$244, DW_AT_bit_offset(0x0a)
    2533                      .dwattr $C$DW$244, DW_AT_bit_size(0x01)
    2534                      .dwattr $C$DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2535                      .dwattr $C$DW$244, DW_AT_accessibility(DW_ACCESS_public)
    2536              
    2537              $C$DW$245       .dwtag  DW_TAG_member
    2538                      .dwattr $C$DW$245, DW_AT_type(*$C$DW$T$19)
    2539                      .dwattr $C$DW$245, DW_AT_name("INTx7")
    2540                      .dwattr $C$DW$245, DW_AT_TI_symbol_name("_INTx7")
    2541                      .dwattr $C$DW$245, DW_AT_bit_offset(0x09)
    2542                      .dwattr $C$DW$245, DW_AT_bit_size(0x01)
    2543                      .dwattr $C$DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2544                      .dwattr $C$DW$245, DW_AT_accessibility(DW_ACCESS_public)
    2545              
    2546              $C$DW$246       .dwtag  DW_TAG_member
    2547                      .dwattr $C$DW$246, DW_AT_type(*$C$DW$T$19)
    2548                      .dwattr $C$DW$246, DW_AT_name("INTx8")
    2549                      .dwattr $C$DW$246, DW_AT_TI_symbol_name("_INTx8")
    2550                      .dwattr $C$DW$246, DW_AT_bit_offset(0x08)
    2551                      .dwattr $C$DW$246, DW_AT_bit_size(0x01)
    2552                      .dwattr $C$DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2553                      .dwattr $C$DW$246, DW_AT_accessibility(DW_ACCESS_public)
    2554              
    2555              $C$DW$247       .dwtag  DW_TAG_member
    2556                      .dwattr $C$DW$247, DW_AT_type(*$C$DW$T$19)
    2557                      .dwattr $C$DW$247, DW_AT_name("INTx9")
    2558                      .dwattr $C$DW$247, DW_AT_TI_symbol_name("_INTx9")
    2559                      .dwattr $C$DW$247, DW_AT_bit_offset(0x07)
    2560                      .dwattr $C$DW$247, DW_AT_bit_size(0x01)
    2561                      .dwattr $C$DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2562                      .dwattr $C$DW$247, DW_AT_accessibility(DW_ACCESS_public)
    2563              
    2564              $C$DW$248       .dwtag  DW_TAG_member
    2565                      .dwattr $C$DW$248, DW_AT_type(*$C$DW$T$19)
    2566                      .dwattr $C$DW$248, DW_AT_name("INTx10")
    2567                      .dwattr $C$DW$248, DW_AT_TI_symbol_name("_INTx10")
    2568                      .dwattr $C$DW$248, DW_AT_bit_offset(0x06)
    2569                      .dwattr $C$DW$248, DW_AT_bit_size(0x01)
    2570                      .dwattr $C$DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2571                      .dwattr $C$DW$248, DW_AT_accessibility(DW_ACCESS_public)
    2572              
    2573              $C$DW$249       .dwtag  DW_TAG_member
    2574                      .dwattr $C$DW$249, DW_AT_type(*$C$DW$T$19)
    2575                      .dwattr $C$DW$249, DW_AT_name("INTx11")
    2576                      .dwattr $C$DW$249, DW_AT_TI_symbol_name("_INTx11")
    2577                      .dwattr $C$DW$249, DW_AT_bit_offset(0x05)
TMS320C2000 Assembler PC v15.12.1 Sun Feb 26 22:53:28 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_PieVect.asm                                                  PAGE   52

    2578                      .dwattr $C$DW$249, DW_AT_bit_size(0x01)
    2579                      .dwattr $C$DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2580                      .dwattr $C$DW$249, DW_AT_accessibility(DW_ACCESS_public)
    2581              
    2582              $C$DW$250       .dwtag  DW_TAG_member
    2583                      .dwattr $C$DW$250, DW_AT_type(*$C$DW$T$19)
    2584                      .dwattr $C$DW$250, DW_AT_name("INTx12")
    2585                      .dwattr $C$DW$250, DW_AT_TI_symbol_name("_INTx12")
    2586                      .dwattr $C$DW$250, DW_AT_bit_offset(0x04)
    2587                      .dwattr $C$DW$250, DW_AT_bit_size(0x01)
    2588                      .dwattr $C$DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2589                      .dwattr $C$DW$250, DW_AT_accessibility(DW_ACCESS_public)
    2590              
    2591              $C$DW$251       .dwtag  DW_TAG_member
    2592                      .dwattr $C$DW$251, DW_AT_type(*$C$DW$T$19)
    2593                      .dwattr $C$DW$251, DW_AT_name("INTx13")
    2594                      .dwattr $C$DW$251, DW_AT_TI_symbol_name("_INTx13")
    2595                      .dwattr $C$DW$251, DW_AT_bit_offset(0x03)
    2596                      .dwattr $C$DW$251, DW_AT_bit_size(0x01)
    2597                      .dwattr $C$DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2598                      .dwattr $C$DW$251, DW_AT_accessibility(DW_ACCESS_public)
    2599              
    2600              $C$DW$252       .dwtag  DW_TAG_member
    2601                      .dwattr $C$DW$252, DW_AT_type(*$C$DW$T$19)
    2602                      .dwattr $C$DW$252, DW_AT_name("INTx14")
    2603                      .dwattr $C$DW$252, DW_AT_TI_symbol_name("_INTx14")
    2604                      .dwattr $C$DW$252, DW_AT_bit_offset(0x02)
    2605                      .dwattr $C$DW$252, DW_AT_bit_size(0x01)
    2606                      .dwattr $C$DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2607                      .dwattr $C$DW$252, DW_AT_accessibility(DW_ACCESS_public)
    2608              
    2609              $C$DW$253       .dwtag  DW_TAG_member
    2610                      .dwattr $C$DW$253, DW_AT_type(*$C$DW$T$19)
    2611                      .dwattr $C$DW$253, DW_AT_name("INTx15")
    2612                      .dwattr $C$DW$253, DW_AT_TI_symbol_name("_INTx15")
    2613                      .dwattr $C$DW$253, DW_AT_bit_offset(0x01)
    2614                      .dwattr $C$DW$253, DW_AT_bit_size(0x01)
    2615                      .dwattr $C$DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2616                      .dwattr $C$DW$253, DW_AT_accessibility(DW_ACCESS_public)
    2617              
    2618              $C$DW$254       .dwtag  DW_TAG_member
    2619                      .dwattr $C$DW$254, DW_AT_type(*$C$DW$T$19)
    2620                      .dwattr $C$DW$254, DW_AT_name("INTx16")
    2621                      .dwattr $C$DW$254, DW_AT_TI_symbol_name("_INTx16")
    2622                      .dwattr $C$DW$254, DW_AT_bit_offset(0x00)
    2623                      .dwattr $C$DW$254, DW_AT_bit_size(0x01)
    2624                      .dwattr $C$DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2625                      .dwattr $C$DW$254, DW_AT_accessibility(DW_ACCESS_public)
    2626              
    2627                      .dwendtag $C$DW$T$32
    2628              
    2629              
    2630              $C$DW$T$33      .dwtag  DW_TAG_union_type
    2631                      .dwattr $C$DW$T$33, DW_AT_name("PIEIER2_REG")
    2632                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
TMS320C2000 Assembler PC v15.12.1 Sun Feb 26 22:53:28 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_PieVect.asm                                                  PAGE   53

    2633              $C$DW$255       .dwtag  DW_TAG_member
    2634                      .dwattr $C$DW$255, DW_AT_type(*$C$DW$T$19)
    2635                      .dwattr $C$DW$255, DW_AT_name("all")
    2636                      .dwattr $C$DW$255, DW_AT_TI_symbol_name("_all")
    2637                      .dwattr $C$DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2638                      .dwattr $C$DW$255, DW_AT_accessibility(DW_ACCESS_public)
    2639              
    2640              $C$DW$256       .dwtag  DW_TAG_member
    2641                      .dwattr $C$DW$256, DW_AT_type(*$C$DW$T$32)
    2642                      .dwattr $C$DW$256, DW_AT_name("bit")
    2643                      .dwattr $C$DW$256, DW_AT_TI_symbol_name("_bit")
    2644                      .dwattr $C$DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2645                      .dwattr $C$DW$256, DW_AT_accessibility(DW_ACCESS_public)
    2646              
    2647                      .dwendtag $C$DW$T$33
    2648              
    2649              
    2650              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    2651                      .dwattr $C$DW$T$34, DW_AT_name("PIEIER3_BITS")
    2652                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
    2653              $C$DW$257       .dwtag  DW_TAG_member
    2654                      .dwattr $C$DW$257, DW_AT_type(*$C$DW$T$19)
    2655                      .dwattr $C$DW$257, DW_AT_name("INTx1")
    2656                      .dwattr $C$DW$257, DW_AT_TI_symbol_name("_INTx1")
    2657                      .dwattr $C$DW$257, DW_AT_bit_offset(0x0f)
    2658                      .dwattr $C$DW$257, DW_AT_bit_size(0x01)
    2659                      .dwattr $C$DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2660                      .dwattr $C$DW$257, DW_AT_accessibility(DW_ACCESS_public)
    2661              
    2662              $C$DW$258       .dwtag  DW_TAG_member
    2663                      .dwattr $C$DW$258, DW_AT_type(*$C$DW$T$19)
    2664                      .dwattr $C$DW$258, DW_AT_name("INTx2")
    2665                      .dwattr $C$DW$258, DW_AT_TI_symbol_name("_INTx2")
    2666                      .dwattr $C$DW$258, DW_AT_bit_offset(0x0e)
    2667                      .dwattr $C$DW$258, DW_AT_bit_size(0x01)
    2668                      .dwattr $C$DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2669                      .dwattr $C$DW$258, DW_AT_accessibility(DW_ACCESS_public)
    2670              
    2671              $C$DW$259       .dwtag  DW_TAG_member
    2672                      .dwattr $C$DW$259, DW_AT_type(*$C$DW$T$19)
    2673                      .dwattr $C$DW$259, DW_AT_name("INTx3")
    2674                      .dwattr $C$DW$259, DW_AT_TI_symbol_name("_INTx3")
    2675                      .dwattr $C$DW$259, DW_AT_bit_offset(0x0d)
    2676                      .dwattr $C$DW$259, DW_AT_bit_size(0x01)
    2677                      .dwattr $C$DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2678                      .dwattr $C$DW$259, DW_AT_accessibility(DW_ACCESS_public)
    2679              
    2680              $C$DW$260       .dwtag  DW_TAG_member
    2681                      .dwattr $C$DW$260, DW_AT_type(*$C$DW$T$19)
    2682                      .dwattr $C$DW$260, DW_AT_name("INTx4")
    2683                      .dwattr $C$DW$260, DW_AT_TI_symbol_name("_INTx4")
    2684                      .dwattr $C$DW$260, DW_AT_bit_offset(0x0c)
    2685                      .dwattr $C$DW$260, DW_AT_bit_size(0x01)
    2686                      .dwattr $C$DW$260, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2687                      .dwattr $C$DW$260, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.1 Sun Feb 26 22:53:28 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_PieVect.asm                                                  PAGE   54

    2688              
    2689              $C$DW$261       .dwtag  DW_TAG_member
    2690                      .dwattr $C$DW$261, DW_AT_type(*$C$DW$T$19)
    2691                      .dwattr $C$DW$261, DW_AT_name("INTx5")
    2692                      .dwattr $C$DW$261, DW_AT_TI_symbol_name("_INTx5")
    2693                      .dwattr $C$DW$261, DW_AT_bit_offset(0x0b)
    2694                      .dwattr $C$DW$261, DW_AT_bit_size(0x01)
    2695                      .dwattr $C$DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2696                      .dwattr $C$DW$261, DW_AT_accessibility(DW_ACCESS_public)
    2697              
    2698              $C$DW$262       .dwtag  DW_TAG_member
    2699                      .dwattr $C$DW$262, DW_AT_type(*$C$DW$T$19)
    2700                      .dwattr $C$DW$262, DW_AT_name("INTx6")
    2701                      .dwattr $C$DW$262, DW_AT_TI_symbol_name("_INTx6")
    2702                      .dwattr $C$DW$262, DW_AT_bit_offset(0x0a)
    2703                      .dwattr $C$DW$262, DW_AT_bit_size(0x01)
    2704                      .dwattr $C$DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2705                      .dwattr $C$DW$262, DW_AT_accessibility(DW_ACCESS_public)
    2706              
    2707              $C$DW$263       .dwtag  DW_TAG_member
    2708                      .dwattr $C$DW$263, DW_AT_type(*$C$DW$T$19)
    2709                      .dwattr $C$DW$263, DW_AT_name("INTx7")
    2710                      .dwattr $C$DW$263, DW_AT_TI_symbol_name("_INTx7")
    2711                      .dwattr $C$DW$263, DW_AT_bit_offset(0x09)
    2712                      .dwattr $C$DW$263, DW_AT_bit_size(0x01)
    2713                      .dwattr $C$DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2714                      .dwattr $C$DW$263, DW_AT_accessibility(DW_ACCESS_public)
    2715              
    2716              $C$DW$264       .dwtag  DW_TAG_member
    2717                      .dwattr $C$DW$264, DW_AT_type(*$C$DW$T$19)
    2718                      .dwattr $C$DW$264, DW_AT_name("INTx8")
    2719                      .dwattr $C$DW$264, DW_AT_TI_symbol_name("_INTx8")
    2720                      .dwattr $C$DW$264, DW_AT_bit_offset(0x08)
    2721                      .dwattr $C$DW$264, DW_AT_bit_size(0x01)
    2722                      .dwattr $C$DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2723                      .dwattr $C$DW$264, DW_AT_accessibility(DW_ACCESS_public)
    2724              
    2725              $C$DW$265       .dwtag  DW_TAG_member
    2726                      .dwattr $C$DW$265, DW_AT_type(*$C$DW$T$19)
    2727                      .dwattr $C$DW$265, DW_AT_name("INTx9")
    2728                      .dwattr $C$DW$265, DW_AT_TI_symbol_name("_INTx9")
    2729                      .dwattr $C$DW$265, DW_AT_bit_offset(0x07)
    2730                      .dwattr $C$DW$265, DW_AT_bit_size(0x01)
    2731                      .dwattr $C$DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2732                      .dwattr $C$DW$265, DW_AT_accessibility(DW_ACCESS_public)
    2733              
    2734              $C$DW$266       .dwtag  DW_TAG_member
    2735                      .dwattr $C$DW$266, DW_AT_type(*$C$DW$T$19)
    2736                      .dwattr $C$DW$266, DW_AT_name("INTx10")
    2737                      .dwattr $C$DW$266, DW_AT_TI_symbol_name("_INTx10")
    2738                      .dwattr $C$DW$266, DW_AT_bit_offset(0x06)
    2739                      .dwattr $C$DW$266, DW_AT_bit_size(0x01)
    2740                      .dwattr $C$DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2741                      .dwattr $C$DW$266, DW_AT_accessibility(DW_ACCESS_public)
    2742              
TMS320C2000 Assembler PC v15.12.1 Sun Feb 26 22:53:28 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_PieVect.asm                                                  PAGE   55

    2743              $C$DW$267       .dwtag  DW_TAG_member
    2744                      .dwattr $C$DW$267, DW_AT_type(*$C$DW$T$19)
    2745                      .dwattr $C$DW$267, DW_AT_name("INTx11")
    2746                      .dwattr $C$DW$267, DW_AT_TI_symbol_name("_INTx11")
    2747                      .dwattr $C$DW$267, DW_AT_bit_offset(0x05)
    2748                      .dwattr $C$DW$267, DW_AT_bit_size(0x01)
    2749                      .dwattr $C$DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2750                      .dwattr $C$DW$267, DW_AT_accessibility(DW_ACCESS_public)
    2751              
    2752              $C$DW$268       .dwtag  DW_TAG_member
    2753                      .dwattr $C$DW$268, DW_AT_type(*$C$DW$T$19)
    2754                      .dwattr $C$DW$268, DW_AT_name("INTx12")
    2755                      .dwattr $C$DW$268, DW_AT_TI_symbol_name("_INTx12")
    2756                      .dwattr $C$DW$268, DW_AT_bit_offset(0x04)
    2757                      .dwattr $C$DW$268, DW_AT_bit_size(0x01)
    2758                      .dwattr $C$DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2759                      .dwattr $C$DW$268, DW_AT_accessibility(DW_ACCESS_public)
    2760              
    2761              $C$DW$269       .dwtag  DW_TAG_member
    2762                      .dwattr $C$DW$269, DW_AT_type(*$C$DW$T$19)
    2763                      .dwattr $C$DW$269, DW_AT_name("INTx13")
    2764                      .dwattr $C$DW$269, DW_AT_TI_symbol_name("_INTx13")
    2765                      .dwattr $C$DW$269, DW_AT_bit_offset(0x03)
    2766                      .dwattr $C$DW$269, DW_AT_bit_size(0x01)
    2767                      .dwattr $C$DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2768                      .dwattr $C$DW$269, DW_AT_accessibility(DW_ACCESS_public)
    2769              
    2770              $C$DW$270       .dwtag  DW_TAG_member
    2771                      .dwattr $C$DW$270, DW_AT_type(*$C$DW$T$19)
    2772                      .dwattr $C$DW$270, DW_AT_name("INTx14")
    2773                      .dwattr $C$DW$270, DW_AT_TI_symbol_name("_INTx14")
    2774                      .dwattr $C$DW$270, DW_AT_bit_offset(0x02)
    2775                      .dwattr $C$DW$270, DW_AT_bit_size(0x01)
    2776                      .dwattr $C$DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2777                      .dwattr $C$DW$270, DW_AT_accessibility(DW_ACCESS_public)
    2778              
    2779              $C$DW$271       .dwtag  DW_TAG_member
    2780                      .dwattr $C$DW$271, DW_AT_type(*$C$DW$T$19)
    2781                      .dwattr $C$DW$271, DW_AT_name("INTx15")
    2782                      .dwattr $C$DW$271, DW_AT_TI_symbol_name("_INTx15")
    2783                      .dwattr $C$DW$271, DW_AT_bit_offset(0x01)
    2784                      .dwattr $C$DW$271, DW_AT_bit_size(0x01)
    2785                      .dwattr $C$DW$271, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2786                      .dwattr $C$DW$271, DW_AT_accessibility(DW_ACCESS_public)
    2787              
    2788              $C$DW$272       .dwtag  DW_TAG_member
    2789                      .dwattr $C$DW$272, DW_AT_type(*$C$DW$T$19)
    2790                      .dwattr $C$DW$272, DW_AT_name("INTx16")
    2791                      .dwattr $C$DW$272, DW_AT_TI_symbol_name("_INTx16")
    2792                      .dwattr $C$DW$272, DW_AT_bit_offset(0x00)
    2793                      .dwattr $C$DW$272, DW_AT_bit_size(0x01)
    2794                      .dwattr $C$DW$272, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2795                      .dwattr $C$DW$272, DW_AT_accessibility(DW_ACCESS_public)
    2796              
    2797                      .dwendtag $C$DW$T$34
TMS320C2000 Assembler PC v15.12.1 Sun Feb 26 22:53:28 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_PieVect.asm                                                  PAGE   56

    2798              
    2799              
    2800              $C$DW$T$35      .dwtag  DW_TAG_union_type
    2801                      .dwattr $C$DW$T$35, DW_AT_name("PIEIER3_REG")
    2802                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x01)
    2803              $C$DW$273       .dwtag  DW_TAG_member
    2804                      .dwattr $C$DW$273, DW_AT_type(*$C$DW$T$19)
    2805                      .dwattr $C$DW$273, DW_AT_name("all")
    2806                      .dwattr $C$DW$273, DW_AT_TI_symbol_name("_all")
    2807                      .dwattr $C$DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2808                      .dwattr $C$DW$273, DW_AT_accessibility(DW_ACCESS_public)
    2809              
    2810              $C$DW$274       .dwtag  DW_TAG_member
    2811                      .dwattr $C$DW$274, DW_AT_type(*$C$DW$T$34)
    2812                      .dwattr $C$DW$274, DW_AT_name("bit")
    2813                      .dwattr $C$DW$274, DW_AT_TI_symbol_name("_bit")
    2814                      .dwattr $C$DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2815                      .dwattr $C$DW$274, DW_AT_accessibility(DW_ACCESS_public)
    2816              
    2817                      .dwendtag $C$DW$T$35
    2818              
    2819              
    2820              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    2821                      .dwattr $C$DW$T$36, DW_AT_name("PIEIER4_BITS")
    2822                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x01)
    2823              $C$DW$275       .dwtag  DW_TAG_member
    2824                      .dwattr $C$DW$275, DW_AT_type(*$C$DW$T$19)
    2825                      .dwattr $C$DW$275, DW_AT_name("INTx1")
    2826                      .dwattr $C$DW$275, DW_AT_TI_symbol_name("_INTx1")
    2827                      .dwattr $C$DW$275, DW_AT_bit_offset(0x0f)
    2828                      .dwattr $C$DW$275, DW_AT_bit_size(0x01)
    2829                      .dwattr $C$DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2830                      .dwattr $C$DW$275, DW_AT_accessibility(DW_ACCESS_public)
    2831              
    2832              $C$DW$276       .dwtag  DW_TAG_member
    2833                      .dwattr $C$DW$276, DW_AT_type(*$C$DW$T$19)
    2834                      .dwattr $C$DW$276, DW_AT_name("INTx2")
    2835                      .dwattr $C$DW$276, DW_AT_TI_symbol_name("_INTx2")
    2836                      .dwattr $C$DW$276, DW_AT_bit_offset(0x0e)
    2837                      .dwattr $C$DW$276, DW_AT_bit_size(0x01)
    2838                      .dwattr $C$DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2839                      .dwattr $C$DW$276, DW_AT_accessibility(DW_ACCESS_public)
    2840              
    2841              $C$DW$277       .dwtag  DW_TAG_member
    2842                      .dwattr $C$DW$277, DW_AT_type(*$C$DW$T$19)
    2843                      .dwattr $C$DW$277, DW_AT_name("INTx3")
    2844                      .dwattr $C$DW$277, DW_AT_TI_symbol_name("_INTx3")
    2845                      .dwattr $C$DW$277, DW_AT_bit_offset(0x0d)
    2846                      .dwattr $C$DW$277, DW_AT_bit_size(0x01)
    2847                      .dwattr $C$DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2848                      .dwattr $C$DW$277, DW_AT_accessibility(DW_ACCESS_public)
    2849              
    2850              $C$DW$278       .dwtag  DW_TAG_member
    2851                      .dwattr $C$DW$278, DW_AT_type(*$C$DW$T$19)
    2852                      .dwattr $C$DW$278, DW_AT_name("INTx4")
TMS320C2000 Assembler PC v15.12.1 Sun Feb 26 22:53:28 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_PieVect.asm                                                  PAGE   57

    2853                      .dwattr $C$DW$278, DW_AT_TI_symbol_name("_INTx4")
    2854                      .dwattr $C$DW$278, DW_AT_bit_offset(0x0c)
    2855                      .dwattr $C$DW$278, DW_AT_bit_size(0x01)
    2856                      .dwattr $C$DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2857                      .dwattr $C$DW$278, DW_AT_accessibility(DW_ACCESS_public)
    2858              
    2859              $C$DW$279       .dwtag  DW_TAG_member
    2860                      .dwattr $C$DW$279, DW_AT_type(*$C$DW$T$19)
    2861                      .dwattr $C$DW$279, DW_AT_name("INTx5")
    2862                      .dwattr $C$DW$279, DW_AT_TI_symbol_name("_INTx5")
    2863                      .dwattr $C$DW$279, DW_AT_bit_offset(0x0b)
    2864                      .dwattr $C$DW$279, DW_AT_bit_size(0x01)
    2865                      .dwattr $C$DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2866                      .dwattr $C$DW$279, DW_AT_accessibility(DW_ACCESS_public)
    2867              
    2868              $C$DW$280       .dwtag  DW_TAG_member
    2869                      .dwattr $C$DW$280, DW_AT_type(*$C$DW$T$19)
    2870                      .dwattr $C$DW$280, DW_AT_name("INTx6")
    2871                      .dwattr $C$DW$280, DW_AT_TI_symbol_name("_INTx6")
    2872                      .dwattr $C$DW$280, DW_AT_bit_offset(0x0a)
    2873                      .dwattr $C$DW$280, DW_AT_bit_size(0x01)
    2874                      .dwattr $C$DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2875                      .dwattr $C$DW$280, DW_AT_accessibility(DW_ACCESS_public)
    2876              
    2877              $C$DW$281       .dwtag  DW_TAG_member
