TMS320C2000 Assembler PC v15.12.1 Sun Feb 26 22:53:28 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                   PC v15.12.1.LTS *
       3              ;* Date/Time created: Sun Feb 26 22:53:28 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --cla_support=cla0 --float_support=fpu32 --hll_source=on --mem_model:cod
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/controlSUITE/device_support/F2837xD/v170/F2837xD_common/source/F2
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v15.12.1.LTS Copyright (c) 1996-201
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Keith\workspace_v6_1_3\IDDK_PM_Servo_F2837x-v2\F2837x_RAM"
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram
      15                      .dwattr $C$DW$1, DW_AT_name("F28x_usDelay")

    1972                      .dwcfi  cfa_offset, -2
    1973                      .dwcfi  save_reg_to_mem, 26, 0
    1974 000002d5 7622   EALLOW
    1975 000002d6 761F!         MOVW      DP,#_CpuSysRegs+118   ; [CPU_U] 
         000002d7 0001 
    1976                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xD/v170/F2837xD_common/source/F2837xD_SysCtrl.c"
    1977 000002d8 1A36!         OR        @_CpuSysRegs+118,#0x0003 ; [CPU_] |691| 
         000002d9 0003 
    1978 000002da 761A   EDIS
    1979 000002db       $C$L25:    
    1980                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xD/v170/F2837xD_common/source/F2837xD_SysCtrl.c"
    1981 000002db 8F00!         MOVL      XAR4,#_DevCfgRegs     ; [CPU_U] |693| 
         000002dc 0000 
    1982 000002dd A8A9          MOVL      ACC,XAR4              ; [CPU_] |693| 
    1983 000002de FF10          ADD       ACC,#293 << 0         ; [CPU_] |693| 
         000002df 0125 
    1984 000002e0 83A9          MOVL      XAR5,ACC              ; [CPU_] |693| 
    1985 000002e1 92C5          MOV       AL,*+XAR5[0]          ; [CPU_] |693| 
    1986 000002e2 9003          ANDB      AL,#0x03              ; [CPU_] |693| 
    1987 000002e3 6007          B         $C$L26,NEQ            ; [CPU_] |693| 
    1988                      ; branchcc occurs ; [] |693| 
    1989 000002e4 A8A9          MOVL      ACC,XAR4              ; [CPU_] |693| 
    1990 000002e5 FF12          ADD       ACC,#73 << 2          ; [CPU_] |693| 
         000002e6 0049 
    1991 000002e7 8AA9          MOVL      XAR4,ACC              ; [CPU_] |693| 
    1992 000002e8 40C4          TBIT      *+XAR4[0],#0          ; [CPU_] |693| 
    1993 000002e9 6DF2          B         $C$L25,TC             ; [CPU_] |693| 
    1994                      ; branchcc occurs ; [] |693| 
    1995 000002ea       $C$L26:    
    1996 000002ea FF69          SPM       #0                    ; [CPU_] 
    1997                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xD/v170/F2837xD_common/source/F2837xD_SysCtrl.c"
    1998              $C$DW$78        .dwtag  DW_TAG_TI_branch
    1999                      .dwattr $C$DW$78, DW_AT_low_pc(0x00)
    2000                      .dwattr $C$DW$78, DW_AT_name("_DisablePeripheralClocks")
    2001                      .dwattr $C$DW$78, DW_AT_TI_call
    2002              
    2003 000002eb 7640'         LCR       #_DisablePeripheralClocks ; [CPU_] |694| 
         000002ec 00E0 
    2004                      ; call occurs [#_DisablePeripheralClocks] ; [] |694| 
    2005 000002ed 7622   EALLOW
    2006 000002ee 761F!         MOVW      DP,#_ClkCfgRegs+14    ; [CPU_U] 
         000002ef 0000 
    2007                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xD/v170/F2837xD_common/source/F2837xD_SysCtrl.c"
    2008 000002f0 180E!         AND       @_ClkCfgRegs+14,#0xfffd ; [CPU_] |696| 
         000002f1 FFFD 
    2009                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xD/v170/F2837xD_common/source/F2837xD_SysCtrl.c"
    2010 000002f2 180E!         AND       @_ClkCfgRegs+14,#0xfffe ; [CPU_] |697| 
         000002f3 FFFE 
    2011 000002f4 761A   EDIS
TMS320C2000 Assembler PC v15.12.1 Sun Feb 26 22:53:28 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   41

    2012 000002f5 7621   IDLE
    2013 000002f6 FF69          SPM       #0                    ; [CPU_] 
    2014              $C$DW$79        .dwtag  DW_TAG_TI_branch
    2015                      .dwattr $C$DW$79, DW_AT_low_pc(0x00)
    2016                      .dwattr $C$DW$79, DW_AT_TI_return
    2017              
    2018 000002f7 0006          LRETR     ; [CPU_] 
    2019                      ; return occurs ; [] 
    2020                      .dwattr $C$DW$77, DW_AT_TI_end_file("C:/ti/controlSUITE/device_support/F2837xD/v170/F2837xD_common/so
    2021                      .dwattr $C$DW$77, DW_AT_TI_end_line(0x2bd)
    2022                      .dwattr $C$DW$77, DW_AT_TI_end_column(0x01)
    2023                      .dwendentry
    2024                      .dwendtag $C$DW$77
    2025              
    2026              ;**************************************************************
    2027              ;* UNDEFINED EXTERNAL REFERENCES                              *
    2028              ;**************************************************************
    2029                      .global _F28x_usDelay
    2030                      .global _GPIO_EnableUnbondedIOPullups
    2031                      .global _DcsmZ1Regs
    2032                      .global _DcsmZ2Regs
    2033                      .global _Flash0EccRegs
    2034                      .global _WdRegs
    2035                      .global _ClkCfgRegs
    2036                      .global _AnalogSubsysRegs
    2037                      .global _CpuSysRegs
    2038                      .global _DevCfgRegs
    2039                      .global _Flash0CtrlRegs
    2040              
    2041              ;***************************************************************
    2042              ;* TYPE INFORMATION                                            *
    2043              ;***************************************************************
    2044              
    2045              $C$DW$T$25      .dwtag  DW_TAG_structure_type
    2046                      .dwattr $C$DW$T$25, DW_AT_name("ANALOG_SUBSYS_REGS")
    2047                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x48)
    2048              $C$DW$80        .dwtag  DW_TAG_member
    2049                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$20)
    2050                      .dwattr $C$DW$80, DW_AT_name("rsvd1")
    2051                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_rsvd1")
    2052                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2053                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    2054              
    2055              $C$DW$81        .dwtag  DW_TAG_member
    2056                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$192)
    2057                      .dwattr $C$DW$81, DW_AT_name("INTOSC1TRIM")
    2058                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_INTOSC1TRIM")
    2059                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    2060                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    2061              
    2062              $C$DW$82        .dwtag  DW_TAG_member
    2063                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$194)
    2064                      .dwattr $C$DW$82, DW_AT_name("INTOSC2TRIM")
    2065                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_INTOSC2TRIM")
    2066                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
TMS320C2000 Assembler PC v15.12.1 Sun Feb 26 22:53:28 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   42

    2067                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    2068              
    2069              $C$DW$83        .dwtag  DW_TAG_member
    2070                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$21)
    2071                      .dwattr $C$DW$83, DW_AT_name("rsvd2")
    2072                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_rsvd2")
    2073                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    2074                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    2075              
    2076              $C$DW$84        .dwtag  DW_TAG_member
    2077                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$292)
    2078                      .dwattr $C$DW$84, DW_AT_name("TSNSCTL")
    2079                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_TSNSCTL")
    2080                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    2081                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    2082              
    2083              $C$DW$85        .dwtag  DW_TAG_member
    2084                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$22)
    2085                      .dwattr $C$DW$85, DW_AT_name("rsvd3")
    2086                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_rsvd3")
    2087                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
    2088                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    2089              
    2090              $C$DW$86        .dwtag  DW_TAG_member
    2091                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$198)
    2092                      .dwattr $C$DW$86, DW_AT_name("LOCK")
    2093                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_LOCK")
    2094                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    2095                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    2096              
    2097              $C$DW$87        .dwtag  DW_TAG_member
    2098                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$23)
    2099                      .dwattr $C$DW$87, DW_AT_name("rsvd4")
    2100                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_rsvd4")
    2101                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    2102                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    2103              
    2104              $C$DW$88        .dwtag  DW_TAG_member
    2105                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$28)
    2106                      .dwattr $C$DW$88, DW_AT_name("ANAREFTRIMA")
    2107                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_ANAREFTRIMA")
    2108                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    2109                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    2110              
    2111              $C$DW$89        .dwtag  DW_TAG_member
    2112                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$30)
    2113                      .dwattr $C$DW$89, DW_AT_name("ANAREFTRIMB")
    2114                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_ANAREFTRIMB")
    2115                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    2116                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    2117              
    2118              $C$DW$90        .dwtag  DW_TAG_member
    2119                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$32)
    2120                      .dwattr $C$DW$90, DW_AT_name("ANAREFTRIMC")
    2121                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_ANAREFTRIMC")
TMS320C2000 Assembler PC v15.12.1 Sun Feb 26 22:53:28 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   43

    2122                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    2123                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    2124              
    2125              $C$DW$91        .dwtag  DW_TAG_member
    2126                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$34)
    2127                      .dwattr $C$DW$91, DW_AT_name("ANAREFTRIMD")
    2128                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_ANAREFTRIMD")
    2129                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    2130                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    2131              
    2132              $C$DW$92        .dwtag  DW_TAG_member
    2133                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$24)
    2134                      .dwattr $C$DW$92, DW_AT_name("rsvd5")
    2135                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_rsvd5")
    2136                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
    2137                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    2138              
    2139                      .dwendtag $C$DW$T$25
    2140              
    2141              $C$DW$93        .dwtag  DW_TAG_TI_far_type
    2142                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$25)
    2143              
    2144              $C$DW$T$340     .dwtag  DW_TAG_volatile_type
    2145                      .dwattr $C$DW$T$340, DW_AT_type(*$C$DW$93)
    2146              
    2147              
    2148              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    2149                      .dwattr $C$DW$T$26, DW_AT_name("ANAREFTRIMA_BITS")
    2150                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x02)
    2151              $C$DW$94        .dwtag  DW_TAG_member
    2152                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$19)
    2153                      .dwattr $C$DW$94, DW_AT_name("BGVALTRIM")
    2154                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_BGVALTRIM")
    2155                      .dwattr $C$DW$94, DW_AT_bit_offset(0x0a)
    2156                      .dwattr $C$DW$94, DW_AT_bit_size(0x06)
    2157                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2158                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    2159              
    2160              $C$DW$95        .dwtag  DW_TAG_member
    2161                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$19)
    2162                      .dwattr $C$DW$95, DW_AT_name("BGSLOPETRIM")
    2163                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_BGSLOPETRIM")
    2164                      .dwattr $C$DW$95, DW_AT_bit_offset(0x05)
    2165                      .dwattr $C$DW$95, DW_AT_bit_size(0x05)
    2166                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2167                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    2168              
    2169              $C$DW$96        .dwtag  DW_TAG_member
    2170                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$19)
    2171                      .dwattr $C$DW$96, DW_AT_name("IREFTRIM")
    2172                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_IREFTRIM")
    2173                      .dwattr $C$DW$96, DW_AT_bit_offset(0x00)
    2174                      .dwattr $C$DW$96, DW_AT_bit_size(0x05)
    2175                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2176                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.1 Sun Feb 26 22:53:28 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   44

    2177              
    2178              $C$DW$97        .dwtag  DW_TAG_member
    2179                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$19)
    2180                      .dwattr $C$DW$97, DW_AT_name("rsvd1")
    2181                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_rsvd1")
    2182                      .dwattr $C$DW$97, DW_AT_bit_offset(0x08)
    2183                      .dwattr $C$DW$97, DW_AT_bit_size(0x08)
    2184                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2185                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    2186              
    2187              $C$DW$98        .dwtag  DW_TAG_member
    2188                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$19)
    2189                      .dwattr $C$DW$98, DW_AT_name("rsvd2")
    2190                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_rsvd2")
    2191                      .dwattr $C$DW$98, DW_AT_bit_offset(0x00)
    2192                      .dwattr $C$DW$98, DW_AT_bit_size(0x08)
    2193                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2194                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    2195              
    2196                      .dwendtag $C$DW$T$26
    2197              
    2198              
    2199              $C$DW$T$28      .dwtag  DW_TAG_union_type
    2200                      .dwattr $C$DW$T$28, DW_AT_name("ANAREFTRIMA_REG")
    2201                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x02)
    2202              $C$DW$99        .dwtag  DW_TAG_member
    2203                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$27)
    2204                      .dwattr $C$DW$99, DW_AT_name("all")
    2205                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_all")
    2206                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2207                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    2208              
    2209              $C$DW$100       .dwtag  DW_TAG_member
    2210                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$26)
    2211                      .dwattr $C$DW$100, DW_AT_name("bit")
    2212                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_bit")
    2213                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2214                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    2215              
    2216                      .dwendtag $C$DW$T$28
    2217              
    2218              
    2219              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    2220                      .dwattr $C$DW$T$29, DW_AT_name("ANAREFTRIMB_BITS")
    2221                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x02)
    2222              $C$DW$101       .dwtag  DW_TAG_member
    2223                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$19)
    2224                      .dwattr $C$DW$101, DW_AT_name("BGVALTRIM")
    2225                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_BGVALTRIM")
    2226                      .dwattr $C$DW$101, DW_AT_bit_offset(0x0a)
    2227                      .dwattr $C$DW$101, DW_AT_bit_size(0x06)
    2228                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2229                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    2230              
    2231              $C$DW$102       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v15.12.1 Sun Feb 26 22:53:28 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   45

    2232                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$19)
    2233                      .dwattr $C$DW$102, DW_AT_name("BGSLOPETRIM")
    2234                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_BGSLOPETRIM")
    2235                      .dwattr $C$DW$102, DW_AT_bit_offset(0x05)
    2236                      .dwattr $C$DW$102, DW_AT_bit_size(0x05)
    2237                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2238                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    2239              
    2240              $C$DW$103       .dwtag  DW_TAG_member
    2241                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$19)
    2242                      .dwattr $C$DW$103, DW_AT_name("IREFTRIM")
    2243                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_IREFTRIM")
    2244                      .dwattr $C$DW$103, DW_AT_bit_offset(0x00)
    2245                      .dwattr $C$DW$103, DW_AT_bit_size(0x05)
    2246                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2247                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    2248              
    2249              $C$DW$104       .dwtag  DW_TAG_member
    2250                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$19)
    2251                      .dwattr $C$DW$104, DW_AT_name("rsvd1")
    2252                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_rsvd1")
    2253                      .dwattr $C$DW$104, DW_AT_bit_offset(0x08)
    2254                      .dwattr $C$DW$104, DW_AT_bit_size(0x08)
    2255                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2256                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    2257              
    2258              $C$DW$105       .dwtag  DW_TAG_member
    2259                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$19)
    2260                      .dwattr $C$DW$105, DW_AT_name("rsvd2")
    2261                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_rsvd2")
    2262                      .dwattr $C$DW$105, DW_AT_bit_offset(0x00)
    2263                      .dwattr $C$DW$105, DW_AT_bit_size(0x08)
    2264                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2265                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    2266              
    2267                      .dwendtag $C$DW$T$29
    2268              
    2269              
    2270              $C$DW$T$30      .dwtag  DW_TAG_union_type
    2271                      .dwattr $C$DW$T$30, DW_AT_name("ANAREFTRIMB_REG")
    2272                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x02)
    2273              $C$DW$106       .dwtag  DW_TAG_member
    2274                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$27)
    2275                      .dwattr $C$DW$106, DW_AT_name("all")
    2276                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_all")
    2277                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2278                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    2279              
    2280              $C$DW$107       .dwtag  DW_TAG_member
    2281                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$29)
    2282                      .dwattr $C$DW$107, DW_AT_name("bit")
    2283                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_bit")
    2284                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2285                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    2286              
TMS320C2000 Assembler PC v15.12.1 Sun Feb 26 22:53:28 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   46

    2287                      .dwendtag $C$DW$T$30
    2288              
    2289              
    2290              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    2291                      .dwattr $C$DW$T$31, DW_AT_name("ANAREFTRIMC_BITS")
    2292                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x02)
    2293              $C$DW$108       .dwtag  DW_TAG_member
    2294                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$19)
    2295                      .dwattr $C$DW$108, DW_AT_name("BGVALTRIM")
    2296                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_BGVALTRIM")
    2297                      .dwattr $C$DW$108, DW_AT_bit_offset(0x0a)
    2298                      .dwattr $C$DW$108, DW_AT_bit_size(0x06)
    2299                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2300                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    2301              
    2302              $C$DW$109       .dwtag  DW_TAG_member
    2303                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$19)
    2304                      .dwattr $C$DW$109, DW_AT_name("BGSLOPETRIM")
    2305                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_BGSLOPETRIM")
    2306                      .dwattr $C$DW$109, DW_AT_bit_offset(0x05)
    2307                      .dwattr $C$DW$109, DW_AT_bit_size(0x05)
    2308                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2309                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    2310              
    2311              $C$DW$110       .dwtag  DW_TAG_member
    2312                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$19)
    2313                      .dwattr $C$DW$110, DW_AT_name("IREFTRIM")
    2314                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_IREFTRIM")
    2315                      .dwattr $C$DW$110, DW_AT_bit_offset(0x00)
    2316                      .dwattr $C$DW$110, DW_AT_bit_size(0x05)
    2317                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2318                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    2319              
    2320              $C$DW$111       .dwtag  DW_TAG_member
    2321                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$19)
    2322                      .dwattr $C$DW$111, DW_AT_name("rsvd1")
    2323                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_rsvd1")
    2324                      .dwattr $C$DW$111, DW_AT_bit_offset(0x08)
    2325                      .dwattr $C$DW$111, DW_AT_bit_size(0x08)
    2326                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2327                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    2328              
    2329              $C$DW$112       .dwtag  DW_TAG_member
    2330                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$19)
    2331                      .dwattr $C$DW$112, DW_AT_name("rsvd2")
    2332                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_rsvd2")
    2333                      .dwattr $C$DW$112, DW_AT_bit_offset(0x00)
    2334                      .dwattr $C$DW$112, DW_AT_bit_size(0x08)
    2335                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2336                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    2337              
    2338                      .dwendtag $C$DW$T$31
    2339              
    2340              
    2341              $C$DW$T$32      .dwtag  DW_TAG_union_type
TMS320C2000 Assembler PC v15.12.1 Sun Feb 26 22:53:28 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   47

    2342                      .dwattr $C$DW$T$32, DW_AT_name("ANAREFTRIMC_REG")
    2343                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x02)
    2344              $C$DW$113       .dwtag  DW_TAG_member
    2345                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$27)
    2346                      .dwattr $C$DW$113, DW_AT_name("all")
    2347                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_all")
    2348                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2349                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    2350              
    2351              $C$DW$114       .dwtag  DW_TAG_member
    2352                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$31)
    2353                      .dwattr $C$DW$114, DW_AT_name("bit")
    2354                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_bit")
    2355                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2356                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    2357              
    2358                      .dwendtag $C$DW$T$32
    2359              
    2360              
    2361              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    2362                      .dwattr $C$DW$T$33, DW_AT_name("ANAREFTRIMD_BITS")
    2363                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x02)
    2364              $C$DW$115       .dwtag  DW_TAG_member
    2365                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$19)
    2366                      .dwattr $C$DW$115, DW_AT_name("BGVALTRIM")
    2367                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_BGVALTRIM")
    2368                      .dwattr $C$DW$115, DW_AT_bit_offset(0x0a)
    2369                      .dwattr $C$DW$115, DW_AT_bit_size(0x06)
    2370                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2371                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    2372              
    2373              $C$DW$116       .dwtag  DW_TAG_member
    2374                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$19)
    2375                      .dwattr $C$DW$116, DW_AT_name("BGSLOPETRIM")
    2376                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_BGSLOPETRIM")
    2377                      .dwattr $C$DW$116, DW_AT_bit_offset(0x05)
    2378                      .dwattr $C$DW$116, DW_AT_bit_size(0x05)
    2379                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2380                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    2381              
    2382              $C$DW$117       .dwtag  DW_TAG_member
    2383                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$19)
    2384                      .dwattr $C$DW$117, DW_AT_name("IREFTRIM")
    2385                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_IREFTRIM")
    2386                      .dwattr $C$DW$117, DW_AT_bit_offset(0x00)
    2387                      .dwattr $C$DW$117, DW_AT_bit_size(0x05)
    2388                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2389                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    2390              
    2391              $C$DW$118       .dwtag  DW_TAG_member
    2392                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$19)
    2393                      .dwattr $C$DW$118, DW_AT_name("rsvd1")
    2394                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_rsvd1")
    2395                      .dwattr $C$DW$118, DW_AT_bit_offset(0x08)
    2396                      .dwattr $C$DW$118, DW_AT_bit_size(0x08)
TMS320C2000 Assembler PC v15.12.1 Sun Feb 26 22:53:28 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   48

    2397                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2398                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    2399              
    2400              $C$DW$119       .dwtag  DW_TAG_member
    2401                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$19)
    2402                      .dwattr $C$DW$119, DW_AT_name("rsvd2")
    2403                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_rsvd2")
    2404                      .dwattr $C$DW$119, DW_AT_bit_offset(0x00)
    2405                      .dwattr $C$DW$119, DW_AT_bit_size(0x08)
    2406                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2407                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    2408              
    2409                      .dwendtag $C$DW$T$33
    2410              
    2411              
    2412              $C$DW$T$34      .dwtag  DW_TAG_union_type
    2413                      .dwattr $C$DW$T$34, DW_AT_name("ANAREFTRIMD_REG")
    2414                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x02)
    2415              $C$DW$120       .dwtag  DW_TAG_member
    2416                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$27)
    2417                      .dwattr $C$DW$120, DW_AT_name("all")
    2418                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_all")
    2419                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2420                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    2421              
    2422              $C$DW$121       .dwtag  DW_TAG_member
    2423                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$33)
    2424                      .dwattr $C$DW$121, DW_AT_name("bit")
    2425                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_bit")
    2426                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2427                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    2428              
    2429                      .dwendtag $C$DW$T$34
    2430              
    2431              
    2432              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    2433                      .dwattr $C$DW$T$35, DW_AT_name("AUXCLKDIVSEL_BITS")
    2434                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x02)
    2435              $C$DW$122       .dwtag  DW_TAG_member
    2436                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$19)
    2437                      .dwattr $C$DW$122, DW_AT_name("AUXPLLDIV")
    2438                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_AUXPLLDIV")
    2439                      .dwattr $C$DW$122, DW_AT_bit_offset(0x0e)
    2440                      .dwattr $C$DW$122, DW_AT_bit_size(0x02)
    2441                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2442                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    2443              
    2444              $C$DW$123       .dwtag  DW_TAG_member
    2445                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$19)
    2446                      .dwattr $C$DW$123, DW_AT_name("rsvd1")
    2447                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_rsvd1")
    2448                      .dwattr $C$DW$123, DW_AT_bit_offset(0x00)
    2449                      .dwattr $C$DW$123, DW_AT_bit_size(0x0e)
    2450                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2451                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.1 Sun Feb 26 22:53:28 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   49

    2452              
    2453              $C$DW$124       .dwtag  DW_TAG_member
    2454                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$19)
    2455                      .dwattr $C$DW$124, DW_AT_name("rsvd2")
    2456                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_rsvd2")
    2457                      .dwattr $C$DW$124, DW_AT_bit_offset(0x00)
    2458                      .dwattr $C$DW$124, DW_AT_bit_size(0x10)
    2459                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2460                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    2461              
    2462                      .dwendtag $C$DW$T$35
    2463              
    2464              
    2465              $C$DW$T$36      .dwtag  DW_TAG_union_type
    2466                      .dwattr $C$DW$T$36, DW_AT_name("AUXCLKDIVSEL_REG")
    2467                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x02)
    2468              $C$DW$125       .dwtag  DW_TAG_member
    2469                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$27)
    2470                      .dwattr $C$DW$125, DW_AT_name("all")
    2471                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_all")
    2472                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2473                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    2474              
    2475              $C$DW$126       .dwtag  DW_TAG_member
    2476                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$35)
    2477                      .dwattr $C$DW$126, DW_AT_name("bit")
    2478                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_bit")
    2479                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2480                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    2481              
    2482                      .dwendtag $C$DW$T$36
    2483              
    2484              
    2485              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    2486                      .dwattr $C$DW$T$37, DW_AT_name("AUXPLLCTL1_BITS")
    2487                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x02)
    2488              $C$DW$127       .dwtag  DW_TAG_member
    2489                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$19)
    2490                      .dwattr $C$DW$127, DW_AT_name("PLLEN")
    2491                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_PLLEN")
    2492                      .dwattr $C$DW$127, DW_AT_bit_offset(0x0f)
    2493                      .dwattr $C$DW$127, DW_AT_bit_size(0x01)
    2494                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2495                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    2496              
    2497              $C$DW$128       .dwtag  DW_TAG_member
    2498                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$19)
    2499                      .dwattr $C$DW$128, DW_AT_name("PLLCLKEN")
    2500                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_PLLCLKEN")
    2501                      .dwattr $C$DW$128, DW_AT_bit_offset(0x0e)
    2502                      .dwattr $C$DW$128, DW_AT_bit_size(0x01)
    2503                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2504                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    2505              
    2506              $C$DW$129       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v15.12.1 Sun Feb 26 22:53:28 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   50

    2507                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$19)
    2508                      .dwattr $C$DW$129, DW_AT_name("rsvd1")
    2509                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_rsvd1")
    2510                      .dwattr $C$DW$129, DW_AT_bit_offset(0x00)
    2511                      .dwattr $C$DW$129, DW_AT_bit_size(0x0e)
    2512                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2513                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    2514              
    2515              $C$DW$130       .dwtag  DW_TAG_member
    2516                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$19)
    2517                      .dwattr $C$DW$130, DW_AT_name("rsvd2")
    2518                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_rsvd2")
    2519                      .dwattr $C$DW$130, DW_AT_bit_offset(0x00)
    2520                      .dwattr $C$DW$130, DW_AT_bit_size(0x10)
    2521                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2522                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    2523              
    2524                      .dwendtag $C$DW$T$37
    2525              
    2526              
    2527              $C$DW$T$38      .dwtag  DW_TAG_union_type
    2528                      .dwattr $C$DW$T$38, DW_AT_name("AUXPLLCTL1_REG")
    2529                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x02)
    2530              $C$DW$131       .dwtag  DW_TAG_member
    2531                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$27)
    2532                      .dwattr $C$DW$131, DW_AT_name("all")
    2533                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_all")
    2534                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2535                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    2536              
    2537              $C$DW$132       .dwtag  DW_TAG_member
    2538                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$37)
    2539                      .dwattr $C$DW$132, DW_AT_name("bit")
    2540                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_bit")
    2541                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2542                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    2543              
    2544                      .dwendtag $C$DW$T$38
    2545              
    2546              
    2547              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    2548                      .dwattr $C$DW$T$39, DW_AT_name("AUXPLLMULT_BITS")
    2549                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x02)
    2550              $C$DW$133       .dwtag  DW_TAG_member
    2551                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$19)
    2552                      .dwattr $C$DW$133, DW_AT_name("IMULT")
    2553                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_IMULT")
    2554                      .dwattr $C$DW$133, DW_AT_bit_offset(0x09)
    2555                      .dwattr $C$DW$133, DW_AT_bit_size(0x07)
    2556                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2557                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    2558              
    2559              $C$DW$134       .dwtag  DW_TAG_member
    2560                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$19)
    2561                      .dwattr $C$DW$134, DW_AT_name("rsvd1")
TMS320C2000 Assembler PC v15.12.1 Sun Feb 26 22:53:28 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   51

    2562                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_rsvd1")
    2563                      .dwattr $C$DW$134, DW_AT_bit_offset(0x08)
    2564                      .dwattr $C$DW$134, DW_AT_bit_size(0x01)
    2565                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2566                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    2567              
    2568              $C$DW$135       .dwtag  DW_TAG_member
    2569                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$19)
    2570                      .dwattr $C$DW$135, DW_AT_name("FMULT")
    2571                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_FMULT")
    2572                      .dwattr $C$DW$135, DW_AT_bit_offset(0x06)
    2573                      .dwattr $C$DW$135, DW_AT_bit_size(0x02)
    2574                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2575                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    2576              
    2577              $C$DW$136       .dwtag  DW_TAG_member
    2578                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$19)
    2579                      .dwattr $C$DW$136, DW_AT_name("rsvd2")
    2580                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_rsvd2")
    2581                      .dwattr $C$DW$136, DW_AT_bit_offset(0x00)
    2582                      .dwattr $C$DW$136, DW_AT_bit_size(0x06)
    2583                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2584                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    2585              
    2586              $C$DW$137       .dwtag  DW_TAG_member
    2587                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$19)
    2588                      .dwattr $C$DW$137, DW_AT_name("rsvd3")
    2589                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_rsvd3")
    2590                      .dwattr $C$DW$137, DW_AT_bit_offset(0x00)
    2591                      .dwattr $C$DW$137, DW_AT_bit_size(0x10)
    2592                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2593                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    2594              
    2595                      .dwendtag $C$DW$T$39
    2596              
    2597              
    2598              $C$DW$T$40      .dwtag  DW_TAG_union_type
    2599                      .dwattr $C$DW$T$40, DW_AT_name("AUXPLLMULT_REG")
    2600                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x02)
    2601              $C$DW$138       .dwtag  DW_TAG_member
    2602                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$27)
    2603                      .dwattr $C$DW$138, DW_AT_name("all")
    2604                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_all")
    2605                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2606                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    2607              
    2608              $C$DW$139       .dwtag  DW_TAG_member
    2609                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$39)
    2610                      .dwattr $C$DW$139, DW_AT_name("bit")
    2611                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_bit")
    2612                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2613                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    2614              
    2615                      .dwendtag $C$DW$T$40
    2616              
TMS320C2000 Assembler PC v15.12.1 Sun Feb 26 22:53:28 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   52

    2617              
    2618              $C$DW$T$41      .dwtag  DW_TAG_structure_type
    2619                      .dwattr $C$DW$T$41, DW_AT_name("AUXPLLSTS_BITS")
    2620                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x02)
    2621              $C$DW$140       .dwtag  DW_TAG_member
    2622                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$19)
    2623                      .dwattr $C$DW$140, DW_AT_name("LOCKS")
    2624                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_LOCKS")
    2625                      .dwattr $C$DW$140, DW_AT_bit_offset(0x0f)
    2626                      .dwattr $C$DW$140, DW_AT_bit_size(0x01)
    2627                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2628                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    2629              
    2630              $C$DW$141       .dwtag  DW_TAG_member
    2631                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$19)
    2632                      .dwattr $C$DW$141, DW_AT_name("SLIPS")
    2633                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_SLIPS")
    2634                      .dwattr $C$DW$141, DW_AT_bit_offset(0x0e)
    2635                      .dwattr $C$DW$141, DW_AT_bit_size(0x01)
    2636                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2637                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    2638              
    2639              $C$DW$142       .dwtag  DW_TAG_member
    2640                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$19)
    2641                      .dwattr $C$DW$142, DW_AT_name("rsvd1")
    2642                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_rsvd1")
    2643                      .dwattr $C$DW$142, DW_AT_bit_offset(0x00)
    2644                      .dwattr $C$DW$142, DW_AT_bit_size(0x0e)
    2645                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2646                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    2647              
    2648              $C$DW$143       .dwtag  DW_TAG_member
    2649                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$19)
    2650                      .dwattr $C$DW$143, DW_AT_name("rsvd2")
    2651                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_rsvd2")
    2652                      .dwattr $C$DW$143, DW_AT_bit_offset(0x00)
    2653                      .dwattr $C$DW$143, DW_AT_bit_size(0x10)
    2654                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2655                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    2656              
    2657                      .dwendtag $C$DW$T$41
    2658              
    2659              
    2660              $C$DW$T$42      .dwtag  DW_TAG_union_type
    2661                      .dwattr $C$DW$T$42, DW_AT_name("AUXPLLSTS_REG")
    2662                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x02)
    2663              $C$DW$144       .dwtag  DW_TAG_member
    2664                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$27)
    2665                      .dwattr $C$DW$144, DW_AT_name("all")
    2666                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_all")
    2667                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2668                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    2669              
    2670              $C$DW$145       .dwtag  DW_TAG_member
    2671                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$41)
TMS320C2000 Assembler PC v15.12.1 Sun Feb 26 22:53:28 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   53

    2672                      .dwattr $C$DW$145, DW_AT_name("bit")
    2673                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_bit")
    2674                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2675                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    2676              
    2677                      .dwendtag $C$DW$T$42
    2678              
    2679              
    2680              $C$DW$T$43      .dwtag  DW_TAG_structure_type
    2681                      .dwattr $C$DW$T$43, DW_AT_name("CLKCFGLOCK1_BITS")
    2682                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x02)
    2683              $C$DW$146       .dwtag  DW_TAG_member
    2684                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$19)
    2685                      .dwattr $C$DW$146, DW_AT_name("CLKSRCCTL1")
    2686                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_CLKSRCCTL1")
    2687                      .dwattr $C$DW$146, DW_AT_bit_offset(0x0f)
    2688                      .dwattr $C$DW$146, DW_AT_bit_size(0x01)
    2689                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2690                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    2691              
    2692              $C$DW$147       .dwtag  DW_TAG_member
    2693                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$19)
    2694                      .dwattr $C$DW$147, DW_AT_name("CLKSRCCTL2")
    2695                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_CLKSRCCTL2")
    2696                      .dwattr $C$DW$147, DW_AT_bit_offset(0x0e)
    2697                      .dwattr $C$DW$147, DW_AT_bit_size(0x01)
    2698                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2699                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    2700              
    2701              $C$DW$148       .dwtag  DW_TAG_member
    2702                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$19)
    2703                      .dwattr $C$DW$148, DW_AT_name("CLKSRCCTL3")
    2704                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_CLKSRCCTL3")
    2705                      .dwattr $C$DW$148, DW_AT_bit_offset(0x0d)
    2706                      .dwattr $C$DW$148, DW_AT_bit_size(0x01)
    2707                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2708                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    2709              
    2710              $C$DW$149       .dwtag  DW_TAG_member
    2711                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$19)
    2712                      .dwattr $C$DW$149, DW_AT_name("SYSPLLCTL1")
    2713                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_SYSPLLCTL1")
    2714                      .dwattr $C$DW$149, DW_AT_bit_offset(0x0c)
    2715                      .dwattr $C$DW$149, DW_AT_bit_size(0x01)
    2716                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2717                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    2718              
    2719              $C$DW$150       .dwtag  DW_TAG_member
    2720                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$19)
    2721                      .dwattr $C$DW$150, DW_AT_name("SYSPLLCTL2")
    2722                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_SYSPLLCTL2")
    2723                      .dwattr $C$DW$150, DW_AT_bit_offset(0x0b)
    2724                      .dwattr $C$DW$150, DW_AT_bit_size(0x01)
    2725                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2726                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.1 Sun Feb 26 22:53:28 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   54

    2727              
    2728              $C$DW$151       .dwtag  DW_TAG_member
    2729                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$19)
    2730                      .dwattr $C$DW$151, DW_AT_name("SYSPLLCTL3")
    2731                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_SYSPLLCTL3")
    2732                      .dwattr $C$DW$151, DW_AT_bit_offset(0x0a)
    2733                      .dwattr $C$DW$151, DW_AT_bit_size(0x01)
    2734                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2735                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    2736              
    2737              $C$DW$152       .dwtag  DW_TAG_member
    2738                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$19)
    2739                      .dwattr $C$DW$152, DW_AT_name("SYSPLLMULT")
    2740                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_SYSPLLMULT")
    2741                      .dwattr $C$DW$152, DW_AT_bit_offset(0x09)
    2742                      .dwattr $C$DW$152, DW_AT_bit_size(0x01)
    2743                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2744                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    2745              
    2746              $C$DW$153       .dwtag  DW_TAG_member
    2747                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$19)
    2748                      .dwattr $C$DW$153, DW_AT_name("AUXPLLCTL1")
    2749                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_AUXPLLCTL1")
    2750                      .dwattr $C$DW$153, DW_AT_bit_offset(0x08)
    2751                      .dwattr $C$DW$153, DW_AT_bit_size(0x01)
    2752                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2753                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    2754              
    2755              $C$DW$154       .dwtag  DW_TAG_member
    2756                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$19)
    2757                      .dwattr $C$DW$154, DW_AT_name("rsvd1")
    2758                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_rsvd1")
    2759                      .dwattr $C$DW$154, DW_AT_bit_offset(0x07)
    2760                      .dwattr $C$DW$154, DW_AT_bit_size(0x01)
    2761                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2762                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    2763              
    2764              $C$DW$155       .dwtag  DW_TAG_member
    2765                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$19)
    2766                      .dwattr $C$DW$155, DW_AT_name("rsvd2")
    2767                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_rsvd2")
    2768                      .dwattr $C$DW$155, DW_AT_bit_offset(0x06)
    2769                      .dwattr $C$DW$155, DW_AT_bit_size(0x01)
    2770                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2771                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    2772              
    2773              $C$DW$156       .dwtag  DW_TAG_member
    2774                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$19)
    2775                      .dwattr $C$DW$156, DW_AT_name("AUXPLLMULT")
    2776                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_AUXPLLMULT")
    2777                      .dwattr $C$DW$156, DW_AT_bit_offset(0x05)
    2778                      .dwattr $C$DW$156, DW_AT_bit_size(0x01)
    2779                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2780                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    2781              
TMS320C2000 Assembler PC v15.12.1 Sun Feb 26 22:53:28 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   55

    2782              $C$DW$157       .dwtag  DW_TAG_member
    2783                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$19)
    2784                      .dwattr $C$DW$157, DW_AT_name("SYSCLKDIVSEL")
    2785                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_SYSCLKDIVSEL")
    2786                      .dwattr $C$DW$157, DW_AT_bit_offset(0x04)
    2787                      .dwattr $C$DW$157, DW_AT_bit_size(0x01)
    2788                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2789                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    2790              
    2791              $C$DW$158       .dwtag  DW_TAG_member
    2792                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$19)
    2793                      .dwattr $C$DW$158, DW_AT_name("AUXCLKDIVSEL")
    2794                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_AUXCLKDIVSEL")
    2795                      .dwattr $C$DW$158, DW_AT_bit_offset(0x03)
    2796                      .dwattr $C$DW$158, DW_AT_bit_size(0x01)
    2797                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2798                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    2799              
    2800              $C$DW$159       .dwtag  DW_TAG_member
    2801                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$19)
    2802                      .dwattr $C$DW$159, DW_AT_name("PERCLKDIVSEL")
    2803                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_PERCLKDIVSEL")
    2804                      .dwattr $C$DW$159, DW_AT_bit_offset(0x02)
    2805                      .dwattr $C$DW$159, DW_AT_bit_size(0x01)
    2806                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2807                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    2808              
    2809              $C$DW$160       .dwtag  DW_TAG_member
    2810                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$19)
    2811                      .dwattr $C$DW$160, DW_AT_name("rsvd3")
    2812                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_rsvd3")
    2813                      .dwattr $C$DW$160, DW_AT_bit_offset(0x01)
    2814                      .dwattr $C$DW$160, DW_AT_bit_size(0x01)
    2815                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2816                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    2817              
    2818              $C$DW$161       .dwtag  DW_TAG_member
    2819                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$19)
    2820                      .dwattr $C$DW$161, DW_AT_name("LOSPCP")
    2821                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_LOSPCP")
    2822                      .dwattr $C$DW$161, DW_AT_bit_offset(0x00)
    2823                      .dwattr $C$DW$161, DW_AT_bit_size(0x01)
    2824                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2825                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    2826              
    2827              $C$DW$162       .dwtag  DW_TAG_member
    2828                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$19)
    2829                      .dwattr $C$DW$162, DW_AT_name("rsvd4")
    2830                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_rsvd4")
    2831                      .dwattr $C$DW$162, DW_AT_bit_offset(0x00)
    2832                      .dwattr $C$DW$162, DW_AT_bit_size(0x10)
    2833                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2834                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    2835              
    2836                      .dwendtag $C$DW$T$43
TMS320C2000 Assembler PC v15.12.1 Sun Feb 26 22:53:28 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   56

    2837              
    2838              
    2839              $C$DW$T$44      .dwtag  DW_TAG_union_type
    2840                      .dwattr $C$DW$T$44, DW_AT_name("CLKCFGLOCK1_REG")
    2841                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x02)
    2842              $C$DW$163       .dwtag  DW_TAG_member
    2843                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$27)
    2844                      .dwattr $C$DW$163, DW_AT_name("all")
    2845                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_all")
    2846                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2847                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    2848              
    2849              $C$DW$164       .dwtag  DW_TAG_member
    2850                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$43)
    2851                      .dwattr $C$DW$164, DW_AT_name("bit")
    2852                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_bit")
    2853                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2854                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    2855              
    2856                      .dwendtag $C$DW$T$44
    2857              
    2858              
    2859              $C$DW$T$45      .dwtag  DW_TAG_structure_type
    2860                      .dwattr $C$DW$T$45, DW_AT_name("CLKSEM_BITS")
    2861                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x02)
    2862              $C$DW$165       .dwtag  DW_TAG_member
    2863                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$19)
    2864                      .dwattr $C$DW$165, DW_AT_name("SEM")
    2865                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_SEM")
    2866                      .dwattr $C$DW$165, DW_AT_bit_offset(0x0e)
    2867                      .dwattr $C$DW$165, DW_AT_bit_size(0x02)
    2868                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2869                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    2870              
    2871              $C$DW$166       .dwtag  DW_TAG_member
    2872                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$19)
    2873                      .dwattr $C$DW$166, DW_AT_name("rsvd1")
    2874                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_rsvd1")
    2875                      .dwattr $C$DW$166, DW_AT_bit_offset(0x00)
    2876                      .dwattr $C$DW$166, DW_AT_bit_size(0x0e)
    2877                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2878                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    2879              
    2880              $C$DW$167       .dwtag  DW_TAG_member
    2881                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$19)
    2882                      .dwattr $C$DW$167, DW_AT_name("KEY")
    2883                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_KEY")
    2884                      .dwattr $C$DW$167, DW_AT_bit_offset(0x00)
    2885                      .dwattr $C$DW$167, DW_AT_bit_size(0x10)
    2886                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2887                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    2888              
    2889                      .dwendtag $C$DW$T$45
    2890              
    2891              
TMS320C2000 Assembler PC v15.12.1 Sun Feb 26 22:53:28 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   57

    2892              $C$DW$T$46      .dwtag  DW_TAG_union_type
    2893                      .dwattr $C$DW$T$46, DW_AT_name("CLKSEM_REG")
    2894                      .dwattr $C$DW$T$46, DW_AT_byte_size(0x02)
    2895              $C$DW$168       .dwtag  DW_TAG_member
    2896                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$27)
    2897                      .dwattr $C$DW$168, DW_AT_name("all")
    2898                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_all")
    2899                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2900                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    2901              
    2902              $C$DW$169       .dwtag  DW_TAG_member
    2903                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$45)
    2904                      .dwattr $C$DW$169, DW_AT_name("bit")
    2905                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_bit")
    2906                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2907                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    2908              
    2909                      .dwendtag $C$DW$T$46
    2910              
    2911              
    2912              $C$DW$T$47      .dwtag  DW_TAG_structure_type
    2913                      .dwattr $C$DW$T$47, DW_AT_name("CLKSRCCTL1_BITS")
    2914                      .dwattr $C$DW$T$47, DW_AT_byte_size(0x02)
    2915              $C$DW$170       .dwtag  DW_TAG_member
    2916                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$19)
    2917                      .dwattr $C$DW$170, DW_AT_name("OSCCLKSRCSEL")
    2918                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_OSCCLKSRCSEL")
    2919                      .dwattr $C$DW$170, DW_AT_bit_offset(0x0e)
    2920                      .dwattr $C$DW$170, DW_AT_bit_size(0x02)
    2921                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2922                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    2923              
    2924              $C$DW$171       .dwtag  DW_TAG_member
    2925                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$19)
    2926                      .dwattr $C$DW$171, DW_AT_name("rsvd1")
    2927                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_rsvd1")
    2928                      .dwattr $C$DW$171, DW_AT_bit_offset(0x0d)
    2929                      .dwattr $C$DW$171, DW_AT_bit_size(0x01)
    2930                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2931                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    2932              
    2933              $C$DW$172       .dwtag  DW_TAG_member
    2934                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$19)
    2935                      .dwattr $C$DW$172, DW_AT_name("INTOSC2OFF")
    2936                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_INTOSC2OFF")
    2937                      .dwattr $C$DW$172, DW_AT_bit_offset(0x0c)
    2938                      .dwattr $C$DW$172, DW_AT_bit_size(0x01)
    2939                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2940                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    2941              
    2942              $C$DW$173       .dwtag  DW_TAG_member
    2943                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$19)
    2944                      .dwattr $C$DW$173, DW_AT_name("XTALOFF")
    2945                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_XTALOFF")
    2946                      .dwattr $C$DW$173, DW_AT_bit_offset(0x0b)
TMS320C2000 Assembler PC v15.12.1 Sun Feb 26 22:53:28 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   58

    2947                      .dwattr $C$DW$173, DW_AT_bit_size(0x01)
    2948                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2949                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    2950              
    2951              $C$DW$174       .dwtag  DW_TAG_member
    2952                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$19)
    2953                      .dwattr $C$DW$174, DW_AT_name("WDHALTI")
    2954                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_WDHALTI")
    2955                      .dwattr $C$DW$174, DW_AT_bit_offset(0x0a)
    2956                      .dwattr $C$DW$174, DW_AT_bit_size(0x01)
    2957                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2958                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    2959              
    2960              $C$DW$175       .dwtag  DW_TAG_member
    2961                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$19)
    2962                      .dwattr $C$DW$175, DW_AT_name("rsvd2")
    2963                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_rsvd2")
    2964                      .dwattr $C$DW$175, DW_AT_bit_offset(0x00)
    2965                      .dwattr $C$DW$175, DW_AT_bit_size(0x0a)
    2966                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2967                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    2968              
    2969              $C$DW$176       .dwtag  DW_TAG_member
    2970                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$19)
    2971                      .dwattr $C$DW$176, DW_AT_name("rsvd3")
    2972                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_rsvd3")
    2973                      .dwattr $C$DW$176, DW_AT_bit_offset(0x00)
    2974                      .dwattr $C$DW$176, DW_AT_bit_size(0x10)
    2975                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2976                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    2977              
    2978                      .dwendtag $C$DW$T$47
    2979              
    2980              
    2981              $C$DW$T$48      .dwtag  DW_TAG_union_type
    2982                      .dwattr $C$DW$T$48, DW_AT_name("CLKSRCCTL1_REG")
    2983                      .dwattr $C$DW$T$48, DW_AT_byte_size(0x02)
    2984              $C$DW$177       .dwtag  DW_TAG_member
    2985                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$27)
    2986                      .dwattr $C$DW$177, DW_AT_name("all")
    2987                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_all")
    2988                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2989                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    2990              
    2991              $C$DW$178       .dwtag  DW_TAG_member
    2992                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$47)
    2993                      .dwattr $C$DW$178, DW_AT_name("bit")
    2994                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_bit")
    2995                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2996                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    2997              
    2998                      .dwendtag $C$DW$T$48
    2999              
    3000              
    3001              $C$DW$T$49      .dwtag  DW_TAG_structure_type
TMS320C2000 Assembler PC v15.12.1 Sun Feb 26 22:53:28 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   59

    3002                      .dwattr $C$DW$T$49, DW_AT_name("CLKSRCCTL2_BITS")
    3003                      .dwattr $C$DW$T$49, DW_AT_byte_size(0x02)
    3004              $C$DW$179       .dwtag  DW_TAG_member
    3005                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$19)
    3006                      .dwattr $C$DW$179, DW_AT_name("AUXOSCCLKSRCSEL")
    3007                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_AUXOSCCLKSRCSEL")
    3008                      .dwattr $C$DW$179, DW_AT_bit_offset(0x0e)
    3009                      .dwattr $C$DW$179, DW_AT_bit_size(0x02)
    3010                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3011                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    3012              
    3013              $C$DW$180       .dwtag  DW_TAG_member
    3014                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$19)
    3015                      .dwattr $C$DW$180, DW_AT_name("CANABCLKSEL")
    3016                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_CANABCLKSEL")
    3017                      .dwattr $C$DW$180, DW_AT_bit_offset(0x0c)
    3018                      .dwattr $C$DW$180, DW_AT_bit_size(0x02)
    3019                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3020                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    3021              
    3022              $C$DW$181       .dwtag  DW_TAG_member
    3023                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$19)
    3024                      .dwattr $C$DW$181, DW_AT_name("CANBBCLKSEL")
    3025                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_CANBBCLKSEL")
    3026                      .dwattr $C$DW$181, DW_AT_bit_offset(0x0a)
    3027                      .dwattr $C$DW$181, DW_AT_bit_size(0x02)
    3028                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3029                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    3030              
    3031              $C$DW$182       .dwtag  DW_TAG_member
    3032                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$19)
    3033                      .dwattr $C$DW$182, DW_AT_name("rsvd1")
    3034                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_rsvd1")
    3035                      .dwattr $C$DW$182, DW_AT_bit_offset(0x08)
    3036                      .dwattr $C$DW$182, DW_AT_bit_size(0x02)
    3037                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3038                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    3039              
    3040              $C$DW$183       .dwtag  DW_TAG_member
    3041                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$19)
    3042                      .dwattr $C$DW$183, DW_AT_name("rsvd2")
    3043                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_rsvd2")
    3044                      .dwattr $C$DW$183, DW_AT_bit_offset(0x06)
    3045                      .dwattr $C$DW$183, DW_AT_bit_size(0x02)
    3046                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3047                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    3048              
    3049              $C$DW$184       .dwtag  DW_TAG_member
    3050                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$19)
    3051                      .dwattr $C$DW$184, DW_AT_name("rsvd3")
    3052                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_rsvd3")
    3053                      .dwattr $C$DW$184, DW_AT_bit_offset(0x00)
    3054                      .dwattr $C$DW$184, DW_AT_bit_size(0x06)
    3055                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3056                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.1 Sun Feb 26 22:53:28 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   60

    3057              
    3058              $C$DW$185       .dwtag  DW_TAG_member
    3059                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$19)
    3060                      .dwattr $C$DW$185, DW_AT_name("rsvd4")
    3061                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_rsvd4")
    3062                      .dwattr $C$DW$185, DW_AT_bit_offset(0x00)
    3063                      .dwattr $C$DW$185, DW_AT_bit_size(0x10)
    3064                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3065                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    3066              
    3067                      .dwendtag $C$DW$T$49
    3068              
    3069              
    3070              $C$DW$T$50      .dwtag  DW_TAG_union_type
    3071                      .dwattr $C$DW$T$50, DW_AT_name("CLKSRCCTL2_REG")
    3072                      .dwattr $C$DW$T$50, DW_AT_byte_size(0x02)
    3073              $C$DW$186       .dwtag  DW_TAG_member
    3074                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$27)
    3075                      .dwattr $C$DW$186, DW_AT_name("all")
    3076                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_all")
    3077                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3078                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    3079              
    3080              $C$DW$187       .dwtag  DW_TAG_member
    3081                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$49)
    3082                      .dwattr $C$DW$187, DW_AT_name("bit")
    3083                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_bit")
    3084                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3085                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    3086              
    3087                      .dwendtag $C$DW$T$50
    3088              
    3089              
    3090              $C$DW$T$51      .dwtag  DW_TAG_structure_type
    3091                      .dwattr $C$DW$T$51, DW_AT_name("CLKSRCCTL3_BITS")
    3092                      .dwattr $C$DW$T$51, DW_AT_byte_size(0x02)
    3093              $C$DW$188       .dwtag  DW_TAG_member
    3094                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$19)
    3095                      .dwattr $C$DW$188, DW_AT_name("XCLKOUTSEL")
    3096                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_XCLKOUTSEL")
    3097                      .dwattr $C$DW$188, DW_AT_bit_offset(0x0d)
    3098                      .dwattr $C$DW$188, DW_AT_bit_size(0x03)
    3099                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3100                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    3101              
    3102              $C$DW$189       .dwtag  DW_TAG_member
    3103                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$19)
    3104                      .dwattr $C$DW$189, DW_AT_name("rsvd1")
    3105                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_rsvd1")
    3106                      .dwattr $C$DW$189, DW_AT_bit_offset(0x00)
    3107                      .dwattr $C$DW$189, DW_AT_bit_size(0x0d)
    3108                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3109                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    3110              
    3111              $C$DW$190       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v15.12.1 Sun Feb 26 22:53:28 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   61

    3112                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$19)
    3113                      .dwattr $C$DW$190, DW_AT_name("rsvd2")
    3114                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_rsvd2")
    3115                      .dwattr $C$DW$190, DW_AT_bit_offset(0x00)
    3116                      .dwattr $C$DW$190, DW_AT_bit_size(0x10)
    3117                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3118                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    3119              
    3120                      .dwendtag $C$DW$T$51
    3121              
    3122              
    3123              $C$DW$T$52      .dwtag  DW_TAG_union_type
    3124                      .dwattr $C$DW$T$52, DW_AT_name("CLKSRCCTL3_REG")
    3125                      .dwattr $C$DW$T$52, DW_AT_byte_size(0x02)
    3126              $C$DW$191       .dwtag  DW_TAG_member
    3127                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$27)
    3128                      .dwattr $C$DW$191, DW_AT_name("all")
    3129                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_all")
    3130                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3131                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    3132              
    3133              $C$DW$192       .dwtag  DW_TAG_member
    3134                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$51)
    3135                      .dwattr $C$DW$192, DW_AT_name("bit")
    3136                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_bit")
    3137                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3138                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    3139              
    3140                      .dwendtag $C$DW$T$52
    3141              
    3142              
    3143              $C$DW$T$54      .dwtag  DW_TAG_structure_type
    3144                      .dwattr $C$DW$T$54, DW_AT_name("CLK_CFG_REGS")
    3145                      .dwattr $C$DW$T$54, DW_AT_byte_size(0x32)
    3146              $C$DW$193       .dwtag  DW_TAG_member
    3147                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$46)
    3148                      .dwattr $C$DW$193, DW_AT_name("CLKSEM")
    3149                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_CLKSEM")
    3150                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3151                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    3152              
    3153              $C$DW$194       .dwtag  DW_TAG_member
    3154                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$44)
    3155                      .dwattr $C$DW$194, DW_AT_name("CLKCFGLOCK1")
    3156                      .dwattr $C$DW$194, DW_AT_TI_symbol_name("_CLKCFGLOCK1")
    3157                      .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3158                      .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    3159              
    3160              $C$DW$195       .dwtag  DW_TAG_member
    3161                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$53)
    3162                      .dwattr $C$DW$195, DW_AT_name("rsvd1")
    3163                      .dwattr $C$DW$195, DW_AT_TI_symbol_name("_rsvd1")
    3164                      .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3165                      .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    3166              
TMS320C2000 Assembler PC v15.12.1 Sun Feb 26 22:53:28 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   62

    3167              $C$DW$196       .dwtag  DW_TAG_member
    3168                      .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$48)
    3169                      .dwattr $C$DW$196, DW_AT_name("CLKSRCCTL1")
    3170                      .dwattr $C$DW$196, DW_AT_TI_symbol_name("_CLKSRCCTL1")
    3171                      .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3172                      .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    3173              
    3174              $C$DW$197       .dwtag  DW_TAG_member
    3175                      .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$50)
    3176                      .dwattr $C$DW$197, DW_AT_name("CLKSRCCTL2")
    3177                      .dwattr $C$DW$197, DW_AT_TI_symbol_name("_CLKSRCCTL2")
    3178                      .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3179                      .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    3180              
    3181              $C$DW$198       .dwtag  DW_TAG_member
    3182                      .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$52)
    3183                      .dwattr $C$DW$198, DW_AT_name("CLKSRCCTL3")
    3184                      .dwattr $C$DW$198, DW_AT_TI_symbol_name("_CLKSRCCTL3")
    3185                      .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3186                      .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    3187              
    3188              $C$DW$199       .dwtag  DW_TAG_member
    3189                      .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$284)
    3190                      .dwattr $C$DW$199, DW_AT_name("SYSPLLCTL1")
    3191                      .dwattr $C$DW$199, DW_AT_TI_symbol_name("_SYSPLLCTL1")
    3192                      .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    3193                      .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    3194              
    3195              $C$DW$200       .dwtag  DW_TAG_member
    3196                      .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$53)
    3197                      .dwattr $C$DW$200, DW_AT_name("rsvd2")
    3198                      .dwattr $C$DW$200, DW_AT_TI_symbol_name("_rsvd2")
    3199                      .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3200                      .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    3201              
    3202              $C$DW$201       .dwtag  DW_TAG_member
    3203                      .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$286)
    3204                      .dwattr $C$DW$201, DW_AT_name("SYSPLLMULT")
    3205                      .dwattr $C$DW$201, DW_AT_TI_symbol_name("_SYSPLLMULT")
    3206                      .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3207                      .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    3208              
    3209              $C$DW$202       .dwtag  DW_TAG_member
    3210                      .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$288)
    3211                      .dwattr $C$DW$202, DW_AT_name("SYSPLLSTS")
    3212                      .dwattr $C$DW$202, DW_AT_TI_symbol_name("_SYSPLLSTS")
    3213                      .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    3214                      .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    3215              
    3216              $C$DW$203       .dwtag  DW_TAG_member
    3217                      .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$38)
    3218                      .dwattr $C$DW$203, DW_AT_name("AUXPLLCTL1")
    3219                      .dwattr $C$DW$203, DW_AT_TI_symbol_name("_AUXPLLCTL1")
    3220                      .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3221                      .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v15.12.1 Sun Feb 26 22:53:28 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   63

    3222              
    3223              $C$DW$204       .dwtag  DW_TAG_member
    3224                      .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$53)
    3225                      .dwattr $C$DW$204, DW_AT_name("rsvd3")
    3226                      .dwattr $C$DW$204, DW_AT_TI_symbol_name("_rsvd3")
    3227                      .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    3228                      .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    3229              
    3230              $C$DW$205       .dwtag  DW_TAG_member
    3231                      .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$40)
    3232                      .dwattr $C$DW$205, DW_AT_name("AUXPLLMULT")
    3233                      .dwattr $C$DW$205, DW_AT_TI_symbol_name("_AUXPLLMULT")
    3234                      .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    3235                      .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    3236              
    3237              $C$DW$206       .dwtag  DW_TAG_member
    3238                      .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$42)
    3239                      .dwattr $C$DW$206, DW_AT_name("AUXPLLSTS")
    3240                      .dwattr $C$DW$206, DW_AT_TI_symbol_name("_AUXPLLSTS")
    3241                      .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    3242                      .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    3243              
    3244              $C$DW$207       .dwtag  DW_TAG_member
    3245                      .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$282)
    3246                      .dwattr $C$DW$207, DW_AT_name("SYSCLKDIVSEL")
    3247                      .dwattr $C$DW$207, DW_AT_TI_symbol_name("_SYSCLKDIVSEL")
    3248                      .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    3249                      .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    3250              
    3251              $C$DW$208       .dwtag  DW_TAG_member
    3252                      .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$36)
    3253                      .dwattr $C$DW$208, DW_AT_name("AUXCLKDIVSEL")
    3254                      .dwattr $C$DW$208, DW_AT_TI_symbol_name("_AUXCLKDIVSEL")
    3255                      .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    3256                      .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    3257              
    3258              $C$DW$209       .dwtag  DW_TAG_member
    3259                      .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$242)
    3260                      .dwattr $C$DW$209, DW_AT_name("PERCLKDIVSEL")
    3261                      .dwattr $C$DW$209, DW_AT_TI_symbol_name("_PERCLKDIVSEL")
    3262                      .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    3263                      .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    3264              
    3265              $C$DW$210       .dwtag  DW_TAG_member
    3266                      .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$307)
    3267                      .dwattr $C$DW$210, DW_AT_name("XCLKOUTDIVSEL")
    3268                      .dwattr $C$DW$210, DW_AT_TI_symbol_name("_XCLKOUTDIVSEL")
    3269                      .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    3270                      .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    3271              
    3272              $C$DW$211       .dwtag  DW_TAG_member
    3273                      .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$21)
    3274                      .dwattr $C$DW$211, DW_AT_name("rsvd4")
    3275                      .dwattr $C$DW$211, DW_AT_TI_symbol_name("_rsvd4")
    3276                      .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
TMS320C2000 Assembler PC v15.12.1 Sun Feb 26 22:53:28 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   64

    3277                      .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    3278              
    3279              $C$DW$212       .dwtag  DW_TAG_member
    3280                      .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$200)
    3281                      .dwattr $C$DW$212, DW_AT_name("LOSPCP")
    3282                      .dwattr $C$DW$212, DW_AT_TI_symbol_name("_LOSPCP")
    3283                      .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    3284                      .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    3285              
    3286              $C$DW$213       .dwtag  DW_TAG_member
    3287                      .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$206)
    3288                      .dwattr $C$DW$213, DW_AT_name("MCDCR")
    3289                      .dwattr $C$DW$213, DW_AT_TI_symbol_name("_MCDCR")
    3290                      .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    3291                      .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    3292              
    3293              $C$DW$214       .dwtag  DW_TAG_member
    3294                      .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$305)
    3295                      .dwattr $C$DW$214, DW_AT_name("X1CNT")
    3296                      .dwattr $C$DW$214, DW_AT_TI_symbol_name("_X1CNT")
    3297                      .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    3298                      .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    3299              
    3300                      .dwendtag $C$DW$T$54
    3301              
    3302              $C$DW$215       .dwtag  DW_TAG_TI_far_type
    3303                      .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$54)
    3304              
    3305              $C$DW$T$346     .dwtag  DW_TAG_volatile_type
    3306                      .dwattr $C$DW$T$346, DW_AT_type(*$C$DW$215)
    3307              
    3308              
    3309              $C$DW$T$55      .dwtag  DW_TAG_structure_type
    3310                      .dwattr $C$DW$T$55, DW_AT_name("CPU2RESCTL_BITS")
    3311                      .dwattr $C$DW$T$55, DW_AT_byte_size(0x02)
    3312              $C$DW$216       .dwtag  DW_TAG_member
    3313                      .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$19)
    3314                      .dwattr $C$DW$216, DW_AT_name("RESET")
    3315                      .dwattr $C$DW$216, DW_AT_TI_symbol_name("_RESET")
    3316                      .dwattr $C$DW$216, DW_AT_bit_offset(0x0f)
    3317                      .dwattr $C$DW$216, DW_AT_bit_size(0x01)
    3318                      .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3319                      .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    3320              
    3321              $C$DW$217       .dwtag  DW_TAG_member
    3322                      .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$19)
